{
  "coffee-course-v1": {
    "title": "Canh tác Cà phê Robusta bền vững",
    "meta": {
      "expert": "ThS. Trần Văn Hùng",
      "field": "Cây công nghiệp",
      "duration": "10 giờ"
    },
    "image": "https://images.unsplash.com/photo-1599399325946-53243f789547?q=80&w=2070&auto=format&fit=crop",
    "imageAlt": "Vườn cà phê với những quả chín đỏ",
    "sapo": "Học cách trồng và chăm sóc cà phê Robusta để đạt năng suất cao, chất lượng tốt và thân thiện với môi trường, đáp ứng các tiêu chuẩn xuất khẩu.",
    "quizId": "coffee-course-v1",
    "chapters": [
      {
        "title": "Chương 1: Chọn giống và thiết kế vườn",
        "lessons": [
          {
            "id": "coffee-c1l1",
            "title": "Lựa chọn giống cà phê Robusta",
            "content": "<h3>Tại sao chọn đúng giống là quan trọng?</h3><p>Việc chọn giống quyết định đến 50% sự thành công của vườn cà phê, ảnh hưởng trực tiếp đến năng suất, chất lượng hạt, khả năng chống chịu sâu bệnh và sự thích nghi với điều kiện địa phương.</p><h3>Các dòng vô tính Robusta phổ biến:</h3><ul><li><strong>Dòng TR4, TR9, TR11, TR12:</strong> Các dòng do Viện Khoa học Kỹ thuật Nông Lâm nghiệp Tây Nguyên (WASI) chọn lọc, có năng suất cao (4-7 tấn nhân/ha), hạt lớn, kháng bệnh gỉ sắt tốt.</li><li><strong>Giống Thiện Trường, Xanh Lùn:</strong> Các giống do người dân tự chọn lọc, có đặc tính sinh trưởng khỏe, năng suất ổn định và thích nghi tốt với nhiều vùng sinh thái.</li></ul><p>Khi chọn giống, bà con cần mua cây giống từ các vườn ươm uy tín, đảm bảo cây khỏe mạnh, không sâu bệnh và đúng dòng đã chọn.</p>"
          },
          {
            "id": "coffee-c1l2",
            "title": "Thiết kế vườn và trồng cây che bóng",
            "content": "<h3>Thiết kế vườn cây:</h3><p>Mật độ trồng phổ biến cho cà phê Robusta là 1.100 - 1.330 cây/ha. Khoảng cách trồng thích hợp là 3m x 3m. Ở những vùng đất dốc, cần trồng theo đường đồng mức để chống xói mòn.</p><h3>Tầm quan trọng của cây che bóng:</h3><p>Trồng cây che bóng giúp điều hòa tiểu khí hậu vườn cây, giữ ẩm cho đất, hạn chế cỏ dại, cung cấp chất hữu cơ và tạo môi trường bền vững. Cây che bóng nên có tán lá không quá rậm rạp, rễ ăn sâu để không cạnh tranh dinh dưỡng với cà phê.</p><h3>Các loại cây che bóng phù hợp:</h3><ul><li><strong>Cây che bóng tạm thời:</strong> Cây chuối, muồng hoa vàng... được trồng trong những năm đầu kiến thiết.</li><li><strong>Cây che bóng lâu dài:</strong> Cây sầu riêng, bơ, hoặc các cây họ đậu như keo dậu, muồng đen... vừa che bóng vừa có thể cho thêm thu nhập.</p>"
          },
          {
            "id": "coffee-c1l3",
            "title": "Kỹ thuật trồng và bón lót",
            "content": "<h3>Thời vụ trồng:</h3><p>Tốt nhất là trồng vào đầu mùa mưa (tháng 5 - 7) để cây con có đủ nước và nhanh chóng phục hồi.</p><h3>Chuẩn bị hố trồng:</h3><p>Hố trồng cần được đào trước 1 tháng với kích thước khoảng 60x60x60 cm. Việc này giúp đất tơi xốp và diệt trừ mầm bệnh.</p><h3>Kỹ thuật bón lót:</h3><p>Mỗi hố cần được bón lót bằng hỗn hợp gồm:</p><ul><li>10-15 kg phân chuồng ủ hoai.</li><li>0.5-1 kg phân lân nung chảy.</li><li>Trộn đều phân với lớp đất mặt và lấp đầy hố.</li></ul><p>Khi trồng, dùng cuốc moi một lỗ nhỏ ở giữa hố, đặt cây con vào, lấp đất và nén nhẹ xung quanh gốc. Sau khi trồng cần tưới đẫm nước và tủ gốc bằng rơm rạ hoặc cỏ khô để giữ ẩm.</p>"
          }
        ]
      },
      {
        "title": "Chương 2: Chăm sóc và tưới nước",
        "lessons": [
          {
            "id": "coffee-c2l1",
            "title": "Tưới nước tiết kiệm và hiệu quả",
            "content": "<h3>Các giai đoạn cần nước:</h3><p>Cà phê cần nhiều nước nhất vào giai đoạn ra hoa (để hoa nở đồng loạt) và giai đoạn quả lớn nhanh. Thiếu nước trong các giai đoạn này sẽ làm giảm năng suất nghiêm trọng.</p><h3>Phương pháp tưới tiết kiệm:</h3><ul><li><strong>Tưới nhỏ giọt:</strong> Là phương pháp hiệu quả nhất, đưa nước và phân bón trực tiếp đến vùng rễ, tiết kiệm đến 40-50% lượng nước so với tưới tràn và giảm sự phát triển của cỏ dại.</li><li><strong>Tưới phun mưa tại gốc:</strong> Sử dụng béc tưới có bán kính nhỏ, tập trung nước vào khu vực gốc cây, hiệu quả hơn tưới phun mưa cả vườn.</li></ul>"
          },
          {
            "id": "coffee-c2l2",
            "title": "Kỹ thuật cắt cành, tạo tán",
            "content": "<h3>Mục đích:</h3><p>Cắt cành, tạo tán giúp loại bỏ cành già, cành sâu bệnh, cành vô hiệu (cành không cho quả) để tập trung dinh dưỡng nuôi cành khỏe mạnh và quả. Đồng thời, tạo ra một bộ tán cân đối, thông thoáng, giúp cây quang hợp tốt hơn và hạn chế sâu bệnh.</p><h3>Các loại cắt cành chính:</h3><ul><li><strong>Tạo hình cơ bản (năm 1-3):</strong> Nuôi một thân chính khỏe mạnh và loại bỏ các chồi vượt.</li><li><strong>Cắt cành kinh doanh (hàng năm):</strong> Thực hiện sau khi thu hoạch, bao gồm việc cắt bỏ cành khô, cành sâu bệnh, cành mọc chen chúc trong tán.</li><li><strong>Hãm ngọn:</strong> Khi cây đạt chiều cao 1.8 - 2m, tiến hành hãm ngọn để cây phát triển tán ngang và thuận tiện cho việc thu hái.</li></ul>"
          },
          {
            "id": "coffee-c2l3",
            "title": "Quản lý cỏ dại và thảm phủ thực vật",
            "content": "<h3>Tác hại của cỏ dại:</h3><p>Cỏ dại cạnh tranh trực tiếp dinh dưỡng, nước và ánh sáng với cây cà phê, đồng thời là nơi trú ngụ của sâu bệnh.</p><h3>Biện pháp quản lý bền vững:</h3><ul><li><strong>Làm cỏ thủ công:</strong> Dùng cuốc, dao phát để làm sạch cỏ quanh gốc, đặc biệt là vào đầu và cuối mùa mưa.</li><li><strong>Trồng cây thảm phủ:</strong> Trồng các loại cây như lạc dại (Arachis pintoi) giúp che phủ mặt đất, ngăn cản cỏ dại phát triển, giữ ẩm và cải tạo đất.</li><li><strong>Tủ gốc:</strong> Sử dụng rơm rạ, cỏ khô, hoặc tàn dư thực vật để phủ quanh gốc cà phê, giúp giữ ẩm và hạn chế cỏ mọc.</li></ul><p>Hạn chế tối đa việc sử dụng thuốc trừ cỏ hóa học để bảo vệ hệ sinh vật đất và môi trường.</p>"
          }
        ]
      },
      {
        "title": "Chương 3: Phòng trừ sâu bệnh hại",
        "lessons": [
          {
            "id": "coffee-c3l1",
            "title": "Nhận diện sâu bệnh phổ biến",
            "content": "<h3>Các loại sâu bệnh chính:</h3><ul><li><strong>Bệnh gỉ sắt (Hemileia vastatrix):</strong> Trên lá xuất hiện các đốm vàng cam, mặt dưới có lớp bột màu da cam. Bệnh nặng làm lá rụng hàng loạt, cây suy kiệt.</li><li><strong>Rệp sáp (Planococcus spp.):</strong> Gây hại ở rễ, chùm quả, kẽ lá. Rệp chích hút nhựa làm cây còi cọc, quả rụng. Chúng thường cộng sinh với kiến.</li><li><strong>Mọt đục quả (Hypothenemus hampei):</strong> Sâu non đục vào bên trong nhân, làm hỏng hạt và giảm chất lượng nghiêm trọng.</li><li><strong>Bệnh khô cành, khô quả:</strong> Do nấm Colletotrichum coffeanum gây ra, thường phát triển mạnh trong điều kiện ẩm độ cao, làm cành và quả non bị khô đen.</li></ul>"
          },
          {
            "id": "coffee-c3l2",
            "title": "Biện pháp sinh học và IPM",
            "content": "<h3>Quản lý dịch hại tổng hợp (IPM):</h3><p>Là sự kết hợp hài hòa nhiều biện pháp để kiểm soát sâu bệnh, ưu tiên các biện pháp an toàn và thân thiện môi trường.</p><h3>Các biện pháp sinh học:</h3><ul><li><strong>Bảo vệ thiên địch:</strong> Kiến vàng, bọ rùa, ong ký sinh... là những loài thiên địch tự nhiên của rệp và các loại sâu hại khác.</li><li><strong>Sử dụng chế phẩm sinh học:</strong> Dùng nấm đối kháng như Beauveria bassiana để phòng trừ mọt đục quả, hoặc Trichoderma để phòng bệnh thối rễ.</li><li><strong>Sử dụng bẫy:</strong> Dùng bẫy màu vàng để thu hút và tiêu diệt rầy, hoặc bẫy Pheromone để bắt mọt đục quả.</li></ul>"
          },
          {
            "id": "coffee-c3l3",
            "title": "Sử dụng thuốc BVTV an toàn",
            "content": "<h3>Nguyên tắc 4 đúng:</h3><p>Chỉ sử dụng thuốc bảo vệ thực vật (BVTV) khi thật sự cần thiết và phải tuân thủ nghiêm ngặt nguyên tắc 4 đúng:</p><ul><li><strong>Đúng thuốc:</strong> Chọn loại thuốc đặc trị cho đối tượng sâu bệnh cần phòng trừ.</li><li><strong>Đúng lúc:</strong> Phun khi sâu bệnh mới phát sinh hoặc ở ngưỡng có thể gây hại kinh tế.</li><li><strong>Đúng liều lượng, nồng độ:</strong> Pha thuốc theo đúng hướng dẫn trên bao bì.</li><li><strong>Đúng cách:</strong> Phun đều lên các bộ phận của cây, đảm bảo an toàn cho người phun và tuân thủ thời gian cách ly trước khi thu hoạch.</li></ul><p>Ưu tiên sử dụng các loại thuốc có nguồn gốc sinh học, ít độc hại để bảo vệ sức khỏe và môi trường.</p>"
          }
        ]
      },
      {
        "title": "Chương 4: Thu hoạch và chế biến",
        "lessons": [
          {
            "id": "coffee-c4l1",
            "title": "Thu hái cà phê đúng độ chín",
            "content": "<h3>Tầm quan trọng của thu hái:</h3><p>Chất lượng tách cà phê được quyết định ngay từ khâu thu hái. Thu hoạch đúng độ chín đảm bảo hạt cà phê tích lũy đủ lượng đường, hương vị phong phú và trọng lượng tối đa.</p><h3>Phương pháp thu hái:</h3><ul><li><strong>Hái lựa (Selective Picking):</strong> Là phương pháp tốt nhất, công nhân chỉ hái những quả cà phê đã chín đỏ mọng. Phương pháp này đòi hỏi nhiều công sức nhưng cho chất lượng hạt cao nhất, phù hợp để chế biến cà phê đặc sản.</li><li><strong>Tuốt cành (Stripping):</strong> Thu hoạch toàn bộ quả trên cành, bao gồm cả quả xanh, chín và quá chín. Phương pháp này nhanh hơn nhưng chất lượng không đồng đều, cần phải phân loại kỹ sau khi hái.</li></ul><p>Nên thu hái vào những ngày khô ráo, tránh làm dập nát quả.</p>"
          },
          {
            "id": "coffee-c4l2",
            "title": "Các phương pháp chế biến (khô, ướt)",
            "content": "<h3>Chế biến khô (Natural/Dry Process):</h3><p>Đây là phương pháp truyền thống. Quả cà phê sau khi thu hái sẽ được dàn mỏng trên sân phơi hoặc giàn phơi dưới ánh nắng mặt trời trong khoảng 3-4 tuần, đảo đều thường xuyên cho đến khi độ ẩm còn khoảng 11-12%. Phương pháp này tạo ra cà phê có vị ngọt đậm, body dày và ít chua.</p><h3>Chế biến ướt (Washed/Wet Process):</h3><p>Quy trình phức tạp hơn:</p><ol><li><strong>Xát vỏ:</strong> Loại bỏ lớp vỏ thịt ngay sau khi thu hái.</li><li><strong>Lên men:</strong> Ngâm hạt trong bể nước từ 12-36 giờ để loại bỏ lớp nhớt.</li><li><strong>Rửa sạch:</strong> Rửa sạch lớp nhớt đã bị phân hủy.</li><li><strong>Phơi/sấy khô:</strong> Phơi khô hạt đến độ ẩm yêu cầu.</li></ol><p>Phương pháp này tạo ra cà phê có hương vị trong trẻo, tinh tế, độ chua rõ nét.</p>"
          },
          {
            "id": "coffee-c4l3",
            "title": "Bảo quản cà phê nhân xanh",
            "content": "<h3>Mục tiêu:</h3><p>Bảo quản cà phê nhân xanh đúng cách giúp duy trì chất lượng, hương vị và tránh bị nấm mốc, côn trùng tấn công.</p><h3>Yêu cầu kỹ thuật:</h3><ul><li><strong>Độ ẩm:</strong> Độ ẩm lý tưởng của hạt cà phê nhân để bảo quản là 12.5%. Hạt quá khô sẽ giòn, dễ vỡ; hạt quá ẩm sẽ dễ bị mốc.</li><li><strong>Bao bì:</strong> Sử dụng các loại bao chuyên dụng như bao đay, hoặc tốt hơn là bao GrainPro có lớp lót nhựa để cách ly hạt với môi trường bên ngoài.</li><li><strong>Kho chứa:</strong> Kho phải khô ráo, thoáng mát, sạch sẽ, không có mùi lạ và tránh ánh nắng trực tiếp. Kê các bao cà phê trên pallet, cách tường và sàn để không khí lưu thông.</li></ul>"
          }
        ]
      }
    ]
  },
  "pepper-course-v1": {
    "title": "Thâm canh Hồ tiêu theo tiêu chuẩn VietGAP",
    "meta": {
      "expert": "KS. Lê Thị Lan Anh",
      "field": "Cây công nghiệp",
      "duration": "9 giờ"
    },
    "image": "https://images.unsplash.com/photo-1629033819974-272d3637651a?q=80&w=1964&auto=format&fit=crop",
    "imageAlt": "Dây hồ tiêu đen trên trụ",
    "sapo": "Cung cấp quy trình kỹ thuật trồng và chăm sóc hồ tiêu tiên tiến, tập trung vào việc phòng trừ bệnh hại và tạo ra sản phẩm an toàn, chất lượng cao.",
    "quizId": "pepper-course-v1",
    "chapters": [
      {
        "title": "Chương 1: Giống và Trụ tiêu",
        "lessons": [
          {
            "id": "pepper-c1l1",
            "title": "Chọn giống tiêu và nhân giống",
            "content": "<h3>Tầm quan trọng của giống:</h3><p>Giống là yếu tố quyết định năng suất và khả năng chống chịu sâu bệnh của vườn tiêu. VietGAP yêu cầu giống phải có nguồn gốc rõ ràng, sạch bệnh.</p><h3>Các giống tiêu phổ biến:</h3><ul><li><strong>Giống Vĩnh Linh:</strong> Rất phổ biến, sinh trưởng khỏe, chịu hạn tốt, năng suất cao nhưng dễ nhiễm bệnh chết nhanh.</li><li><strong>Giống Lộc Ninh, Sẻ:</strong> Giống địa phương, thơm, cay, chất lượng hạt tốt, có khả năng chống chịu khá tốt với điều kiện địa phương.</li><li><strong>Giống Ấn Độ (Anbipur):</strong> Gié dài, hạt to, năng suất cao, nhưng cần đầu tư thâm canh cao.</li></ul><h3>Kỹ thuật nhân giống:</h3><p>Chủ yếu nhân giống bằng hom. Chọn những dây thân mập mạp, khỏe mạnh, sạch sâu bệnh để cắt hom. Mỗi hom có 3-5 mắt, sau khi cắt được giâm trong bầu đất tơi xốp, che mát để hom ra rễ trước khi đem trồng.</p>"
          },
          {
            "id": "pepper-c1l2",
            "title": "Lựa chọn và xử lý trụ (trụ sống, trụ chết)",
            "content": "<h3>Trụ sống:</h3><p><strong>Ưu điểm:</strong> Điều hòa tiểu khí hậu, giữ ẩm, chi phí ban đầu thấp. <strong>Nhược điểm:</strong> Cạnh tranh dinh dưỡng, có thể là ký chủ của sâu bệnh, khó quản lý tán. <strong>Các loại cây trụ sống phổ biến:</strong> Cây lồng mức (gòn), keo dậu, muồng đen, anh đào giả.</p><h3>Trụ chết:</h3><p><strong>Ưu điểm:</strong> Không cạnh tranh dinh dưỡng, dễ quản lý, vườn thông thoáng. <strong>Nhược điểm:</strong> Chi phí đầu tư cao, tuổi thọ có hạn (trụ gỗ), mùa khô gây nóng cho cây tiêu. <strong>Các loại trụ chết phổ biến:</strong> Trụ gỗ, trụ bê tông.</p><h3>Xử lý trụ:</h3><p>Đối với trụ gỗ, cần ngâm hoặc xử lý để tăng độ bền. Đối với trụ sống, cần trồng trước ít nhất 1 năm để trụ đủ lớn và vững chãi trước khi cho tiêu leo bám.</p>"
          },
          {
            "id": "pepper-c1l3",
            "title": "Kỹ thuật trồng và chăm sóc cây con",
            "content": "<h3>Thời vụ và mật độ:</h3><p>Trồng vào đầu mùa mưa là tốt nhất. Mật độ trồng phổ biến khoảng 1.600 - 2.500 trụ/ha, tùy thuộc vào loại trụ và địa hình.</p><h3>Chuẩn bị hố trồng:</h3><p>Đào hố kích thước 50x50x50 cm. Bón lót mỗi hố bằng 10-15kg phân chuồng hoai mục + 0.5kg phân lân + 0.5kg vôi. Trộn đều với đất và lấp hố trước khi trồng 1 tháng.</p><h3>Kỹ thuật trồng:</h3><p>Đặt bầu tiêu nghiêng về phía trụ, lấp đất và nén chặt. Dùng dây mềm buộc dây tiêu vào trụ. Sau khi trồng cần tưới nước và tủ gốc bằng cỏ khô để giữ ẩm.</p>"
          }
        ]
      },
      {
        "title": "Chương 2: Quản lý dinh dưỡng",
        "lessons": [
          {
            "id": "pepper-c2l1",
            "title": "Bón phân hữu cơ và vô cơ",
            "content": "<h3>Tầm quan trọng của phân hữu cơ:</h3><p>Phân hữu cơ là nền tảng của canh tác bền vững. Bón 15-20kg phân chuồng hoai mục/trụ hàng năm giúp cải tạo đất, tăng vi sinh vật có lợi, giúp rễ tiêu phát triển khỏe mạnh và tăng khả năng chống chịu bệnh tật.</p><h3>Bón phân vô cơ (NPK) theo giai đoạn:</h3><ul><li><strong>Giai đoạn kiến thiết (1-3 năm):</strong> Bón phân có hàm lượng đạm cao để cây phát triển thân, lá.</li><li><strong>Giai đoạn kinh doanh (từ năm thứ 3):</strong> Bón phân cân đối, tăng hàm lượng lân và kali vào giai đoạn trước ra hoa và nuôi quả. Lượng bón và số lần bón phụ thuộc vào độ phì của đất và năng suất của vườn cây.</li></ul><p>VietGAP khuyến khích sử dụng phân bón thông minh, phân bón tan chậm để giảm thất thoát ra môi trường.</p>"
          },
          {
            "id": "pepper-c2l2",
            "title": "Quản lý đất và độ ẩm",
            "content": "<h3>Thoát nước là ưu tiên hàng đầu:</h3><p>Cây tiêu cực kỳ nhạy cảm với úng nước, là nguyên nhân chính gây bệnh chết nhanh. Vườn phải có hệ thống rãnh thoát nước tốt, đặc biệt là ở những vùng đất bằng. Mùa mưa cần khơi thông rãnh, tránh nước đọng quanh gốc.</p><h3>Quản lý độ ẩm:</h3><p>Tủ gốc bằng cỏ khô, rơm rạ vào mùa khô để giữ ẩm và giữ mát cho bộ rễ. Trồng cây che phủ đất như lạc dại cũng là một giải pháp tốt. Tưới nước đầy đủ vào giai đoạn khô hạn, đặc biệt là khi cây đang ra hoa và nuôi quả.</p>"
          },
          {
            "id": "pepper-c2l3",
            "title": "Tỉa cành và tạo hình cho cây tiêu",
            "content": "<h3>Mục đích:</h3><p>Tạo cho cây có bộ tán cân đối, thông thoáng, loại bỏ cành vô hiệu, cành sâu bệnh để tập trung dinh dưỡng nuôi quả.</p><h3>Kỹ thuật:</h3><ul><li><strong>Buộc dây:</strong> Thường xuyên buộc các dây thân vào trụ để tránh bị gió làm gãy.</li><li><strong>Tỉa cành:</strong> Cắt bỏ các cành ở gần mặt đất (cách gốc 30-40cm) để tránh lây bệnh từ đất. Loại bỏ các cành mọc yếu, cành bị sâu bệnh, cành mọc quá dày trong tán.</li><li><strong>Đôn tiêu (bấm ngọn):</strong> Khi tiêu leo lên gần đỉnh trụ, bấm ngọn để cây phát triển cành ngang (cành cho quả).</li></ul>"
          }
        ]
      },
      {
        "title": "Chương 3: Phòng bệnh hại",
        "lessons": [
          {
            "id": "pepper-c3l1",
            "title": "Bệnh chết nhanh, chết chậm",
            "content": "<h3>Bệnh chết nhanh (do nấm Phytophthora):</h3><p><strong>Triệu chứng:</strong> Cây đang xanh tốt đột ngột héo rũ, lá và gié quả không kịp rụng. Bệnh lây lan rất nhanh qua nước, thường xảy ra vào mùa mưa ở những vườn bị úng nước. <strong>Phòng trừ:</strong> Thoát nước tốt là biện pháp quan trọng nhất. Sử dụng nấm đối kháng Trichoderma bón vào gốc. Khi có bệnh, dùng các loại thuốc đặc trị gốc Metalaxyl, Mancozeb...</p><h3>Bệnh chết chậm (do tuyến trùng và nấm Fusarium):</h3><p><strong>Triệu chứng:</strong> Cây vàng lá từ từ, sinh trưởng kém, lá rụng dần rồi chết. Rễ có các nốt sần do tuyến trùng. <strong>Phòng trừ:</strong> Bón nhiều phân hữu cơ. Sử dụng các chế phẩm sinh học để kiểm soát tuyến trùng. Luân canh cây trồng khi trồng mới.</p>"
          },
          {
            "id": "pepper-c3l2",
            "title": "Bệnh thán thư và tuyến trùng",
            "content": "<h3>Bệnh thán thư (do nấm Colletotrichum):</h3><p>Gây hại trên lá, gié hoa và quả, tạo thành các đốm cháy màu nâu đen. Bệnh phát triển mạnh khi thời tiết ẩm ướt. <strong>Phòng trừ:</strong> Tỉa cành thông thoáng, phun các loại thuốc gốc đồng hoặc Hexaconazole khi bệnh chớm xuất hiện.</p><h3>Tuyến trùng hại rễ:</h3><p>Là sinh vật rất nhỏ sống trong đất, chích hút rễ tạo thành các khối u sần, mở đường cho nấm bệnh xâm nhập. <strong>Phòng trừ:</strong> Tăng cường bón phân hữu cơ để cải tạo đất. Sử dụng các loại thuốc trừ tuyến trùng sinh học hoặc hóa học khi mật độ cao.</p>"
          },
          {
            "id": "pepper-c3l3",
            "title": "Biện pháp phòng trừ tổng hợp",
            "content": "<h3>Canh tác là gốc:</h3><p>Áp dụng các biện pháp canh tác bền vững là cách phòng bệnh hiệu quả nhất. Bao gồm: chọn giống khỏe, mật độ hợp lý, thoát nước tốt, bón phân cân đối, tăng cường hữu cơ.</p><h3>Sử dụng biện pháp sinh học:</h3><p>Bảo vệ các loài thiên địch. Sử dụng các chế phẩm sinh học như nấm đối kháng Trichoderma, Paecilomyces để kiểm soát mầm bệnh trong đất.</p><h3>Sử dụng thuốc hóa học theo nguyên tắc:</h3><p>Chỉ dùng thuốc khi thật sự cần thiết, ưu tiên thuốc sinh học. Tuân thủ nghiêm ngặt nguyên tắc '4 đúng' và ghi chép nhật ký sử dụng thuốc theo yêu cầu của VietGAP.</p>"
          }
        ]
      },
      {
        "title": "Chương 4: Thu hoạch và Bảo quản",
        "lessons": [
          {
            "id": "pepper-c4l1",
            "title": "Xác định thời điểm thu hoạch",
            "content": "<h3>Dấu hiệu thu hoạch:</h3><p>Thu hoạch khi trên gié tiêu có khoảng 5-10% số quả chuyển sang màu vàng hoặc đỏ. Đây là lúc hạt đã chắc, đạt trọng lượng và hàm lượng piperine (chất tạo vị cay) cao nhất.</p><p>Không nên thu hoạch khi quả còn quá xanh (hạt lép, không thơm) hoặc quá chín (dễ rụng, khó bảo quản).</p>"
          },
          {
            "id": "pepper-c4l2",
            "title": "Kỹ thuật thu hái và sơ chế",
            "content": "<h3>Thu hái:</h3><p>Dùng thang và hái bằng tay toàn bộ gié tiêu, tránh làm gãy cành hoặc tuốt mạnh làm tổn thương dây. Nên thu hoạch vào ngày nắng ráo.</p><h3>Sơ chế:</h3><p>Tiêu sau khi hái về cần được tuốt hạt ra khỏi gié. Có thể tuốt bằng tay hoặc bằng máy. Loại bỏ các tạp chất như lá, cành trước khi đem phơi.</p>"
          },
          {
            "id": "pepper-c4l3",
            "title": "Bảo quản tiêu đen và tiêu sọ",
            "content": "<h3>Chế biến tiêu đen:</h3><p>Hạt tiêu sau khi tuốt được đem phơi trực tiếp dưới nắng trên sân gạch, xi măng hoặc bạt sạch. Phơi liên tục 3-5 ngày, đảo đều cho đến khi vỏ ngoài săn lại, chuyển màu đen và độ ẩm còn khoảng 12-13%.</p><h3>Chế biến tiêu sọ (tiêu trắng):</h3><p>Hạt tiêu chín được ngâm trong nước 7-10 ngày để vỏ mềm ra, sau đó chà xát để loại bỏ vỏ. Phần sọ bên trong được rửa sạch và đem phơi khô. Tiêu sọ có giá trị cao hơn nhưng quy trình phức tạp hơn.</p><h3>Bảo quản:</h3><p>Tiêu khô sau khi làm sạch được đóng vào bao hai lớp (lớp trong là nilon) và bảo quản nơi khô ráo, thoáng mát, tránh ánh sáng trực tiếp để giữ được hương vị lâu dài.</p>"
          }
        ]
      }
    ]
  },
  "durian-course-v1": {
    "title": "Kỹ thuật canh tác Sầu riêng Monthong & Ri6",
    "meta": {
      "expert": "ThS. Hoàng Minh Đức",
      "field": "Cây ăn quả",
      "duration": "12 giờ"
    },
    "image": "https://images.unsplash.com/photo-1608783459362-34d1d91b5a2f?q=80&w=1964&auto=format&fit=crop",
    "imageAlt": "Quả sầu riêng trên cây",
    "sapo": "Làm chủ kỹ thuật trồng và chăm sóc sầu riêng, từ khâu chọn giống, xử lý ra hoa đến phòng trừ bệnh xì mủ, thán thư để tối đa hóa lợi nhuận.",
    "quizId": "durian-course-v1",
    "chapters": [
      {
        "title": "Chương 1: Kiến thức cơ bản",
        "lessons": [
          {
            "id": "durian-c1l1",
            "title": "Đặc điểm sinh thái cây sầu riêng",
            "content": "<h3>Yêu cầu về khí hậu:</h3><p>Sầu riêng là cây nhiệt đới điển hình, ưa khí hậu nóng ẩm, mưa nhiều. Nhiệt độ thích hợp nhất cho cây sinh trưởng là từ 24-32°C. Cây không chịu được sương giá và gió mạnh (cành giòn, dễ gãy).</p><h3>Yêu cầu về đất đai:</h3><p>Đây là yếu tố quan trọng nhất. Sầu riêng yêu cầu đất phải:</p><ul><li><strong>Tầng canh tác dày:</strong> Bộ rễ cần không gian để phát triển sâu, do đó tầng đất phải dày ít nhất 1m.</li><li><strong>Thoát nước cực tốt:</strong> Cây sầu riêng cực kỳ ghét úng nước. Vườn bị đọng nước vào mùa mưa chắc chắn sẽ bị bệnh thối rễ, xì mủ. Đất dốc nhẹ là một lợi thế.</li><li><strong>Giàu hữu cơ:</strong> Đất tơi xốp, giàu mùn sẽ giúp bộ rễ phát triển khỏe mạnh, tăng khả năng chống chịu sâu bệnh.</li></ul>"
          },
          {
            "id": "durian-c1l2",
            "title": "So sánh giống Monthong và Ri6",
            "content": "<h3>Giống Ri6:</h3><p>Là giống sầu riêng của Việt Nam, được trồng rất phổ biến. <strong>Đặc điểm:</strong> Trái hình tròn hoặc bầu dục, cơm màu vàng đậm, hạt lép, vị ngọt đậm và béo, mùi thơm nồng đặc trưng. <strong>Ưu điểm:</strong> Dễ trồng, thích nghi tốt, được thị trường nội địa ưa chuộng.</p><h3>Giống Monthong (Gối Vàng):</h3><p>Là giống của Thái Lan, được mệnh danh là 'vua' của sầu riêng xuất khẩu. <strong>Đặc điểm:</strong> Trái to, dài, có hình dạng giống quả bí ngô. Cơm rất dày, màu vàng nhạt, vị ngọt thanh, béo ngậy, gần như không có xơ, và mùi thơm nhẹ hơn Ri6. <strong>Ưu điểm:</strong> Năng suất cao, thời gian bảo quản sau thu hoạch dài, đáp ứng tốt tiêu chuẩn xuất khẩu.</p><h3>Lựa chọn:</h3><p>Việc chọn giống phụ thuộc vào thị trường mục tiêu. Nếu hướng đến xuất khẩu, Monthong là lựa chọn hàng đầu. Nếu tập trung vào thị trường nội địa, Ri6 vẫn là một giống rất tốt và dễ canh tác hơn.</p>"
          },
          {
            "id": "durian-c1l3",
            "title": "Thiết kế vườn và hệ thống tưới",
            "content": "<h3>Thiết kế vườn:</h3><p>Ở những vùng đất bằng phẳng, bắt buộc phải lên mô (liếp) cao từ 0.8-1.2m để đảm bảo thoát nước tốt. Mật độ trồng sầu riêng phải thưa để cây có đủ không gian và ánh sáng, khoảng cách phổ biến là 8m x 10m hoặc 10m x 10m (khoảng 100-125 cây/ha). Cần thiết kế hệ thống mương rãnh để thoát nước hiệu quả vào mùa mưa.</p><h3>Hệ thống tưới:</h3><p>Đầu tư hệ thống tưới tự động ngay từ đầu là một quyết định khôn ngoan. Hệ thống tưới phun mưa tại gốc hoặc tưới nhỏ giọt là phù hợp nhất, giúp cung cấp nước đều, tiết kiệm nước và có thể kết hợp bón phân qua hệ thống tưới một cách dễ dàng.</p>"
          }
        ]
      },
      {
        "title": "Chương 2: Chăm sóc kiến thiết",
        "lessons": [
          {
            "id": "durian-c2l1",
            "title": "Kỹ thuật trồng và chăm sóc cây con",
            "content": "<h3>Kỹ thuật trồng:</h3><p>Sau khi chuẩn bị mô và bón lót, đặt cây giống vào hố, lấp đất và tưới đẫm. Cần che nắng cho cây con trong vài tháng đầu để cây không bị sốc nhiệt và cháy lá. Che chắn kỹ vào mùa khô và thoát nước tốt vào mùa mưa là hai yếu tố sống còn cho cây con.</p><h3>Chăm sóc:</h3><p>Giai đoạn này (1-3 năm đầu) cần giữ ẩm đất liên tục nhưng không được úng. Bón phân định kỳ (2-3 tháng/lần) với các loại phân NPK có hàm lượng đạm và lân cao để thúc đẩy phát triển thân lá và rễ.</p>"
          },
          {
            "id": "durian-c2l2",
            "title": "Tạo tán, tỉa cành giai đoạn nhỏ",
            "content": "<h3>Mục đích:</h3><p>Tạo một bộ khung tán khỏe mạnh, cân đối và thông thoáng. Việc này quyết định khả năng mang trái của cây sau này.</p><h3>Kỹ thuật:</h3><ul><li>Để lại một thân chính duy nhất.</li><li>Khi cây cao khoảng 1m, bắt đầu chọn các cành cấp 1. Cành cấp 1 đầu tiên nên cách mặt đất ít nhất 0.8m.</li><li>Chọn giữ lại các cành khỏe mạnh, mọc theo các hướng khác nhau, cách nhau khoảng 20-30cm.</li><li>Thường xuyên tỉa bỏ các cành mọc yếu, cành mọc đứng, cành bị sâu bệnh và các chồi mọc từ gốc ghép.</li></ul>"
          },
          {
            "id": "durian-c2l3",
            "title": "Quản lý dinh dưỡng và cỏ dại",
            "content": "<h3>Dinh dưỡng:</h3><p>Trong 3 năm đầu, cây cần dinh dưỡng để sinh trưởng. Bón phân NPK kết hợp với phân hữu cơ hoai mục. Phun bổ sung phân bón lá chứa các vi lượng như Kẽm (Zn), Mangan (Mn), Sắt (Fe) để giúp lá xanh tốt, quang hợp mạnh.</p><h3>Quản lý cỏ dại:</h3><p>Làm sạch cỏ quanh gốc (đường kính 1.5-2m). Phần còn lại trong vườn có thể dùng máy cắt cỏ hoặc giữ thảm thực vật thấp để chống xói mòn và giữ ẩm. Hạn chế tối đa việc dùng thuốc trừ cỏ, đặc biệt là gần gốc cây con.</p>"
          }
        ]
      },
      {
        "title": "Chương 3: Xử lý ra hoa, đậu quả",
        "lessons": [
          {
            "id": "durian-c3l1",
            "title": "Tạo mầm hoa và xử lý ra hoa",
            "content": "<h3>Điều kiện cây sẵn sàng:</h3><p>Cây phải khỏe mạnh, đã ra ít nhất 2-3 cơi đọt hoàn chỉnh, lá già và dày.</p><h3>Kỹ thuật xử lý:</h3><ol><li><strong>Tạo khô hạn (xiết nước):</strong> Ngưng tưới nước trong khoảng 10-14 ngày để tạo stress cho cây.</li><li><strong>Phun tạo mầm:</strong> Sử dụng các sản phẩm tạo mầm hoa chuyên dụng chứa Lân (P) và Kali (K) cao (ví dụ MKP, NPK 10-60-10) phun lên lá.</li><li><strong>Tưới lại:</strong> Sau khi thấy mắt cua (mầm hoa) nhú ra rõ, tiến hành tưới nước đẫm trở lại để kích thích hoa nở đồng loạt.</li></ol>"
          },
          {
            "id": "durian-c3l2",
            "title": "Thụ phấn bổ sung và tỉa quả",
            "content": "<h3>Thụ phấn bổ sung:</h3><p>Hoa sầu riêng nở vào ban đêm và tỷ lệ thụ phấn tự nhiên khá thấp. Để tăng tỷ lệ đậu quả và giúp quả tròn đều, việc thụ phấn bổ sung là cực kỳ cần thiết. Vào khoảng 7-9h tối, dùng chổi lông mềm quét nhẹ lên nhị của hoa này để lấy phấn, sau đó quét lên đầu nhụy của hoa khác.</p><h3>Tỉa quả:</h3><p>Đây là kỹ thuật bắt buộc để có được những trái sầu riêng chất lượng. Tỉa bỏ những quả méo mó, quả bị sâu bệnh, quả nhỏ và những quả mọc quá chen chúc. Mỗi chùm chỉ nên giữ lại 1-2 quả khỏe mạnh nhất. Việc tỉa quả giúp cây tập trung dinh dưỡng, tạo ra những quả to, đều và chất lượng cao, đồng thời tránh làm gãy cành do mang quá nặng.</p>"
          },
          {
            "id": "durian-c3l3",
            "title": "Phòng trừ sâu bệnh giai đoạn mang trái",
            "content": "<h3>Các đối tượng nguy hiểm nhất:</h3><ul><li><strong>Sâu đục trái:</strong> Gây thiệt hại trực tiếp đến sản phẩm. Biện pháp hiệu quả nhất là bao trái hoặc phun các loại thuốc sinh học, hóa học được cấp phép và tuân thủ thời gian cách ly.</li><li><strong>Rệp sáp:</strong> Chích hút nhựa làm quả non rụng, quả lớn chậm phát triển và làm giảm mẫu mã.</li><li><strong>Bệnh thối trái do nấm Phytophthora:</strong> Bệnh phát triển mạnh vào mùa mưa, gây thối quả hàng loạt. Cần giữ vườn thông thoáng, thoát nước tốt, thu gom và tiêu hủy quả bệnh, phun thuốc phòng trừ khi áp lực bệnh cao.</li></ul>"
          }
        ]
      },
      {
        "title": "Chương 4: Phục hồi cây sau thu hoạch",
        "lessons": [
          {
            "id": "durian-c4l1",
            "title": "Kỹ thuật thu hoạch và bảo quản",
            "content": "<h3>Xác định độ chín:</h3><p>Dựa vào các dấu hiệu như gai nở đều, vỏ có màu sắc đặc trưng của giống, gõ vào quả nghe tiếng 'bộp bộp' và ngửi thấy mùi thơm. Quan trọng nhất là tính toán đúng số ngày từ khi hoa nở (thường từ 100-120 ngày tùy giống và điều kiện thời tiết).</p><h3>Thu hoạch:</h3><p>Phải cắt cả cuống, không để quả rụng tự nhiên (đặc biệt là Monthong) vì sẽ làm giảm chất lượng và thời gian bảo quản. Cắt nhẹ nhàng, tránh làm dập gai hoặc tổn thương quả.</p>"
          },
          {
            "id": "durian-c4l2",
            "title": "Tỉa cành và vệ sinh vườn",
            "content": "<h3>Tầm quan trọng:</h3><p>Đây là công việc quan trọng nhất sau khi thu hoạch. Cây đã dồn toàn bộ sức lực để nuôi quả và trở nên suy kiệt. Tỉa cành giúp loại bỏ gánh nặng, tạo điều kiện cho cây ra cơi đọt mới để chuẩn bị cho vụ sau.</p><h3>Các bước thực hiện:</h3><ul><li>Cắt bỏ toàn bộ cành đã cho quả, cành khô, cành sâu bệnh, cành mọc yếu trong tán.</li><li>Mở 'cửa sổ' cho tán cây, đảm bảo ánh sáng có thể lọt vào bên trong, giúp giảm sâu bệnh.</li><li>Thu gom toàn bộ cành lá, quả rụng ra khỏi vườn để tiêu hủy, cắt đứt nguồn bệnh.</li></ul>"
          },
          {
            "id": "durian-c4l3",
            "title": "Bón phân phục hồi cây",
            "content": "<h3>Mục tiêu:</h3><p>Bù đắp lại lượng dinh dưỡng khổng lồ mà cây đã sử dụng để nuôi quả, đồng thời kích thích cây ra cơi đọt mới đồng loạt và khỏe mạnh.</p><h3>Cách bón:</h3><ul><li><strong>Phân hữu cơ:</strong> Bón một lượng lớn phân hữu cơ (20-30kg/gốc) hoặc phân hữu cơ vi sinh. Đây là nền tảng để phục hồi sức khỏe của đất và bộ rễ.</li><li><strong>Phân hóa học:</strong> Bón NPK có hàm lượng đạm cao (ví dụ 30-20-10 hoặc 20-20-15) kết hợp với các sản phẩm kích rễ.</li><li><strong>Phun qua lá:</strong> Phun các loại phân bón lá chứa amino acid, rong biển và vi lượng để giúp cây hấp thu nhanh, nhanh chóng ra đọt mới.</li></ul><p>Một cơi đọt mới khỏe mạnh là tiền đề cho một vụ mùa bội thu tiếp theo.</p>"
          }
        ]
      }
    ]
  },
  "hydroponics-v1": {
    "title": "Nông nghiệp công nghệ cao: Thủy canh",
    "meta": {
      "expert": "ThS. Đỗ Anh Khoa",
      "field": "Trồng trọt công nghệ cao",
      "duration": "7 giờ"
    },
    "image": "https://images.unsplash.com/photo-1605578334826-42756ad28a42?q=80&w=2070&auto=format&fit=crop",
    "imageAlt": "Hệ thống rau thủy canh trong trang trại",
    "sapo": "Khám phá và ứng dụng kỹ thuật trồng rau bằng phương pháp thủy canh, từ quy mô gia đình đến trang trại thương mại.",
    "quizId": "hydroponics-v1",
    "chapters": [
      {
        "title": "Chương 1: Giới thiệu về thủy canh",
        "lessons": [
          {
            "id": "hydro-c1l1",
            "title": "Lịch sử và ưu điểm của thủy canh",
            "content": "<h3>Thủy canh là gì?</h3><p>Thủy canh (Hydroponics) là kỹ thuật trồng cây không sử dụng đất. Thay vào đó, rễ cây được trồng trực tiếp trong dung dịch dinh dưỡng hoặc trong các giá thể trơ (như xơ dừa, sỏi nhẹ, đá perlite) và được cung cấp dinh dưỡng qua một dung dịch nước đã được pha chế.</p><h3>Ưu điểm vượt trội:</h3><ul><li><strong>Tiết kiệm nước:</strong> Các hệ thống thủy canh hồi lưu có thể tiết kiệm đến 90% lượng nước so với canh tác truyền thống.</li><li><strong>Tăng năng suất:</strong> Cây được cung cấp dinh dưỡng tối ưu và liên tục nên phát triển nhanh hơn, cho năng suất cao hơn trên cùng một diện tích.</li><li><strong>Không phụ thuộc vào đất:</strong> Có thể trồng ở bất cứ đâu, từ ban công, sân thượng đến các vùng đất cằn cỗi, sa mạc.</li><li><strong>Kiểm soát sâu bệnh:</strong> Loại bỏ được các mầm bệnh và sâu hại từ đất, giảm thiểu việc sử dụng thuốc bảo vệ thực vật.</li><li><strong>Chất lượng sản phẩm:</strong> Rau sạch, an toàn, đồng đều về chất lượng và mẫu mã.</li></ul>"
          },
          {
            "id": "hydro-c1l2",
            "title": "Các hệ thống thủy canh phổ biến",
            "content": "<h3>Phân loại hệ thống:</h3><p>Có nhiều hệ thống thủy canh khác nhau, nhưng phổ biến nhất là:</p><ul><li><strong>Thủy canh tĩnh (DWC - Deep Water Culture):</strong> Rễ cây được ngâm trực tiếp trong một bể chứa dung dịch dinh dưỡng có sục khí oxy liên tục. Đây là hệ thống đơn giản, dễ làm tại nhà.</li><li><strong>Thủy canh hồi lưu (NFT - Nutrient Film Technique):</strong> Một dòng dung dịch dinh dưỡng mỏng chảy liên tục qua các ống nhựa, lướt qua bộ rễ của cây. Hệ thống này rất hiệu quả cho các loại rau ăn lá.</li><li><strong>Hệ thống nhỏ giọt (Drip System):</strong> Dung dịch dinh dưỡng được bơm và nhỏ giọt từ từ vào gốc từng cây. Thường được áp dụng cho các cây lớn hơn như cà chua, dưa chuột.</li><li><strong>Hệ thống bấc (Wick System):</strong> Là hệ thống thụ động đơn giản nhất, sử dụng một sợi bấc để hút dung dịch dinh dưỡng từ bể chứa lên giá thể trồng cây.</li></ul><p>Việc lựa chọn hệ thống phụ thuộc vào quy mô, loại cây trồng và mức độ đầu tư.</p>"
          },
          {
            "id": "hydro-c1l3",
            "title": "Lựa chọn cây trồng phù hợp",
            "content": "<h3>Các loại cây dễ trồng nhất:</h3><p>Hầu hết các loại cây đều có thể trồng thủy canh, nhưng một số loại đặc biệt phù hợp và cho hiệu quả kinh tế cao:</p><ul><li><strong>Rau ăn lá:</strong> Xà lách, rau diếp, cải bó xôi, cải kale, cải ngọt... là những lựa chọn hàng đầu. Chúng phát triển rất nhanh và có thể thu hoạch liên tục.</li><li><strong>Rau gia vị:</strong> Húng quế, bạc hà, rau mùi, kinh giới... phát triển rất tốt trong hệ thống thủy canh.</li><li><strong>Cây ăn quả (quy mô lớn hơn):</strong> Cà chua, dưa chuột, ớt chuông, dâu tây... đòi hỏi hệ thống lớn hơn và quy trình chăm sóc phức tạp hơn nhưng cho giá trị kinh tế cao.</li></ul><p>Đối với người mới bắt đầu, nên chọn các loại rau ăn lá để dễ dàng thành công trong lần đầu tiên.</p>"
          }
        ]
      },
      {
        "title": "Chương 2: Thiết lập hệ thống",
        "lessons": [
          {
            "id": "hydro-c2l1",
            "title": "Vật liệu và thiết bị cần thiết",
            "content": "<h3>Danh sách thiết bị cơ bản:</h3><ul><li><strong>Thùng/Bể chứa dung dịch:</strong> Dùng để chứa dung dịch dinh dưỡng. Phải làm bằng vật liệu không trong suốt để ngăn ánh sáng, tránh rêu tảo phát triển.</li><li><strong>Máy bơm chìm:</strong> Dùng để bơm dung dịch trong các hệ thống hồi lưu (NFT, nhỏ giọt).</li><li><strong>Máy sục khí oxy:</strong> Cực kỳ quan trọng cho hệ thống thủy canh tĩnh (DWC) để cung cấp oxy cho rễ.</li><li><strong>Ống dẫn, rọ nhựa:</strong> Ống PVC dùng cho hệ thống NFT, rọ nhựa để đựng giá thể và cây con.</li><li><strong>Giá thể:</strong> Xơ dừa, trấu hun, sỏi nhẹ (đá leca), đá perlite, hoặc viên nén rockwool.</li><li><strong>Bút đo pH và EC:</strong> Dụng cụ bắt buộc để kiểm soát chất lượng dung dịch dinh dưỡng.</li></ul>"
          },
          {
            "id": "hydro-c2l2",
            "title": "Tự lắp đặt hệ thống thủy canh tĩnh",
            "content": "<h3>Mô hình cho người mới bắt đầu:</h3><p>Đây là hệ thống dễ làm nhất.</p><ol><li><strong>Chuẩn bị thùng:</strong> Lấy một thùng xốp hoặc thùng nhựa tối màu có nắp, dung tích khoảng 20-50 lít.</li><li><strong>Khoét lỗ trên nắp:</strong> Dùng mũi khoét để khoét các lỗ tròn trên nắp thùng, khoảng cách giữa các lỗ tùy thuộc vào loại rau. Đường kính lỗ vừa với rọ nhựa đã chuẩn bị.</li><li><strong>Lắp đặt máy sục khí:</strong> Đặt cục đá sủi của máy sục khí oxy vào đáy thùng, luồn dây ra ngoài.</li><li><strong>Pha dung dịch:</strong> Pha dung dịch dinh dưỡng theo hướng dẫn và đổ vào thùng, mực nước cách nắp khoảng 3-5 cm.</li><li><strong>Trồng cây:</strong> Đặt các cây con đã ươm sẵn vào rọ nhựa (cùng với giá thể), sau đó đặt các rọ nhựa vào các lỗ đã khoét trên nắp. Đảm bảo bộ rễ của cây chạm vào dung dịch dinh dưỡng.</li><li><strong>Vận hành:</strong> Cắm điện cho máy sục khí chạy liên tục 24/7.</li></ol>"
          },
          {
            "id": "hydro-c2l3",
            "title": "Tự lắp đặt hệ thống thủy canh hồi lưu",
            "content": "<h3>Mô hình NFT dạng ống:</h3><p>Phổ biến cho quy mô thương mại nhỏ.</p><ol><li><strong>Làm khung giàn:</strong> Dùng sắt hoặc thép để làm một khung giàn có độ dốc nhẹ (khoảng 1-2%).</li><li><strong>Lắp ống thủy canh:</strong> Đặt các ống nhựa PVC (đã được khoét lỗ để đặt rọ) lên giàn.</li><li><strong>Lắp đặt hệ thống cấp và hồi lưu:</strong> Đặt một bể chứa dung dịch ở đầu thấp của giàn. Đặt máy bơm chìm trong bể, nối ống để bơm dung dịch lên đầu cao của các ống PVC. Dung dịch sẽ chảy thành một lớp mỏng qua rễ cây trong ống, sau đó chảy về lại bể chứa ở đầu thấp, tạo thành một vòng tuần hoàn.</li><li><strong>Trồng cây và vận hành:</strong> Đặt cây con vào rọ và đặt lên các lỗ trên ống. Cho máy bơm chạy theo chu kỳ (ví dụ: 15 phút chạy, 15 phút nghỉ) hoặc chạy liên tục tùy loại cây.</li></ol>"
          }
        ]
      },
      {
        "title": "Chương 3: Dung dịch dinh dưỡng",
        "lessons": [
          {
            "id": "hydro-c3l1",
            "title": "Vai trò của các nguyên tố dinh dưỡng",
            "content": "<h3>Dinh dưỡng đa lượng:</h3><p>Là các nguyên tố cây cần với số lượng lớn.</p><ul><li><strong>Đạm (N):</strong> Giúp cây phát triển thân, lá.</li><li><strong>Lân (P):</strong> Cần thiết cho sự phát triển của rễ và hoa.</li><li><strong>Kali (K):</strong> Giúp cây cứng cáp, tăng khả năng chống chịu và chất lượng quả.</li><li><strong>Canxi (Ca), Magie (Mg), Lưu huỳnh (S):</strong> Các nguyên tố trung lượng quan trọng.</li></ul><h3>Dinh dưỡng vi lượng:</h3><p>Cây cần với lượng rất nhỏ nhưng không thể thiếu.</p><ul><li>Bao gồm Sắt (Fe), Mangan (Mn), Kẽm (Zn), Đồng (Cu), Bo (B)... Chúng tham gia vào các quá trình enzyme và trao đổi chất của cây.</li></ul>"
          },
          {
            "id": "hydro-c3l2",
            "title": "Cách pha dung dịch thủy canh",
            "content": "<h3>Sử dụng dung dịch thương mại:</h3><p>Đối với người mới, cách đơn giản và an toàn nhất là mua các cặp dung dịch thủy canh A và B có sẵn trên thị trường. Đây là các dung dịch đậm đặc.</p><h3>Nguyên tắc pha chế:</h3><p><strong>KHÔNG BAO GIỜ TRỘN TRỰC TIẾP DUNG DỊCH A VÀ B ĐẬM ĐẶC VỚI NHAU.</strong> Việc này sẽ gây ra phản ứng kết tủa, làm hỏng dinh dưỡng.</p><ol><li>Lấy một thùng chứa nước sạch.</li><li>Đong một lượng dung dịch A theo hướng dẫn và đổ vào thùng nước, khuấy đều.</li><li>Tiếp tục đong một lượng dung dịch B tương ứng và đổ vào thùng, khuấy đều lần nữa.</li><li>Để dung dịch ổn định khoảng 30 phút trước khi đo pH và EC.</li></ol>"
          },
          {
            "id": "hydro-c3l3",
            "title": "Đo và điều chỉnh pH, EC",
            "content": "<h3>pH - Độ chua/kiềm:</h3><p>pH ảnh hưởng đến khả năng hấp thụ các chất dinh dưỡng của rễ cây. Nếu pH quá cao hoặc quá thấp, cây sẽ không thể hấp thụ được một số chất dù chúng có trong dung dịch. <strong>Ngưỡng pH lý tưởng cho hầu hết các loại rau là từ 5.5 đến 6.5.</strong> Dùng bút đo pH để kiểm tra và dùng dung dịch 'pH down' (thường là acid) hoặc 'pH up' (thường là kiềm) để điều chỉnh.</p><h3>EC - Nồng độ dinh dưỡng:</h3><p>EC (Electrical Conductivity) là chỉ số đo tổng nồng độ các chất dinh dưỡng hòa tan trong dung dịch. <strong>Ngưỡng EC lý tưởng:</strong></p><ul><li>Rau ăn lá (xà lách, cải): 1.2 - 1.8 mS/cm</li><li>Cây ăn quả (cà chua, dưa chuột): 2.0 - 3.5 mS/cm</li></ul><p>Dùng bút đo EC để kiểm tra. Nếu EC quá cao, thêm nước sạch. Nếu EC quá thấp, thêm dung dịch dinh dưỡng (cả A và B theo đúng tỷ lệ).</p>"
          }
        ]
      },
      {
        "title": "Chương 4: Vận hành và Chăm sóc",
        "lessons": [
          {
            "id": "hydro-c4l1",
            "title": "Ươm cây con cho hệ thống thủy canh",
            "content": "<h3>Tại sao phải ươm cây?</h3><p>Không nên gieo hạt trực tiếp vào hệ thống thủy canh. Việc ươm cây con riêng giúp tỷ lệ nảy mầm cao hơn, chọn lọc được những cây khỏe mạnh và tiết kiệm không gian trong hệ thống chính.</p><h3>Các bước ươm cây:</h3><ol><li>Ngâm hạt giống trong nước ấm khoảng 2-4 giờ.</li><li>Chuẩn bị giá thể ươm (viên nén xơ dừa, mút xốp hoặc rockwool). Làm ẩm giá thể.</li><li>Gieo 1-2 hạt vào mỗi viên nén/ô mút.</li><li>Đặt khay ươm ở nơi có ánh sáng nhẹ, giữ ẩm liên tục.</li><li>Khi cây ra được 2-4 lá thật (khoảng 10-15 ngày), cây đã đủ khỏe để chuyển vào hệ thống thủy canh.</li></ol>"
          },
          {
            "id": "hydro-c4l2",
            "title": "Quản lý sâu bệnh trong thủy canh",
            "content": "<h3>Phòng bệnh là chính:</h3><p>Thủy canh đã loại bỏ được các bệnh từ đất, nhưng vẫn có thể gặp các loại sâu bệnh lây qua không khí.</p><ul><li><strong>Sâu hại:</strong> Các loại rầy mềm, bọ phấn, nhện đỏ có thể xuất hiện. Cần kiểm tra lá thường xuyên, đặc biệt là mặt dưới lá.</li><li><strong>Bệnh nấm:</strong> Bệnh phấn trắng, sương mai có thể phát triển nếu độ ẩm quá cao và không khí kém lưu thông.</li></ul><h3>Biện pháp xử lý hữu cơ:</h3><p>Khi phát hiện sâu bệnh, ưu tiên các biện pháp an toàn:</p><ul><li>Bắt bằng tay hoặc dùng vòi nước xịt mạnh để rửa trôi.</li><li>Sử dụng các loại thuốc sinh học như dầu Neem, dung dịch tỏi ớt...</li><li>Đảm bảo hệ thống thông gió tốt để giảm độ ẩm.</li></ul>"
          },
          {
            "id": "hydro-c4l3",
            "title": "Thu hoạch và xử lý hệ thống",
            "content": "<h3>Kỹ thuật thu hoạch:</h3><p>Đối với các loại rau ăn lá như xà lách, có hai cách thu hoạch:</p><ul><li><strong>Thu hoạch cả cây:</strong> Nhổ cả cây ra khỏi rọ.</li><li><strong>Thu hoạch tỉa lá (Cut-and-come-again):</strong> Dùng kéo cắt các lá lớn bên ngoài để ăn trước, chừa lại phần ngọn và các lá non bên trong. Cây sẽ tiếp tục ra lá mới cho các lần thu hoạch tiếp theo. Cách này giúp kéo dài thời gian thu hoạch trên cùng một cây.</li></ul><h3>Vệ sinh hệ thống sau vụ:</h3><p>Đây là bước cực kỳ quan trọng để ngăn ngừa sự tích tụ của mầm bệnh. Sau khi thu hoạch xong, cần:</p><ol><li>Tháo toàn bộ rễ và cây cũ ra khỏi hệ thống.</li><li>Xả bỏ toàn bộ dung dịch dinh dưỡng cũ.</li><li>Dùng bàn chải và nước sạch cọ rửa toàn bộ bể chứa, ống dẫn, rọ nhựa.</li><li>Sát trùng hệ thống bằng dung dịch oxy già (H2O2) loãng hoặc dung dịch Chlorine, sau đó rửa lại thật kỹ bằng nước sạch.</li><li>Để hệ thống khô ráo trước khi bắt đầu một vụ mới.</li></ol>"
          }
        ]
      }
    ]
  },
  "finance-course-v1": {
    "title": "Quản lý tài chính cho nông hộ",
    "meta": {
      "expert": "Chuyên gia tài chính Đào Thu Trang",
      "field": "Kinh tế nông nghiệp",
      "duration": "6 giờ"
    },
    "image": "https://images.unsplash.com/photo-1554224155-1696413565d3?q=80&w=2070&auto=format&fit=crop",
    "imageAlt": "Một người đang tính toán với máy tính và sổ sách",
    "sapo": "Học cách quản lý dòng tiền, ghi chép sổ sách, tính toán chi phí - lợi nhuận, và tiếp cận các nguồn vốn vay ưu đãi cho nông nghiệp.",
    "quizId": "finance-course-v1",
    "chapters": [
      {
        "title": "Chương 1: Nguyên tắc cơ bản",
        "lessons": [
          {
            "id": "finance-c1l1",
            "title": "Tại sao cần quản lý tài chính?",
            "content": "<h3>Từ làm nông đến kinh doanh nông nghiệp:</h3><p>Nhiều bà con nông dân thường chỉ tính toán đơn giản 'thu được bao nhiêu, trừ đi những gì đã bỏ ra'. Tuy nhiên, để làm giàu từ nông nghiệp, chúng ta cần xem trang trại của mình như một doanh nghiệp. Quản lý tài chính giúp trả lời các câu hỏi cốt lõi:</p><ul><li><strong>Lãi/Lỗ thực sự là bao nhiêu?</strong> Giúp biết được hoạt động sản xuất có hiệu quả hay không.</li><li><strong>Tiền đang đi đâu?</strong> Nhận diện được những khoản chi phí nào đang quá cao, khoản nào có thể cắt giảm.</li><li><strong>Có nên đầu tư không?</strong> Cung cấp cơ sở để quyết định có nên mua thêm máy móc, mở rộng trang trại hay không.</li><li><strong>Làm sao để vay vốn?</strong> Một hệ thống sổ sách rõ ràng là bằng chứng thuyết phục nhất đối với các ngân hàng và tổ chức tín dụng.</li></ul><p>Quản lý tài chính không phức tạp, nó chỉ đơn giản là thói quen ghi chép và kiểm soát 'túi tiền' của gia đình và trang trại một cách có hệ thống.</p>"
          },
          {
            "id": "finance-c1l2",
            "title": "Phân biệt chi phí và đầu tư",
            "content": "<h3>Hiểu đúng để quyết định đúng:</h3><p>Nhầm lẫn giữa chi phí và đầu tư có thể dẫn đến các quyết định sai lầm. </p><ul><li><strong>Chi phí (Expense):</strong> Là những khoản tiền bạn bỏ ra để duy trì hoạt động sản xuất trong một chu kỳ ngắn, ví dụ: tiền mua phân bón, thuốc trừ sâu, tiền công lao động thời vụ. Chi phí sẽ 'mất đi' sau mỗi vụ mùa.</li><li><strong>Đầu tư (Investment):</strong> Là những khoản tiền bạn bỏ ra để mua sắm các tài sản có giá trị sử dụng lâu dài, giúp tăng năng suất hoặc giảm chi phí trong tương lai. Ví dụ: tiền mua máy cày, tiền lắp đặt hệ thống tưới tự động, tiền xây dựng nhà kính.</li></ul><h3>Tại sao cần phân biệt?</h3><p>Việc phân biệt rõ ràng giúp bạn tính toán chính xác lợi nhuận. Chi phí được trừ trực tiếp vào doanh thu của vụ đó. Trong khi đó, giá trị của khoản đầu tư sẽ được tính khấu hao dần qua nhiều năm, chứ không tính hết vào một vụ.</p>"
          },
          {
            "id": "finance-c1l3",
            "title": "Các công cụ ghi chép đơn giản",
            "content": "<h3>Bắt đầu từ những gì đơn giản nhất:</h3><p>Bạn không cần phải là một kế toán chuyên nghiệp. Hãy bắt đầu bằng những công cụ quen thuộc:</p><ul><li><strong>Sổ tay ghi chép:</strong> Một cuốn sổ tay chia làm hai cột THU và CHI là đủ để bắt đầu. Hãy tập thói quen ghi lại TẤT CẢ các khoản thu chi hàng ngày, dù là nhỏ nhất.</li><li><strong>Bảng tính Excel hoặc Google Sheets:</strong> Nếu bạn quen dùng máy tính hoặc điện thoại thông minh, các công cụ này rất mạnh mẽ. Bạn có thể tạo các bảng tính để tự động cộng trừ, phân loại chi phí và vẽ biểu đồ.</li><li><strong>Ứng dụng quản lý tài chính:</strong> Có nhiều ứng dụng miễn phí trên điện thoại giúp bạn ghi chép thu chi một cách trực quan và tiện lợi.</li></ul><p>Điều quan trọng nhất không phải là công cụ, mà là sự <strong>kỷ luật</strong> và <strong>nhất quán</strong> trong việc ghi chép hàng ngày.</p>"
          }
        ]
      },
      {
        "title": "Chương 2: Lập kế hoạch và Dự toán",
        "lessons": [
          {
            "id": "finance-c2l1",
            "title": "Lập kế hoạch sản xuất kinh doanh",
            "content": "<h3>Đừng đi mà không có bản đồ:</h3><p>Kế hoạch sản xuất kinh doanh chính là tấm bản đồ cho vụ mùa của bạn. Một kế hoạch cơ bản cần trả lời:</p><ul><li><strong>Trồng cây gì, nuôi con gì?</strong> Dựa trên điều kiện đất đai, kinh nghiệm và nhu cầu thị trường.</li><li><strong>Sản lượng dự kiến là bao nhiêu?</strong></li><li><strong>Giá bán dự kiến là bao nhiêu?</strong> (Tham khảo giá các năm trước).</li><li><strong>Doanh thu dự kiến = Sản lượng x Giá bán.</strong></li><li><strong>Các hoạt động chính cần làm là gì?</strong> (Làm đất, bón phân, tưới nước, phòng bệnh, thu hoạch...).</li></ul>"
          },
          {
            "id": "finance-c2l2",
            "title": "Dự toán chi phí cho một vụ mùa",
            "content": "<h3>Liệt kê tất cả các chi phí có thể phát sinh:</h3><p>Đây là bước quan trọng nhất trong việc lập kế hoạch. Hãy chia chi phí thành các nhóm:</p><ul><li><strong>Chi phí vật tư:</strong> Giống, phân bón, thuốc BVTV, vôi, rơm rạ...</li><li><strong>Chi phí nhân công:</strong> Tiền thuê người làm đất, gieo trồng, chăm sóc, thu hoạch... (Nếu gia đình tự làm, cũng nên tạm tính công của mình để biết hiệu quả thực sự).</li><li><strong>Chi phí thuê mướn:</strong> Tiền thuê đất (nếu có), thuê máy móc (máy cày, máy gặt...).</li><li><strong>Chi phí khác:</strong> Tiền điện, nước, chi phí vận chuyển, bao bì...</li></ul><p><strong>Tổng chi phí dự toán = Chi phí vật tư + Chi phí nhân công + Chi phí thuê mướn + Chi phí khác.</strong></p>"
          },
          {
            "id": "finance-c2l3",
            "title": "Phân tích điểm hòa vốn",
            "content": "<h3>Điểm hòa vốn là gì?</h3><p>Là mức sản lượng hoặc doanh thu mà tại đó, tổng doanh thu vừa đủ để bù đắp tổng chi phí (lợi nhuận bằng 0). Bất kỳ sản phẩm nào bán được sau điểm hòa vốn đều là lợi nhuận ròng.</p><h3>Cách tính đơn giản:</h3><p><strong>Sản lượng hòa vốn = Tổng chi phí / Đơn giá bán dự kiến.</strong></p><p><u>Ví dụ:</u> Tổng chi phí dự toán cho 1 ha lúa là 20 triệu đồng. Giá lúa dự kiến là 5,000 đồng/kg. Vậy sản lượng hòa vốn = 20,000,000 / 5,000 = 4,000 kg (tức 4 tấn). Điều này có nghĩa là bạn phải thu hoạch được ít nhất 4 tấn lúa thì mới không bị lỗ.</p><p>Biết được điểm hòa vốn giúp bạn đặt ra mục tiêu năng suất rõ ràng và có chiến lược sản xuất phù hợp.</p>"
          }
        ]
      },
      {
        "title": "Chương 3: Quản lý dòng tiền",
        "lessons": [
          {
            "id": "finance-c3l1",
            "title": "Theo dõi thu chi hàng ngày",
            "content": "<h3>Dòng tiền là 'mạch máu':</h3><p>Dòng tiền là sự lưu chuyển của tiền vào và ra khỏi 'túi' của bạn. Một trang trại có thể có lãi trên giấy tờ nhưng vẫn phá sản nếu không quản lý tốt dòng tiền (ví dụ: đến lúc cần tiền mua phân bón thì không có sẵn tiền mặt).</p><h3>Cách theo dõi:</h3><p>Lập một cuốn sổ hoặc bảng tính đơn giản, ghi lại tất cả các giao dịch phát sinh:</p><ul><li><strong>Cột 'Ngày':</strong> Ghi ngày tháng diễn ra giao dịch.</li><li><strong>Cột 'Nội dung':</strong> Mô tả giao dịch (ví dụ: 'Bán 100kg xoài', 'Mua 2 bao phân NPK').</li><li><strong>Cột 'Thu vào':</strong> Ghi số tiền nhận được.</li><li><strong>Cột 'Chi ra':</strong> Ghi số tiền đã chi.</li><li><strong>Cột 'Tồn cuối ngày':</strong> Số tiền còn lại.</li></ul><p>Việc này giúp bạn luôn biết mình có bao nhiêu tiền và có đủ tiền cho các hoạt động sắp tới hay không.</p>"
          },
          {
            "id": "finance-c3l2",
            "title": "Tối ưu hóa chi phí sản xuất",
            "content": "<h3>Giảm chi phí không có nghĩa là cắt bỏ:</h3><p>Tối ưu hóa là sử dụng chi phí một cách thông minh để đạt hiệu quả cao nhất. Dựa vào sổ sách ghi chép, bạn có thể xem xét:</p><ul><li><strong>Chi phí nào cao nhất?</strong> Thường là thức ăn chăn nuôi hoặc phân bón. Có thể tìm nhà cung cấp khác có giá tốt hơn không? Có thể tự phối trộn thức ăn, tự ủ phân hữu cơ để giảm chi phí không?</li><li><strong>Sử dụng vật tư hiệu quả:</strong> Bón phân theo kết quả phân tích đất, sử dụng thuốc BVTV theo nguyên tắc 4 đúng để tránh lãng phí.</li><li><strong>Tận dụng phụ phẩm:</strong> Dùng rơm rạ, thân cây ngô để ủ phân hoặc làm thức ăn cho gia súc.</li></ul>"
          },
          {
            "id": "finance-c3l3",
            "title": "Lập quỹ dự phòng rủi ro",
            "content": "<h3>'Trời không chiều lòng người':</h3><p>Nông nghiệp luôn tiềm ẩn nhiều rủi ro: thiên tai, dịch bệnh, giá cả thị trường biến động... Một khoản tiền dự phòng sẽ là 'phao cứu sinh' giúp bạn vượt qua những giai đoạn khó khăn.</p><h3>Cách lập quỹ:</h3><p>Sau mỗi vụ mùa có lãi, hãy cam kết trích ra một tỷ lệ nhất định (ví dụ: 10-15% lợi nhuận) để đưa vào quỹ dự phòng. Khoản tiền này nên được giữ riêng, không dùng cho các mục đích chi tiêu thông thường. Khi quỹ đã đủ lớn (ví dụ: đủ để trang trải chi phí cho một vụ mùa), bạn sẽ có một tấm đệm an toàn vững chắc.</p>"
          }
        ]
      },
      {
        "title": "Chương 4: Tiếp cận nguồn vốn",
        "lessons": [
          {
            "id": "finance-c4l1",
            "title": "Các nguồn vốn vay ưu đãi",
            "content": "<h3>Các kênh vay vốn chính thống:</h3><p>Khi cần vốn để mở rộng sản xuất, đầu tư, hãy tìm đến các nguồn vốn chính thống với lãi suất hợp lý, tránh xa 'tín dụng đen'.</p><ul><li><strong>Ngân hàng Nông nghiệp và Phát triển Nông thôn (Agribank):</strong> Là ngân hàng chủ lực, có nhiều chính sách và gói vay ưu đãi dành riêng cho nông nghiệp, nông dân.</li><li><strong>Ngân hàng Chính sách xã hội:</strong> Cung cấp các khoản vay cho hộ nghèo, hộ cận nghèo và các đối tượng chính sách khác để phát triển sản xuất.</li><li><strong>Quỹ Hỗ trợ Nông dân:</strong> Được thành lập bởi Hội Nông dân, cung cấp các khoản vay với lãi suất thấp để hỗ trợ các mô hình sản xuất hiệu quả.</li></ul>"
          },
          {
            "id": "finance-c4l2",
            "title": "Xây dựng phương án vay vốn",
            "content": "<h3>Làm sao để ngân hàng tin tưởng bạn?</h3><p>Ngân hàng sẽ chỉ cho vay khi họ thấy được kế hoạch của bạn rõ ràng và có khả năng trả nợ. Một phương án vay vốn (hay kế hoạch sản xuất kinh doanh) thuyết phục cần có:</p><ul><li><strong>Mục đích vay vốn:</strong> Vay để làm gì? (Mua giống, mua máy móc, xây chuồng trại...).</li><li><strong>Số tiền cần vay:</strong> Cần vay bao nhiêu?</li><li><strong>Kế hoạch sản xuất:</strong> Trình bày dự toán chi phí, doanh thu, lợi nhuận dự kiến (như đã học ở Chương 2).</li><li><strong>Khả năng trả nợ:</strong> Dựa trên lợi nhuận dự kiến, bạn sẽ trả nợ gốc và lãi như thế nào?</li><li><strong>Tài sản đảm bảo (nếu có):</strong> Sổ đỏ, giấy tờ có giá trị...</li></ul><p>Tất cả các con số này đều phải được lấy từ sổ sách ghi chép tài chính của bạn. Đây là lý do tại sao việc ghi chép lại quan trọng đến vậy.</p>"
          },
          {
            "id": "finance-c4l3",
            "title": "Quản lý và trả nợ hiệu quả",
            "content": "<h3>Vay vốn là đòn bẩy, không phải gánh nặng:</h3><p>Sử dụng vốn vay một cách khôn ngoan sẽ giúp bạn phát triển nhanh hơn.</p><ul><li><strong>Sử dụng vốn đúng mục đích:</strong> Tuyệt đối không dùng tiền vay sản xuất vào các mục đích chi tiêu cá nhân khác.</li><li><strong>Theo dõi tiến độ:</strong> Luôn bám sát kế hoạch sản xuất đã đề ra. Nếu có rủi ro, cần có phương án xử lý ngay.</li><li><strong>Lập kế hoạch trả nợ:</strong> Dựa trên dòng tiền thu về, lên kế hoạch trích tiền để trả nợ đúng hạn, tránh bị phạt lãi suất quá hạn.</li><li><strong>Giao tiếp với ngân hàng:</strong> Nếu gặp khó khăn do thiên tai, dịch bệnh, hãy chủ động làm việc với ngân hàng để tìm giải pháp cơ cấu lại khoản nợ (gia hạn nợ, giảm lãi suất...), không nên im lặng và trốn tránh.</li></ul>"
          }
        ]
      }
    ]
  },
  "iot-course-v1": {
    "title": "Cảm biến IoT và Nông nghiệp chính xác",
    "meta": {
      "expert": "Chuyên gia công nghệ Đinh Quang Huy",
      "field": "Nông nghiệp công nghệ cao",
      "duration": "9 giờ"
    },
    "image": "https://images.unsplash.com/photo-1544795594-279376662489?q=80&w=2070&auto=format&fit=crop",
    "imageAlt": "Một nông dân đang kiểm tra dữ liệu trên máy tính bảng trong trang trại",
    "sapo": "Học cách ứng dụng các cảm biến IoT để theo dõi độ ẩm đất, nhiệt độ, ánh sáng và tự động hóa hệ thống tưới tiêu, bón phân.",
    "quizId": "iot-course-v1",
    "chapters": [
      {
        "title": "Chương 1: Giới thiệu về IoT nông nghiệp",
        "lessons": [
          {
            "id": "iot-c1l1",
            "title": "IoT là gì và vai trò trong nông nghiệp?",
            "content": "<h3>IoT là gì?</h3><p>IoT (Internet of Things - Mạng lưới vạn vật kết nối) là một mạng lưới các thiết bị vật lý (gọi là 'vật'), được gắn cảm biến, phần mềm và các công nghệ khác cho phép chúng kết nối và trao đổi dữ liệu với nhau qua Internet.</p><h3>Vai trò trong Nông nghiệp (Agriculture 4.0):</h3><p>Trong nông nghiệp, IoT biến trang trại truyền thống thành một 'trang trại thông minh'. Nó cho phép chúng ta:</p><ul><li><strong>Thu thập dữ liệu thời gian thực:</strong> Thay vì phỏng đoán, chúng ta có thể biết chính xác nhiệt độ, độ ẩm đất, cường độ ánh sáng, độ pH... tại bất kỳ thời điểm nào.</li><li><strong>Giám sát từ xa:</strong> Người nông dân có thể theo dõi toàn bộ trang trại của mình qua điện thoại thông minh hoặc máy tính mà không cần phải có mặt trực tiếp.</li><li><strong>Tự động hóa:</strong> Dựa trên dữ liệu thu thập được, hệ thống có thể tự động ra quyết định, ví dụ: tự động bật máy bơm khi đất khô, tự động kéo lưới che khi trời quá nắng.</li><li><strong>Nông nghiệp chính xác:</strong> Cung cấp đúng thứ cây cần, vào đúng thời điểm và đúng vị trí. Ví dụ: chỉ tưới nước cho khu vực đất khô, thay vì tưới cả cánh đồng. Điều này giúp tiết kiệm tài nguyên (nước, phân bón) và tăng năng suất.</li></ul>"
          },
          {
            "id": "iot-c1l2",
            "title": "Các loại cảm biến phổ biến",
            "content": "<h3>Cảm biến là 'giác quan' của trang trại thông minh:</h3><p>Mỗi loại cảm biến đóng vai trò như một giác quan, giúp thu thập một loại dữ liệu cụ thể.</p><ul><li><strong>Cảm biến độ ẩm đất (Soil Moisture Sensor):</strong> Đo lường lượng nước có trong đất, giúp quyết định khi nào cần tưới và tưới bao nhiêu là đủ.</li><li><strong>Cảm biến nhiệt độ và độ ẩm không khí (Temperature & Humidity Sensor):</strong> Theo dõi điều kiện vi khí hậu trong nhà kính hoặc ngoài trời, rất quan trọng để phòng ngừa nấm bệnh và stress nhiệt cho cây.</li><li><strong>Cảm biến ánh sáng (Light Sensor):</strong> Đo cường độ ánh sáng, giúp điều khiển hệ thống che nắng hoặc đèn chiếu sáng bổ sung.</li><li><strong>Cảm biến pH đất:</strong> Đo độ chua/kiềm của đất, giúp điều chỉnh việc bón vôi hoặc các chất cải tạo đất.</li><li><strong>Cảm biến NPK:</strong> Đo hàm lượng các chất dinh dưỡng đa lượng chính trong đất (Đạm, Lân, Kali), giúp bón phân chính xác hơn.</li></ul>"
          },
          {
            "id": "iot-c1l3",
            "title": "Kiến trúc một hệ thống IoT",
            "content": "<h3>Một hệ thống IoT nông nghiệp hoàn chỉnh gồm 4 lớp:</h3><ol><li><strong>Lớp 1: Thiết bị (Things/Devices):</strong> Chính là các cảm biến được đặt tại hiện trường để thu thập dữ liệu (độ ẩm, nhiệt độ...) và các thiết bị chấp hành (máy bơm, van điện từ, quạt...).</li><li><strong>Lớp 2: Cổng kết nối (Gateway):</strong> Là thiết bị trung gian, có nhiệm vụ thu thập dữ liệu từ tất cả các cảm biến và gửi lên Internet. Nó có thể kết nối qua Wifi, 3G/4G, hoặc sóng LoRaWAN.</li><li><strong>Lớp 3: Nền tảng đám mây (Cloud Platform):</strong> Là 'bộ não' của hệ thống. Dữ liệu từ gateway sẽ được gửi lên đây để lưu trữ, xử lý, và phân tích.</li><li><strong>Lớp 4: Ứng dụng (Application):</strong> Là giao diện mà người dùng tương tác, thường là một ứng dụng trên điện thoại hoặc một trang web. Người dùng xem biểu đồ dữ liệu, nhận cảnh báo và ra lệnh điều khiển các thiết bị từ xa qua ứng dụng này.</li></ol>"
          }
        ]
      },
      {
        "title": "Chương 2: Lắp đặt và Cấu hình",
        "lessons": [
          {
            "id": "iot-c2l1",
            "title": "Lắp đặt cảm biến độ ẩm đất",
            "content": "<h3>Vị trí lắp đặt:</h3><p>Vị trí đặt cảm biến quyết định tính chính xác của dữ liệu. Cần đặt cảm biến ở vị trí đại diện cho toàn khu vực. Cắm đầu dò của cảm biến xuống đất, đảm bảo nó tiếp xúc hoàn toàn với đất ở độ sâu của vùng rễ chính của cây trồng (thường là 15-20 cm).</p><h3>Lưu ý:</h3><ul><li>Tránh đặt cảm biến quá gần hoặc quá xa gốc cây.</li><li>Tránh những nơi đất bị nén chặt hoặc quá tơi xốp bất thường.</li><li>Trong một khu vực lớn, nên đặt nhiều cảm biến ở các vị trí khác nhau để có dữ liệu trung bình chính xác hơn.</li></ul>"
          },
          {
            "id": "iot-c2l2",
            "title": "Kết nối cảm biến với bộ điều khiển trung tâm",
            "content": "<h3>Bộ điều khiển trung tâm (Gateway):</h3><p>Gateway thường là một bo mạch như Raspberry Pi, Arduino kết hợp với các module truyền sóng (Wifi, LoRa...). Các cảm biến sẽ được nối dây đến gateway này.</p><h3>Phương thức kết nối:</h3><ul><li><strong>Kết nối có dây:</strong> Đơn giản, ổn định nhưng bị giới hạn về khoảng cách. Phù hợp cho quy mô nhỏ như vườn trên sân thượng.</li><li><strong>Kết nối không dây (LoRa, Zigbee):</strong> Cho phép kết nối các cảm biến ở khoảng cách xa (vài km đối với LoRa) mà không cần dây dẫn, rất phù hợp cho các trang trại lớn. Các cảm biến sẽ có pin riêng và gửi dữ liệu về gateway theo chu kỳ.</li></ul>"
          },
          {
            "id": "iot-c2l3",
            "title": "Thiết lập phần mềm theo dõi",
            "content": "<h3>Các nền tảng IoT phổ biến:</h3><p>Có nhiều nền tảng cho phép bạn xây dựng giao diện điều khiển mà không cần biết lập trình nhiều, ví dụ như Blynk, ThingsBoard, AWS IoT, Azure IoT.</p><h3>Các bước cơ bản:</h3><ol><li><strong>Tạo tài khoản:</strong> Đăng ký một tài khoản trên nền tảng bạn chọn.</li><li><strong>Tạo 'Thiết bị ảo' (Virtual Device):</strong> Tạo một thiết bị ảo trên nền tảng, nó sẽ cấp cho bạn một 'Mã xác thực' (Authentication Token).</li><li><strong>Lập trình cho Gateway:</strong> Nạp một đoạn mã vào gateway để nó đọc dữ liệu từ cảm biến và gửi lên nền tảng đám mây bằng Mã xác thực đã được cấp.</li><li><strong>Thiết kế giao diện:</strong> Trên ứng dụng điện thoại hoặc trang web của nền tảng, bạn có thể kéo-thả các 'widget' như biểu đồ, đồng hồ đo, nút bấm để hiển thị dữ liệu từ cảm biến và tạo các nút điều khiển thiết bị.</li></ol>"
          }
        ]
      },
      {
        "title": "Chương 3: Tự động hóa",
        "lessons": [
          {
            "id": "iot-c3l1",
            "title": "Tự động hóa hệ thống tưới nhỏ giọt",
            "content": "<h3>Kịch bản tự động hóa:</h3><p>Đây là ứng dụng phổ biến và hiệu quả nhất của IoT trong nông nghiệp.</p><h3>Logic hoạt động:</h3><ol><li>Cảm biến độ ẩm đất liên tục đo và gửi dữ liệu về bộ điều khiển.</li><li>Người dùng thiết lập một ngưỡng độ ẩm, ví dụ: 'Nếu độ ẩm đất < 40%, thì BẬT máy bơm'.</li><li>Bộ điều khiển sẽ so sánh dữ liệu thực tế với ngưỡng đã cài đặt.</li><li>Khi độ ẩm xuống dưới 40%, bộ điều khiển sẽ tự động gửi tín hiệu để bật rơ-le (relay), cấp điện cho máy bơm nước.</li><li>Có thể thiết lập thêm: 'Sau khi bật máy bơm 15 phút, thì TẮT'.</li></ol><p>Hệ thống này giúp cây luôn đủ nước, không bị khô héo hay úng nước, đồng thời tiết kiệm tối đa nước và công lao động.</p>"
          },
          {
            "id": "iot-c3l2",
            "title": "Tự động điều khiển quạt, mái che",
            "content": "<h3>Ứng dụng trong nhà kính:</h3><p>Kiểm soát vi khí hậu là yếu tố then chốt trong nhà kính.</p><ul><li><strong>Tự động làm mát:</strong> Cảm biến nhiệt độ và độ ẩm không khí được đặt trong nhà kính. Khi nhiệt độ vượt quá ngưỡng cài đặt (ví dụ: > 35°C), hệ thống sẽ tự động bật quạt thông gió và hệ thống làm mát bằng hơi nước (dàn mát).</li><li><strong>Tự động che nắng:</strong> Cảm biến cường độ ánh sáng được đặt bên ngoài. Khi cường độ ánh sáng quá mạnh, hệ thống sẽ tự động điều khiển motor để kéo lưới che nắng ra, và tự động thu lại khi trời dịu mát.</li></ul><p>Việc này giúp giảm stress cho cây trồng và tạo môi trường sinh trưởng tối ưu.</p>"
          },
          {
            "id": "iot-c3l3",
            "title": "Cảnh báo sớm qua điện thoại",
            "content": "<h3>Giám sát trang trại 24/7:</h3><p>Một trong những lợi ích lớn của IoT là khả năng cảnh báo ngay lập tức khi có sự cố, giúp người nông dân phản ứng kịp thời dù đang ở bất cứ đâu.</p><h3>Các loại cảnh báo có thể thiết lập:</h3><ul><li><strong>Cảnh báo môi trường:</strong> 'Nhiệt độ trong nhà kính quá cao', 'Độ ẩm đất quá thấp', 'Mất điện'.</li><li><strong>Cảnh báo an ninh:</strong> Kết hợp với cảm biến chuyển động hoặc cảm biến cửa, hệ thống có thể gửi cảnh báo 'Phát hiện có sự xâm nhập trái phép'.</li><li><strong>Cảnh báo vận hành:</strong> 'Máy bơm đã chạy được 30 phút', 'Bồn chứa dinh dưỡng sắp cạn'.</li></ul><p>Các cảnh báo này được gửi qua tin nhắn đẩy (push notification) trên ứng dụng điện thoại, email hoặc thậm chí là cuộc gọi tự động.</p>"
          }
        ]
      },
      {
        "title": "Chương 4: Phân tích dữ liệu",
        "lessons": [
          {
            "id": "iot-c4l1",
            "title": "Đọc và hiểu biểu đồ dữ liệu",
            "content": "<h3>Dữ liệu là vàng:</h3><p>Dữ liệu do cảm biến thu thập sẽ được lưu trữ và biểu diễn dưới dạng biểu đồ theo thời gian. Việc phân tích biểu đồ này giúp chúng ta hiểu sâu hơn về trang trại của mình.</p><h3>Ví dụ phân tích biểu đồ độ ẩm đất:</h3><ul><li>Nếu biểu đồ dốc xuống quá nhanh, chứng tỏ đất thoát nước tốt nhưng cũng nhanh khô, cần tưới nhiều lần với lượng nước ít hơn.</li><li>Nếu biểu đồ đi ngang ở mức cao trong thời gian dài sau khi tưới, chứng tỏ đất bị úng, cần cải thiện hệ thống thoát nước.</li><li>So sánh biểu đồ độ ẩm với biểu đồ nhiệt độ và ánh sáng giúp hiểu rõ mối tương quan và sự bốc hơi nước.</li></ul>"
          },
          {
            "id": "iot-c4l2",
            "title": "Ra quyết định dựa trên dữ liệu",
            "content": "<h3>Từ dữ liệu đến hành động:</h3><p>IoT giúp chuyển từ việc canh tác dựa trên kinh nghiệm ('Tôi nghĩ là đất khô rồi') sang canh tác dựa trên bằng chứng ('Dữ liệu cho thấy độ ẩm đất là 35%, cần phải tưới').</p><h3>Các quyết định có thể được cải thiện:</h3><ul><li><strong>Tưới tiêu:</strong> Tưới khi nào, tưới bao nhiêu, tưới vào thời điểm nào trong ngày để hiệu quả nhất.</li><li><strong>Bón phân:</strong> Dựa vào cảm biến NPK và pH, quyết định loại phân cần bón và liều lượng.</li><li><strong>Phòng bệnh:</strong> Dựa vào dữ liệu nhiệt độ và độ ẩm, có thể dự báo nguy cơ bùng phát của một số loại nấm bệnh để phun thuốc phòng ngừa chủ động.</li></ul>"
          },
          {
            "id": "iot-c4l3",
            "title": "Tích hợp IoT và AI",
            "content": "<h3>Bước tiến tiếp theo của Nông nghiệp thông minh:</h3><p>Khi đã có một lượng lớn dữ liệu lịch sử từ các cảm biến IoT, chúng ta có thể ứng dụng Trí tuệ nhân tạo (AI) và Học máy (Machine Learning) để làm những điều tuyệt vời hơn.</p><ul><li><strong>Dự báo:</strong> AI có thể phân tích dữ liệu thời tiết, độ ẩm đất, và giai đoạn sinh trưởng của cây để dự báo chính xác nhu cầu nước của cây trong vài ngày tới, hoặc dự báo thời điểm thu hoạch tối ưu.</li><li><strong>Chẩn đoán bệnh sớm:</strong> Kết hợp dữ liệu từ cảm biến với hình ảnh từ camera hoặc drone, AI có thể phát hiện các dấu hiệu bệnh tật trên cây trồng ở giai đoạn rất sớm, trước cả khi mắt người có thể nhận ra.</li><li><strong>Tối ưu hóa toàn diện:</strong> AI có thể phân tích tất cả các yếu tố đầu vào (giống, phân bón, nước, thời tiết) và kết quả đầu ra (năng suất, chất lượng) qua nhiều vụ để tìm ra một 'công thức' canh tác tối ưu nhất cho trang trại của bạn.</li></ul>"
          }
        ]
      }
    ]
  }
}