{
  "rice-course-v1": {
    "title": "Kỹ thuật trồng lúa hiệu quả",
    "meta": {
      "expert": "GS.TS. Bùi Chí Bửu",
      "field": "Trồng trọt",
      "duration": "8 giờ"
    },
    "image": "https://images.unsplash.com/photo-1560493676-04071c5f467b?q=80&w=1974&auto=format&fit=crop",
    "imageAlt": "Cánh đồng lúa xanh mướt",
    "sapo": "Khóa học này cung cấp kiến thức toàn diện từ cơ bản đến nâng cao về kỹ thuật canh tác lúa, giúp bà con nông dân tối ưu hóa năng suất, giảm chi phí và canh tác bền vững theo các tiêu chuẩn hiện đại.",
    "quizUrl": "quiz.html",
    "chapters": [
      {
        "title": "Chương 1: Chuẩn bị đất và chọn giống",
        "lessons": [
          {
            "id": "rice-c1l1",
            "title": "Phân tích và cải tạo đất",
            "content": "<h3>Tại sao cần phân tích đất?</h3><p>Phân tích đất giúp xác định độ pH, hàm lượng hữu cơ, và các chất dinh dưỡng đa, trung, vi lượng. Từ đó, ta có thể đưa ra biện pháp cải tạo phù hợp, tránh bón phân thừa hoặc thiếu.</p><h3>Các bước cải tạo đất cơ bản:</h3><ul><li>Đối với đất phèn: Bón vôi để nâng pH, kết hợp rửa phèn bằng nước ngọt.</li><li>Đối với đất mặn: Xây dựng hệ thống kênh mương để rửa mặn, trồng các giống cây chịu mặn.</li><li>Đối với đất bạc màu: Tăng cường bón phân hữu cơ, phân chuồng ủ hoai để bổ sung mùn và vi sinh vật.</li></ul>"
          },
          {
            "id": "rice-c1l2",
            "title": "Phương pháp làm đất hiện đại",
            "content": "<h3>Làm đất tối thiểu:</h3><p>Phương pháp này hạn chế xới lật đất, chỉ làm đất trên hàng gieo trồng. Giúp giữ cấu trúc đất, chống xói mòn và giữ ẩm.</p><h3>San phẳng mặt ruộng bằng laser:</h3><p>Sử dụng công nghệ laser giúp mặt ruộng bằng phẳng tuyệt đối. Lợi ích: tiết kiệm nước tưới, lúa sinh trưởng đồng đều, giảm cỏ dại, dễ dàng cơ giới hóa.</p>"
          },
          {
            "id": "rice-c1l3",
            "title": "Lựa chọn giống lúa phù hợp",
            "content": "<h3>Tiêu chí chọn giống:</h3><ul><li>Phù hợp với điều kiện khí hậu, thổ nhưỡng của địa phương.</li><li>Khả năng chống chịu sâu bệnh tốt.</li><li>Thời gian sinh trưởng phù hợp với khung thời vụ.</li><li>Năng suất cao, chất lượng gạo tốt, đáp ứng thị hiệu thị trường.</li></ul><p>Ví dụ: Vùng Đồng bằng sông Cửu Long thường chuộng các giống như OM5451, Đài Thơm 8...</p>"
          }
        ]
      },
      {
        "title": "Chương 2: Kỹ thuật gieo sạ và chăm sóc",
        "lessons": [
          {
            "id": "rice-c2l1",
            "title": "Ngâm ủ và xử lý hạt giống",
            "content": "<h3>Mục đích:</h3><p>Giúp hạt giống nảy mầm đều và khỏe, loại bỏ mầm bệnh tồn tại trên vỏ hạt.</p><h3>Các bước thực hiện:</h3><ul><li>Phơi lại hạt giống dưới nắng nhẹ 2-3 giờ.</li><li>Ngâm hạt trong nước sạch 24-36 giờ.</li><li>Vớt ra, rửa sạch và ủ trong bao tải hoặc thúng có lót rơm, giữ ẩm. Sau 24-36 giờ ủ, rễ và mầm sẽ nhú ra đều.</li></ul>"
          },
          {
            "id": "rice-c2l2",
            "title": "Kỹ thuật gieo sạ tiên tiến",
            "content": "<h3>Các phương pháp gieo sạ:</h3><ul><li>Sạ lan: Phổ biến nhưng tốn nhiều giống, lúa mọc không đều.</li><li>Sạ hàng: Tiết kiệm giống, dễ chăm sóc, lúa thông thoáng.</li><li>Sạ cụm (sạ khóm): Sử dụng máy sạ, tiết kiệm giống tối đa, hạn chế đổ ngã.</li></ul>"
          },
          {
            "id": "rice-c2l3",
            "title": "Quản lý nước tưới theo giai đoạn",
            "content": "<h3>Phương pháp tưới 'ngập khô xen kẽ' (AWD):</h3><p>Đây là kỹ thuật tưới tiên tiến giúp tiết kiệm 20-30% lượng nước, giảm phát thải khí metan và giúp bộ rễ lúa ăn sâu, cứng cây. Cần giữ mực nước ngập trong các giai đoạn quan trọng và để ruộng khô nứt chân chim ở các giai đoạn khác.</p>"
          }
        ]
      },
      {
        "title": "Chương 3: Quản lý dinh dưỡng và sâu bệnh",
        "lessons": [
          {
            "id": "rice-c3l1",
            "title": "Bón phân cân đối và hiệu quả",
            "content": "<h3>Nguyên tắc 4 đúng:</h3><ul><li>Đúng loại: Bón đúng loại phân mà cây cần ở từng giai đoạn.</li><li>Đúng liều: Bón đủ liều lượng theo khuyến cáo.</li><li>Đúng lúc: Bón đúng thời điểm cây cần dinh dưỡng nhất.</li><li>Đúng cách: Bón đúng phương pháp để cây hấp thu tốt nhất.</li></ul>"
          },
          {
            "id": "rice-c3l2",
            "title": "Nhận diện sâu bệnh hại chính",
            "content": "<h3>Các loại sâu bệnh phổ biến:</h3><ul><li><strong>Sâu hại:</strong> Rầy nâu, sâu cuốn lá, sâu đục thân.</li><li><strong>Bệnh hại:</strong> Bệnh đạo ôn, bệnh khô vằn, bệnh bạc lá.</li></ul><p>Việc nhận diện sớm triệu chứng giúp đưa ra biện pháp phòng trừ kịp thời.</p>"
          },
          {
            "id": "rice-c3l3",
            "title": "Quản lý dịch hại tổng hợp (IPM)",
            "content": "<h3>IPM là gì?</h3><p>Là phương pháp quản lý sâu bệnh bằng cách kết hợp nhiều biện pháp một cách hài hòa: sử dụng giống kháng, thiên địch, biện pháp canh tác, và chỉ sử dụng thuốc bảo vệ thực vật khi thật sự cần thiết.</p>"
          }
        ]
      },
      {
        "title": "Chương 4: Thu hoạch và bảo quản",
        "lessons": [
          {
            "id": "rice-c4l1",
            "title": "Xác định thời điểm thu hoạch tối ưu",
            "content": "<h3>Dấu hiệu lúa chín:</h3><p>Thu hoạch khi 85-90% số hạt trên bông đã chín vàng. Thu hoạch quá sớm làm giảm năng suất, quá muộn làm tăng tỷ lệ hao hụt và gãy vỡ khi xay xát.</p>"
          },
          {
            "id": "rice-c4l2",
            "title": "Phương pháp thu hoạch hiện đại",
            "content": "<h3>Cơ giới hóa:</h3><p>Sử dụng máy gặt đập liên hợp giúp giảm thiểu thất thoát sau thu hoạch, tiết kiệm thời gian và chi phí nhân công so với gặt tay thủ công.</p>"
          },
          {
            "id": "rice-c4l3",
            "title": "Kỹ thuật phơi sấy và bảo quản",
            "content": "<h3>Mục tiêu:</h3><p>Đưa độ ẩm của hạt lúa xuống dưới 14% để bảo quản được lâu, tránh nấm mốc và côn trùng gây hại. Có thể phơi nắng hoặc sử dụng lò sấy. Bảo quản nơi khô ráo, thoáng mát.</p>"
          }
        ]
      }
    ]
  },
  "chicken-course-v1": {
    "title": "Chăn nuôi gà an toàn sinh học",
    "meta": {
      "expert": "PGS.TS. Nguyễn Thị Minh",
      "field": "Chăn nuôi",
      "duration": "9 giờ"
    },
    "image": "https://images.unsplash.com/photo-1587303213013-106c4a86a644?q=80&w=1974&auto=format&fit=crop",
    "imageAlt": "Đàn gà khỏe mạnh trong trang trại",
    "sapo": "Trang bị kiến thức và kỹ năng thực hành chăn nuôi gà theo hướng an toàn sinh học, giúp phòng chống dịch bệnh hiệu quả, nâng cao chất lượng sản phẩm và tối đa hóa lợi nhuận.",
    "quizUrl": null,
    "chapters": [
      {
        "title": "Chương 1: Thiết kế và xây dựng chuồng trại",
        "lessons": [
          {
            "id": "chicken-c1l1",
            "title": "Lựa chọn địa điểm và hướng chuồng",
            "content": "<h3>Tiêu chí chọn địa điểm:</h3><ul><li><strong>Cao ráo, thoát nước tốt:</strong> Tránh các khu vực trũng, ngập úng để chuồng trại luôn khô ráo, hạn chế mầm bệnh phát triển.</li><li><strong>Cách ly:</strong> Xa khu dân cư, chợ, và các trang trại chăn nuôi khác để giảm nguy cơ lây nhiễm dịch bệnh từ bên ngoài.</li><li><strong>Nguồn nước:</strong> Phải có nguồn nước sạch, dồi dào để cung cấp cho gà uống và vệ sinh chuồng trại.</li><li><strong>An ninh:</strong> Nên có hàng rào bao quanh để ngăn chặn người lạ và động vật hoang dã xâm nhập.</li></ul><h3>Lựa chọn hướng chuồng:</h3><p>Hướng chuồng lý tưởng nhất ở Việt Nam là hướng <strong>Đông hoặc Đông-Nam</strong>. Lợi ích của việc chọn hướng này bao gồm:</p><ul><li>Đón được nắng sáng (có tác dụng diệt khuẩn) và gió mát.</li><li>Tránh được nắng chiều gay gắt và gió mùa đông bắc lạnh buốt.</li><li>Giúp chuồng trại thông thoáng tự nhiên, giảm độ ẩm và khí độc.</li></ul>"
          },
          {
            "id": "chicken-c1l2",
            "title": "Vật liệu và kết cấu chuồng trại",
            "content": "<h3>Kết cấu chuồng trại cơ bản:</h3><ul><li><strong>Nền chuồng:</strong> Nên làm bằng xi măng, có độ dốc 2-3% về phía rãnh thoát nước để dễ dàng cọ rửa, vệ sinh. Nền phải được láng nhẵn để tránh gây tổn thương cho chân gà.</li><li><strong>Mái chuồng:</strong> Sử dụng vật liệu cách nhiệt tốt như tôn lạnh, ngói hoặc mái lá để giữ mát vào mùa hè. Chiều cao mái phù hợp (khoảng 2.5 - 3m) để đảm bảo thông thoáng.</li><li><strong>Tường chuồng:</strong> Có thể xây tường lửng cao khoảng 40-50 cm, phần còn lại dùng lưới B40 hoặc lưới mắt cáo để tạo sự thông thoáng. Phải có bạt che di động để che chắn khi mưa tạt hoặc trời lạnh.</li><li><strong>Chất độn chuồng (litter):</strong> Sử dụng trấu, mùn cưa hoặc rơm rạ khô, sạch, dày khoảng 5-10 cm để giữ ấm và thấm hút chất thải.</li></ul>"
          },
          {
            "id": "chicken-c1l3",
            "title": "Mật độ chăn nuôi phù hợp",
            "content": "<h3>Tại sao mật độ quan trọng?</h3><p>Mật độ chăn nuôi ảnh hưởng trực tiếp đến sức khỏe, tốc độ tăng trưởng và hành vi của đàn gà. Nuôi quá dày sẽ gây stress, tăng nguy cơ dịch bệnh, cắn mổ lẫn nhau và ô nhiễm không khí chuồng nuôi.</p><h3>Mật độ khuyến cáo:</h3><ul><li><strong>Gà thịt công nghiệp:</strong> 8 - 10 con/m².</li><li><strong>Gà lông màu (thả vườn):</strong> 7 - 9 con/m².</li><li><strong>Gà đẻ (nuôi nền):</strong> 4 - 5 con/m².</li></ul><p>Lưu ý: Mật độ này cần được điều chỉnh tùy thuộc vào mùa (mùa hè cần nuôi thưa hơn mùa đông) và hệ thống thông gió của chuồng trại.</p>"
          }
        ]
      },
      {
        "title": "Chương 2: Chọn giống và kỹ thuật úm gà con",
        "lessons": [
          {
            "id": "chicken-c2l1",
            "title": "Đặc điểm các giống gà phổ biến",
            "content": "<h3>Phân loại các giống gà:</h3><ul><li><strong>Gà hướng thịt:</strong> Lớn nhanh, hiệu quả chuyển hóa thức ăn cao. Ví dụ: Gà Cobb 500, Ross 308, gà Lương Phượng.</li><li><strong>Gà hướng trứng:</strong> Sản lượng trứng cao, tiêu tốn thức ăn trên mỗi quả trứng thấp. Ví dụ: Gà Ai Cập (Leghorn), ISA Brown, Hy-Line.</li><li><strong>Gà kiêm dụng (hướng thịt - trứng):</strong> Có thể nuôi lấy cả thịt và trứng, chất lượng thịt thơm ngon, phù hợp với thị hiếu người Việt. Ví dụ: Gà Ri, gà Hồ, gà Đông Tảo, gà Mía.</li></ul><p>Lựa chọn giống gà phải dựa trên mục đích chăn nuôi, điều kiện thị trường và khả năng đầu tư của gia đình/trang trại.</p>"
          },
          {
            "id": "chicken-c2l2",
            "title": "Kỹ thuật úm gà con hiệu quả",
            "content": "<h3>Giai đoạn úm (1-4 tuần tuổi):</h3><p>Đây là giai đoạn quyết định tỷ lệ sống và sự đồng đều của cả đàn gà. Cần chuẩn bị kỹ lưỡng quây úm và các thiết bị.</p><h3>Các yếu tố quan trọng trong úm gà:</h3><ul><li><strong>Nhiệt độ:</strong> Tuần đầu tiên cần duy trì ở 32-35°C, sau đó giảm dần 2-3°C mỗi tuần. Quan sát hành vi của gà: nếu chúng tụm lại dưới đèn là lạnh, tản ra xa đèn là nóng, tản đều là nhiệt độ phù hợp.</li><li><strong>Ánh sáng:</strong> Chiếu sáng 24/24 trong 3 ngày đầu để gà quen với máng ăn, máng uống.</li><li><strong>Thức ăn và nước uống:</strong> Cung cấp đầy đủ thức ăn chất lượng cao (hàm lượng đạm 20-22%) và nước sạch, có thể pha thêm vitamin, điện giải để tăng sức đề kháng.</li></ul>"
          },
          {
            "id": "chicken-c2l3",
            "title": "Cách chọn gà con khỏe mạnh",
            "content": "<h3>Tiêu chí chọn gà 1 ngày tuổi:</h3><ul><li><strong>Nhanh nhẹn:</strong> Gà hoạt bát, di chuyển nhanh, không uể oải.</li><li><strong>Lông bông, khô:</strong> Lông tơi xốp, khô và sạch sẽ.</li><li><strong>Mắt sáng:</strong> Mắt mở to, tinh nhanh, không bị dị tật.</li><li><strong>Bụng thon, rốn kín:</strong> Bụng gọn, không bị hở rốn hoặc viêm rốn.</li><li><strong>Chân bóng, thẳng:</strong> Chân mập mạp, đi lại bình thường, không bị dị tật khoèo chân.</li><li><strong>Đồng đều:</strong> Chọn những con có kích cỡ tương đồng nhau trong đàn.</li></ul><p>Loại bỏ ngay những con yếu, dị tật để tránh lây bệnh và ảnh hưởng đến sự phát triển chung của đàn.</p>"
          }
        ]
      },
      {
        "title": "Chương 3: Dinh dưỡng và thức ăn",
        "lessons": [
          {
            "id": "chicken-c3l1",
            "title": "Nhu cầu dinh dưỡng của gà",
            "content": "<h3>Các thành phần dinh dưỡng thiết yếu:</h3><ul><li><strong>Năng lượng:</strong> Cung cấp từ các loại ngũ cốc như ngô, cám gạo. Đây là nguồn năng lượng chính cho mọi hoạt động sống.</li><li><strong>Protein (chất đạm):</strong> Cần cho sự phát triển cơ bắp, có trong khô dầu đậu tương, bột cá. Nhu cầu đạm cao nhất ở giai đoạn gà con.</li><li><strong>Vitamin:</strong> Các loại vitamin A, D, E và nhóm B rất quan trọng cho sự tăng trưởng và sức đề kháng.</li><li><strong>Khoáng chất:</strong> Canxi và Phốt pho cần cho sự phát triển của xương. Gà đẻ cần nhiều canxi để hình thành vỏ trứng.</li></ul><p>Nhu cầu dinh dưỡng thay đổi rõ rệt theo từng giai đoạn: gà con (starter), gà giò (grower), gà vỗ béo (finisher) và gà đẻ.</p>"
          },
          {
            "id": "chicken-c3l2",
            "title": "Các loại thức ăn phổ biến",
            "content": "<h3>Thức ăn công nghiệp (dạng viên):</h3><p><strong>Ưu điểm:</strong> Tiện lợi, đã được cân đối đầy đủ dinh dưỡng cho từng giai đoạn, dễ bảo quản, giảm lãng phí. <strong>Nhược điểm:</strong> Chi phí cao hơn.</p><h3>Thức ăn tự phối trộn:</h3><p><strong>Ưu điểm:</strong> Tận dụng được các nguồn nguyên liệu sẵn có tại địa phương (ngô, thóc, cám gạo, rau xanh...), giúp giảm chi phí. <strong>Nhược điểm:</strong> Đòi hỏi kiến thức về phối trộn để đảm bảo cân đối dinh dưỡng, tốn công sức và khó bảo quản.</p><p>Một công thức phối trộn đơn giản có thể bao gồm: 50% ngô, 20% cám gạo, 25% khô dầu đậu tương, 5% bột cá và premix khoáng-vitamin.</p>"
          },
          {
            "id": "chicken-c3l3",
            "title": "Kỹ thuật cho ăn và uống",
            "content": "<h3>Nguyên tắc cung cấp nước:</h3><p>Nước phải luôn SẠCH, MÁT và ĐẦY ĐỦ. Gà có thể nhịn ăn vài giờ nhưng không thể nhịn uống. Máng uống cần được cọ rửa hàng ngày để tránh rêu và mầm bệnh.</p><h3>Kỹ thuật cho ăn:</h3><ul><li><strong>Số lần cho ăn:</strong> Cho ăn nhiều lần trong ngày (ít nhất 3-4 lần) sẽ kích thích gà ăn nhiều hơn và tránh lãng phí.</li><li><strong>Vệ sinh máng ăn:</strong> Thường xuyên vệ sinh máng ăn, loại bỏ thức ăn thừa, ẩm mốc.</li><li><strong>Chiều cao máng ăn/uống:</strong> Treo máng ăn và máng uống ngang với tầm lưng của gà để chúng dễ dàng lấy thức ăn/nước uống và tránh làm rơi vãi, ô nhiễm.</li></ul>"
          }
        ]
      },
      {
        "title": "Chương 4: Vệ sinh và phòng bệnh",
        "lessons": [
          {
            "id": "chicken-c4l1",
            "title": "Quy trình vệ sinh chuồng trại",
            "content": "<h3>Vệ sinh hàng ngày:</h3><ul><li>Dọn dẹp thức ăn, nước uống rơi vãi.</li><li>Cọ rửa máng ăn, máng uống.</li><li>Quan sát và loại bỏ những con gà ốm yếu, chết.</li></ul><h3>Vệ sinh cuối lứa nuôi (Cùng vào - Cùng ra):</h3><p>Đây là quy trình cực kỳ quan trọng để cắt đứt mầm bệnh giữa các lứa nuôi.</p><ol><li>Thu dọn toàn bộ thiết bị, chất độn chuồng ra khỏi chuồng.</li><li>Dùng vòi nước áp lực cao rửa sạch trần, tường, nền chuồng.</li><li>Phun thuốc sát trùng toàn bộ chuồng trại, để khô.</li><li>Quét vôi trắng tường và nền chuồng.</li><li>Để trống chuồng ít nhất 2 tuần trước khi nhập lứa gà mới.</li></ol>"
          },
          {
            "id": "chicken-c4l2",
            "title": "Lịch vaccine quan trọng cho gà",
            "content": "<h3>Phòng bệnh hơn chữa bệnh:</h3><p>Vaccine là biện pháp phòng bệnh chủ động, hiệu quả và kinh tế nhất. Cần tuân thủ nghiêm ngặt lịch tiêm phòng được khuyến cáo.</p><h3>Lịch vaccine tham khảo cho gà thịt:</h3><ul><li><strong>1-3 ngày tuổi:</strong> Vaccine Newcastle-Viêm phế quản truyền nhiễm (ND-IB) lần 1 (nhỏ mắt, mũi).</li><li><strong>7 ngày tuổi:</strong> Vaccine Gumboro (IBD) lần 1 (pha nước uống).</li><li><strong>12 ngày tuổi:</strong> Vaccine Đậu gà (chủng màng cánh).</li><li><strong>21 ngày tuổi:</strong> Vaccine Gumboro lần 2 và ND-IB lần 2.</li><li><strong>28 ngày tuổi:</strong> Vaccine phòng Cúm gia cầm (tiêm).</li></ul><p>Lưu ý: Chỉ chủng vaccine cho đàn gà khỏe mạnh.</p>"
          },
          {
            "id": "chicken-c4l3",
            "title": "An toàn sinh học trong chăn nuôi",
            "content": "<h3>An toàn sinh học là gì?</h3><p>Là tổng hợp các biện pháp nhằm ngăn chặn sự xâm nhập và lây lan của mầm bệnh vào trang trại. Đây là hàng rào bảo vệ vững chắc nhất cho đàn vật nuôi.</p><h3>Các biện pháp cốt lõi:</h3><ul><li><strong>Cách ly:</strong> Xây dựng hàng rào, kiểm soát chặt chẽ người và phương tiện ra vào trại. Có hố sát trùng ở cổng và cửa mỗi dãy chuồng.</li><li><strong>Vệ sinh:</strong> Thực hiện nghiêm ngặt quy trình vệ sinh chuồng trại, dụng cụ chăn nuôi.</li><li><strong>Kiểm soát côn trùng và vật chủ trung gian:</strong> Phát quang bụi rậm, diệt chuột, ruồi, muỗi...</li><li><strong>Áp dụng nguyên tắc 'Cùng vào - Cùng ra':</strong> Nuôi cùng một lứa gà, xuất bán cùng lúc và thực hiện vệ sinh, để trống chuồng trước khi nhập lứa mới.</li></ul>"
          }
        ]
      }
    ]
  },
  "coffee-course-v1": {
    "title": "Canh tác Cà phê Robusta bền vững",
    "meta": {
      "expert": "ThS. Trần Văn Hùng",
      "field": "Cây công nghiệp",
      "duration": "10 giờ"
    },
    "image": "https://images.unsplash.com/photo-1599399325946-53243f789547?q=80&w=2070&auto=format&fit=crop",
    "imageAlt": "Vườn cà phê với những quả chín đỏ",
    "sapo": "Học cách trồng và chăm sóc cà phê Robusta để đạt năng suất cao, chất lượng tốt và thân thiện với môi trường, đáp ứng các tiêu chuẩn xuất khẩu.",
    "quizUrl": null,
    "chapters": [
      {
        "title": "Chương 1: Chọn giống và thiết kế vườn",
        "lessons": [
          {
            "id": "coffee-c1l1",
            "title": "Lựa chọn giống cà phê Robusta",
            "content": "<h3>Tại sao chọn đúng giống là quan trọng?</h3><p>Việc chọn giống quyết định đến 50% sự thành công của vườn cà phê, ảnh hưởng trực tiếp đến năng suất, chất lượng hạt, khả năng chống chịu sâu bệnh và sự thích nghi với điều kiện địa phương.</p><h3>Các dòng vô tính Robusta phổ biến:</h3><ul><li><strong>Dòng TR4, TR9, TR11, TR12:</strong> Các dòng do Viện Khoa học Kỹ thuật Nông Lâm nghiệp Tây Nguyên (WASI) chọn lọc, có năng suất cao (4-7 tấn nhân/ha), hạt lớn, kháng bệnh gỉ sắt tốt.</li><li><strong>Giống Thiện Trường, Xanh Lùn:</strong> Các giống do người dân tự chọn lọc, có đặc tính sinh trưởng khỏe, năng suất ổn định và thích nghi tốt với nhiều vùng sinh thái.</li></ul><p>Khi chọn giống, bà con cần mua cây giống từ các vườn ươm uy tín, đảm bảo cây khỏe mạnh, không sâu bệnh và đúng dòng đã chọn.</p>"
          },
          {
            "id": "coffee-c1l2",
            "title": "Thiết kế vườn và trồng cây che bóng",
            "content": "<h3>Thiết kế vườn cây:</h3><p>Mật độ trồng phổ biến cho cà phê Robusta là 1.100 - 1.330 cây/ha. Khoảng cách trồng thích hợp là 3m x 3m. Ở những vùng đất dốc, cần trồng theo đường đồng mức để chống xói mòn.</p><h3>Tầm quan trọng của cây che bóng:</h3><p>Trồng cây che bóng giúp điều hòa tiểu khí hậu vườn cây, giữ ẩm cho đất, hạn chế cỏ dại, cung cấp chất hữu cơ và tạo môi trường bền vững. Cây che bóng nên có tán lá không quá rậm rạp, rễ ăn sâu để không cạnh tranh dinh dưỡng với cà phê.</p><h3>Các loại cây che bóng phù hợp:</h3><ul><li><strong>Cây che bóng tạm thời:</strong> Cây chuối, muồng hoa vàng... được trồng trong những năm đầu kiến thiết.</li><li><strong>Cây che bóng lâu dài:</strong> Cây sầu riêng, bơ, hoặc các cây họ đậu như keo dậu, muồng đen... vừa che bóng vừa có thể cho thêm thu nhập.</p>"
          },
          {
            "id": "coffee-c1l3",
            "title": "Kỹ thuật trồng và bón lót",
            "content": "<h3>Thời vụ trồng:</h3><p>Tốt nhất là trồng vào đầu mùa mưa (tháng 5 - 7) để cây con có đủ nước và nhanh chóng phục hồi.</p><h3>Chuẩn bị hố trồng:</h3><p>Hố trồng cần được đào trước 1 tháng với kích thước khoảng 60x60x60 cm. Việc này giúp đất tơi xốp và diệt trừ mầm bệnh.</p><h3>Kỹ thuật bón lót:</h3><p>Mỗi hố cần được bón lót bằng hỗn hợp gồm:</p><ul><li>10-15 kg phân chuồng ủ hoai.</li><li>0.5-1 kg phân lân nung chảy.</li><li>Trộn đều phân với lớp đất mặt và lấp đầy hố.</li></ul><p>Khi trồng, dùng cuốc moi một lỗ nhỏ ở giữa hố, đặt cây con vào, lấp đất và nén nhẹ xung quanh gốc. Sau khi trồng cần tưới đẫm nước và tủ gốc bằng rơm rạ hoặc cỏ khô để giữ ẩm.</p>"
          }
        ]
      },
      {
        "title": "Chương 2: Chăm sóc và tưới nước",
        "lessons": [
          {
            "id": "coffee-c2l1",
            "title": "Tưới nước tiết kiệm và hiệu quả",
            "content": "<h3>Các giai đoạn cần nước:</h3><p>Cà phê cần nhiều nước nhất vào giai đoạn ra hoa (để hoa nở đồng loạt) và giai đoạn quả lớn nhanh. Thiếu nước trong các giai đoạn này sẽ làm giảm năng suất nghiêm trọng.</p><h3>Phương pháp tưới tiết kiệm:</h3><ul><li><strong>Tưới nhỏ giọt:</strong> Là phương pháp hiệu quả nhất, đưa nước và phân bón trực tiếp đến vùng rễ, tiết kiệm đến 40-50% lượng nước so với tưới tràn và giảm sự phát triển của cỏ dại.</li><li><strong>Tưới phun mưa tại gốc:</strong> Sử dụng béc tưới có bán kính nhỏ, tập trung nước vào khu vực gốc cây, hiệu quả hơn tưới phun mưa cả vườn.</li></ul>"
          },
          {
            "id": "coffee-c2l2",
            "title": "Kỹ thuật cắt cành, tạo tán",
            "content": "<h3>Mục đích:</h3><p>Cắt cành, tạo tán giúp loại bỏ cành già, cành sâu bệnh, cành vô hiệu (cành không cho quả) để tập trung dinh dưỡng nuôi cành khỏe mạnh và quả. Đồng thời, tạo ra một bộ tán cân đối, thông thoáng, giúp cây quang hợp tốt hơn và hạn chế sâu bệnh.</p><h3>Các loại cắt cành chính:</h3><ul><li><strong>Tạo hình cơ bản (năm 1-3):</strong> Nuôi một thân chính khỏe mạnh và loại bỏ các chồi vượt.</li><li><strong>Cắt cành kinh doanh (hàng năm):</strong> Thực hiện sau khi thu hoạch, bao gồm việc cắt bỏ cành khô, cành sâu bệnh, cành mọc chen chúc trong tán.</li><li><strong>Hãm ngọn:</strong> Khi cây đạt chiều cao 1.8 - 2m, tiến hành hãm ngọn để cây phát triển tán ngang và thuận tiện cho việc thu hái.</li></ul>"
          },
          {
            "id": "coffee-c2l3",
            "title": "Quản lý cỏ dại và thảm phủ thực vật",
            "content": "<h3>Tác hại của cỏ dại:</h3><p>Cỏ dại cạnh tranh trực tiếp dinh dưỡng, nước và ánh sáng với cây cà phê, đồng thời là nơi trú ngụ của sâu bệnh.</p><h3>Biện pháp quản lý bền vững:</h3><ul><li><strong>Làm cỏ thủ công:</strong> Dùng cuốc, dao phát để làm sạch cỏ quanh gốc, đặc biệt là vào đầu và cuối mùa mưa.</li><li><strong>Trồng cây thảm phủ:</strong> Trồng các loại cây như lạc dại (Arachis pintoi) giúp che phủ mặt đất, ngăn cản cỏ dại phát triển, giữ ẩm và cải tạo đất.</li><li><strong>Tủ gốc:</strong> Sử dụng rơm rạ, cỏ khô, hoặc tàn dư thực vật để phủ quanh gốc cà phê, giúp giữ ẩm và hạn chế cỏ mọc.</li></ul><p>Hạn chế tối đa việc sử dụng thuốc trừ cỏ hóa học để bảo vệ hệ sinh vật đất và môi trường.</p>"
          }
        ]
      },
      {
        "title": "Chương 3: Phòng trừ sâu bệnh hại",
        "lessons": [
          {
            "id": "coffee-c3l1",
            "title": "Nhận diện sâu bệnh phổ biến",
            "content": "<h3>Các loại sâu bệnh chính:</h3><ul><li><strong>Bệnh gỉ sắt (Hemileia vastatrix):</strong> Trên lá xuất hiện các đốm vàng cam, mặt dưới có lớp bột màu da cam. Bệnh nặng làm lá rụng hàng loạt, cây suy kiệt.</li><li><strong>Rệp sáp (Planococcus spp.):</strong> Gây hại ở rễ, chùm quả, kẽ lá. Rệp chích hút nhựa làm cây còi cọc, quả rụng. Chúng thường cộng sinh với kiến.</li><li><strong>Mọt đục quả (Hypothenemus hampei):</strong> Sâu non đục vào bên trong nhân, làm hỏng hạt và giảm chất lượng nghiêm trọng.</li><li><strong>Bệnh khô cành, khô quả:</strong> Do nấm Colletotrichum coffeanum gây ra, thường phát triển mạnh trong điều kiện ẩm độ cao, làm cành và quả non bị khô đen.</li></ul>"
          },
          {
            "id": "coffee-c3l2",
            "title": "Biện pháp sinh học và IPM",
            "content": "<h3>Quản lý dịch hại tổng hợp (IPM):</h3><p>Là sự kết hợp hài hòa nhiều biện pháp để kiểm soát sâu bệnh, ưu tiên các biện pháp an toàn và thân thiện môi trường.</p><h3>Các biện pháp sinh học:</h3><ul><li><strong>Bảo vệ thiên địch:</strong> Kiến vàng, bọ rùa, ong ký sinh... là những loài thiên địch tự nhiên của rệp và các loại sâu hại khác.</li><li><strong>Sử dụng chế phẩm sinh học:</strong> Dùng nấm đối kháng như Beauveria bassiana để phòng trừ mọt đục quả, hoặc Trichoderma để phòng bệnh thối rễ.</li><li><strong>Sử dụng bẫy:</strong> Dùng bẫy màu vàng để thu hút và tiêu diệt rầy, hoặc bẫy Pheromone để bắt mọt đục quả.</li></ul>"
          },
          {
            "id": "coffee-c3l3",
            "title": "Sử dụng thuốc BVTV an toàn",
            "content": "<h3>Nguyên tắc 4 đúng:</h3><p>Chỉ sử dụng thuốc bảo vệ thực vật (BVTV) khi thật sự cần thiết và phải tuân thủ nghiêm ngặt nguyên tắc 4 đúng:</p><ul><li><strong>Đúng thuốc:</strong> Chọn loại thuốc đặc trị cho đối tượng sâu bệnh cần phòng trừ.</li><li><strong>Đúng lúc:</strong> Phun khi sâu bệnh mới phát sinh hoặc ở ngưỡng có thể gây hại kinh tế.</li><li><strong>Đúng liều lượng, nồng độ:</strong> Pha thuốc theo đúng hướng dẫn trên bao bì.</li><li><strong>Đúng cách:</strong> Phun đều lên các bộ phận của cây, đảm bảo an toàn cho người phun và tuân thủ thời gian cách ly trước khi thu hoạch.</li></ul><p>Ưu tiên sử dụng các loại thuốc có nguồn gốc sinh học, ít độc hại để bảo vệ sức khỏe và môi trường.</p>"
          }
        ]
      },
      {
        "title": "Chương 4: Thu hoạch và chế biến",
        "lessons": [
          {
            "id": "coffee-c4l1",
            "title": "Thu hái cà phê đúng độ chín",
            "content": "<h3>Tầm quan trọng của thu hái:</h3><p>Chất lượng tách cà phê được quyết định ngay từ khâu thu hái. Thu hoạch đúng độ chín đảm bảo hạt cà phê tích lũy đủ lượng đường, hương vị phong phú và trọng lượng tối đa.</p><h3>Phương pháp thu hái:</h3><ul><li><strong>Hái lựa (Selective Picking):</strong> Là phương pháp tốt nhất, công nhân chỉ hái những quả cà phê đã chín đỏ mọng. Phương pháp này đòi hỏi nhiều công sức nhưng cho chất lượng hạt cao nhất, phù hợp để chế biến cà phê đặc sản.</li><li><strong>Tuốt cành (Stripping):</strong> Thu hoạch toàn bộ quả trên cành, bao gồm cả quả xanh, chín và quá chín. Phương pháp này nhanh hơn nhưng chất lượng không đồng đều, cần phải phân loại kỹ sau khi hái.</li></ul><p>Nên thu hái vào những ngày khô ráo, tránh làm dập nát quả.</p>"
          },
          {
            "id": "coffee-c4l2",
            "title": "Các phương pháp chế biến (khô, ướt)",
            "content": "<h3>Chế biến khô (Natural/Dry Process):</h3><p>Đây là phương pháp truyền thống. Quả cà phê sau khi thu hái sẽ được dàn mỏng trên sân phơi hoặc giàn phơi dưới ánh nắng mặt trời trong khoảng 3-4 tuần, đảo đều thường xuyên cho đến khi độ ẩm còn khoảng 11-12%. Phương pháp này tạo ra cà phê có vị ngọt đậm, body dày và ít chua.</p><h3>Chế biến ướt (Washed/Wet Process):</h3><p>Quy trình phức tạp hơn:</p><ol><li><strong>Xát vỏ:</strong> Loại bỏ lớp vỏ thịt ngay sau khi thu hái.</li><li><strong>Lên men:</strong> Ngâm hạt trong bể nước từ 12-36 giờ để loại bỏ lớp nhớt.</li><li><strong>Rửa sạch:</strong> Rửa sạch lớp nhớt đã bị phân hủy.</li><li><strong>Phơi/sấy khô:</strong> Phơi khô hạt đến độ ẩm yêu cầu.</li></ol><p>Phương pháp này tạo ra cà phê có hương vị trong trẻo, tinh tế, độ chua rõ nét.</p>"
          },
          {
            "id": "coffee-c4l3",
            "title": "Bảo quản cà phê nhân xanh",
            "content": "<h3>Mục tiêu:</h3><p>Bảo quản cà phê nhân xanh đúng cách giúp duy trì chất lượng, hương vị và tránh bị nấm mốc, côn trùng tấn công.</p><h3>Yêu cầu kỹ thuật:</h3><ul><li><strong>Độ ẩm:</strong> Độ ẩm lý tưởng của hạt cà phê nhân để bảo quản là 12.5%. Hạt quá khô sẽ giòn, dễ vỡ; hạt quá ẩm sẽ dễ bị mốc.</li><li><strong>Bao bì:</strong> Sử dụng các loại bao chuyên dụng như bao đay, hoặc tốt hơn là bao GrainPro có lớp lót nhựa để cách ly hạt với môi trường bên ngoài.</li><li><strong>Kho chứa:</strong> Kho phải khô ráo, thoáng mát, sạch sẽ, không có mùi lạ và tránh ánh nắng trực tiếp. Kê các bao cà phê trên pallet, cách tường và sàn để không khí lưu thông.</li></ul>"
          }
        ]
      }
    ]
  },
  "pepper-course-v1": {
    "title": "Thâm canh Hồ tiêu theo tiêu chuẩn VietGAP",
    "meta": {
      "expert": "KS. Lê Thị Lan Anh",
      "field": "Cây công nghiệp",
      "duration": "9 giờ"
    },
    "image": "https://images.unsplash.com/photo-1629033819974-272d3637651a?q=80&w=1964&auto=format&fit=crop",
    "imageAlt": "Dây hồ tiêu đen trên trụ",
    "sapo": "Cung cấp quy trình kỹ thuật trồng và chăm sóc hồ tiêu tiên tiến, tập trung vào việc phòng trừ bệnh hại và tạo ra sản phẩm an toàn, chất lượng cao.",
    "quizUrl": null,
    "chapters": [
      {
        "title": "Chương 1: Giống và Trụ tiêu",
        "lessons": [
          {
            "id": "pepper-c1l1",
            "title": "Chọn giống tiêu và nhân giống",
            "content": "<h3>Tầm quan trọng của giống:</h3><p>Giống là yếu tố quyết định năng suất và khả năng chống chịu sâu bệnh của vườn tiêu. VietGAP yêu cầu giống phải có nguồn gốc rõ ràng, sạch bệnh.</p><h3>Các giống tiêu phổ biến:</h3><ul><li><strong>Giống Vĩnh Linh:</strong> Rất phổ biến, sinh trưởng khỏe, chịu hạn tốt, năng suất cao nhưng dễ nhiễm bệnh chết nhanh.</li><li><strong>Giống Lộc Ninh, Sẻ:</strong> Giống địa phương, thơm, cay, chất lượng hạt tốt, có khả năng chống chịu khá tốt với điều kiện địa phương.</li><li><strong>Giống Ấn Độ (Anbipur):</strong> Gié dài, hạt to, năng suất cao, nhưng cần đầu tư thâm canh cao.</li></ul><h3>Kỹ thuật nhân giống:</h3><p>Chủ yếu nhân giống bằng hom. Chọn những dây thân mập mạp, khỏe mạnh, sạch sâu bệnh để cắt hom. Mỗi hom có 3-5 mắt, sau khi cắt được giâm trong bầu đất tơi xốp, che mát để hom ra rễ trước khi đem trồng.</p>"
          },
          {
            "id": "pepper-c1l2",
            "title": "Lựa chọn và xử lý trụ (trụ sống, trụ chết)",
            "content": "<h3>Trụ sống:</h3><p><strong>Ưu điểm:</strong> Điều hòa tiểu khí hậu, giữ ẩm, chi phí ban đầu thấp. <strong>Nhược điểm:</strong> Cạnh tranh dinh dưỡng, có thể là ký chủ của sâu bệnh, khó quản lý tán. <strong>Các loại cây trụ sống phổ biến:</strong> Cây lồng mức (gòn), keo dậu, muồng đen, anh đào giả.</p><h3>Trụ chết:</h3><p><strong>Ưu điểm:</strong> Không cạnh tranh dinh dưỡng, dễ quản lý, vườn thông thoáng. <strong>Nhược điểm:</strong> Chi phí đầu tư cao, tuổi thọ có hạn (trụ gỗ), mùa khô gây nóng cho cây tiêu. <strong>Các loại trụ chết phổ biến:</strong> Trụ gỗ, trụ bê tông.</p><h3>Xử lý trụ:</h3><p>Đối với trụ gỗ, cần ngâm hoặc xử lý để tăng độ bền. Đối với trụ sống, cần trồng trước ít nhất 1 năm để trụ đủ lớn và vững chãi trước khi cho tiêu leo bám.</p>"
          },
          {
            "id": "pepper-c1l3",
            "title": "Kỹ thuật trồng và chăm sóc cây con",
            "content": "<h3>Thời vụ và mật độ:</h3><p>Trồng vào đầu mùa mưa là tốt nhất. Mật độ trồng phổ biến khoảng 1.600 - 2.500 trụ/ha, tùy thuộc vào loại trụ và địa hình.</p><h3>Chuẩn bị hố trồng:</h3><p>Đào hố kích thước 50x50x50 cm. Bón lót mỗi hố bằng 10-15kg phân chuồng hoai mục + 0.5kg phân lân + 0.5kg vôi. Trộn đều với đất và lấp hố trước khi trồng 1 tháng.</p><h3>Kỹ thuật trồng:</h3><p>Đặt bầu tiêu nghiêng về phía trụ, lấp đất và nén chặt. Dùng dây mềm buộc dây tiêu vào trụ. Sau khi trồng cần tưới nước và tủ gốc bằng cỏ khô để giữ ẩm.</p>"
          }
        ]
      },
      {
        "title": "Chương 2: Quản lý dinh dưỡng",
        "lessons": [
          {
            "id": "pepper-c2l1",
            "title": "Bón phân hữu cơ và vô cơ",
            "content": "<h3>Tầm quan trọng của phân hữu cơ:</h3><p>Phân hữu cơ là nền tảng của canh tác bền vững. Bón 15-20kg phân chuồng hoai mục/trụ hàng năm giúp cải tạo đất, tăng vi sinh vật có lợi, giúp rễ tiêu phát triển khỏe mạnh và tăng khả năng chống chịu bệnh tật.</p><h3>Bón phân vô cơ (NPK) theo giai đoạn:</h3><ul><li><strong>Giai đoạn kiến thiết (1-3 năm):</strong> Bón phân có hàm lượng đạm cao để cây phát triển thân, lá.</li><li><strong>Giai đoạn kinh doanh (từ năm thứ 3):</strong> Bón phân cân đối, tăng hàm lượng lân và kali vào giai đoạn trước ra hoa và nuôi quả. Lượng bón và số lần bón phụ thuộc vào độ phì của đất và năng suất của vườn cây.</li></ul><p>VietGAP khuyến khích sử dụng phân bón thông minh, phân bón tan chậm để giảm thất thoát ra môi trường.</p>"
          },
          {
            "id": "pepper-c2l2",
            "title": "Quản lý đất và độ ẩm",
            "content": "<h3>Thoát nước là ưu tiên hàng đầu:</h3><p>Cây tiêu cực kỳ nhạy cảm với úng nước, là nguyên nhân chính gây bệnh chết nhanh. Vườn phải có hệ thống rãnh thoát nước tốt, đặc biệt là ở những vùng đất bằng. Mùa mưa cần khơi thông rãnh, tránh nước đọng quanh gốc.</p><h3>Quản lý độ ẩm:</h3><p>Tủ gốc bằng cỏ khô, rơm rạ vào mùa khô để giữ ẩm và giữ mát cho bộ rễ. Trồng cây che phủ đất như lạc dại cũng là một giải pháp tốt. Tưới nước đầy đủ vào giai đoạn khô hạn, đặc biệt là khi cây đang ra hoa và nuôi quả.</p>"
          },
          {
            "id": "pepper-c2l3",
            "title": "Tỉa cành và tạo hình cho cây tiêu",
            "content": "<h3>Mục đích:</h3><p>Tạo cho cây có bộ tán cân đối, thông thoáng, loại bỏ cành vô hiệu, cành sâu bệnh để tập trung dinh dưỡng nuôi quả.</p><h3>Kỹ thuật:</h3><ul><li><strong>Buộc dây:</strong> Thường xuyên buộc các dây thân vào trụ để tránh bị gió làm gãy.</li><li><strong>Tỉa cành:</strong> Cắt bỏ các cành ở gần mặt đất (cách gốc 30-40cm) để tránh lây bệnh từ đất. Loại bỏ các cành mọc yếu, cành bị sâu bệnh, cành mọc quá dày trong tán.</li><li><strong>Đôn tiêu (bấm ngọn):</strong> Khi tiêu leo lên gần đỉnh trụ, bấm ngọn để cây phát triển cành ngang (cành cho quả).</li></ul>"
          }
        ]
      },
      {
        "title": "Chương 3: Phòng bệnh hại",
        "lessons": [
          {
            "id": "pepper-c3l1",
            "title": "Bệnh chết nhanh, chết chậm",
            "content": "<h3>Bệnh chết nhanh (do nấm Phytophthora):</h3><p><strong>Triệu chứng:</strong> Cây đang xanh tốt đột ngột héo rũ, lá và gié quả không kịp rụng. Bệnh lây lan rất nhanh qua nước, thường xảy ra vào mùa mưa ở những vườn bị úng nước. <strong>Phòng trừ:</strong> Thoát nước tốt là biện pháp quan trọng nhất. Sử dụng nấm đối kháng Trichoderma bón vào gốc. Khi có bệnh, dùng các loại thuốc đặc trị gốc Metalaxyl, Mancozeb...</p><h3>Bệnh chết chậm (do tuyến trùng và nấm Fusarium):</h3><p><strong>Triệu chứng:</strong> Cây vàng lá từ từ, sinh trưởng kém, lá rụng dần rồi chết. Rễ có các nốt sần do tuyến trùng. <strong>Phòng trừ:</strong> Bón nhiều phân hữu cơ. Sử dụng các chế phẩm sinh học để kiểm soát tuyến trùng. Luân canh cây trồng khi trồng mới.</p>"
          },
          {
            "id": "pepper-c3l2",
            "title": "Bệnh thán thư và tuyến trùng",
            "content": "<h3>Bệnh thán thư (do nấm Colletotrichum):</h3><p>Gây hại trên lá, gié hoa và quả, tạo thành các đốm cháy màu nâu đen. Bệnh phát triển mạnh khi thời tiết ẩm ướt. <strong>Phòng trừ:</strong> Tỉa cành thông thoáng, phun các loại thuốc gốc đồng hoặc Hexaconazole khi bệnh chớm xuất hiện.</p><h3>Tuyến trùng hại rễ:</h3><p>Là sinh vật rất nhỏ sống trong đất, chích hút rễ tạo thành các khối u sần, mở đường cho nấm bệnh xâm nhập. <strong>Phòng trừ:</strong> Tăng cường bón phân hữu cơ để cải tạo đất. Sử dụng các loại thuốc trừ tuyến trùng sinh học hoặc hóa học khi mật độ cao.</p>"
          },
          {
            "id": "pepper-c3l3",
            "title": "Biện pháp phòng trừ tổng hợp",
            "content": "<h3>Canh tác là gốc:</h3><p>Áp dụng các biện pháp canh tác bền vững là cách phòng bệnh hiệu quả nhất. Bao gồm: chọn giống khỏe, mật độ hợp lý, thoát nước tốt, bón phân cân đối, tăng cường hữu cơ.</p><h3>Sử dụng biện pháp sinh học:</h3><p>Bảo vệ các loài thiên địch. Sử dụng các chế phẩm sinh học như nấm đối kháng Trichoderma, Paecilomyces để kiểm soát mầm bệnh trong đất.</p><h3>Sử dụng thuốc hóa học theo nguyên tắc:</h3><p>Chỉ dùng thuốc khi thật sự cần thiết, ưu tiên thuốc sinh học. Tuân thủ nghiêm ngặt nguyên tắc '4 đúng' và ghi chép nhật ký sử dụng thuốc theo yêu cầu của VietGAP.</p>"
          }
        ]
      },
      {
        "title": "Chương 4: Thu hoạch và Bảo quản",
        "lessons": [
          {
            "id": "pepper-c4l1",
            "title": "Xác định thời điểm thu hoạch",
            "content": "<h3>Dấu hiệu thu hoạch:</h3><p>Thu hoạch khi trên gié tiêu có khoảng 5-10% số quả chuyển sang màu vàng hoặc đỏ. Đây là lúc hạt đã chắc, đạt trọng lượng và hàm lượng piperine (chất tạo vị cay) cao nhất.</p><p>Không nên thu hoạch khi quả còn quá xanh (hạt lép, không thơm) hoặc quá chín (dễ rụng, khó bảo quản).</p>"
          },
          {
            "id": "pepper-c4l2",
            "title": "Kỹ thuật thu hái và sơ chế",
            "content": "<h3>Thu hái:</h3><p>Dùng thang và hái bằng tay toàn bộ gié tiêu, tránh làm gãy cành hoặc tuốt mạnh làm tổn thương dây. Nên thu hoạch vào ngày nắng ráo.</p><h3>Sơ chế:</h3><p>Tiêu sau khi hái về cần được tuốt hạt ra khỏi gié. Có thể tuốt bằng tay hoặc bằng máy. Loại bỏ các tạp chất như lá, cành trước khi đem phơi.</p>"
          },
          {
            "id": "pepper-c4l3",
            "title": "Bảo quản tiêu đen và tiêu sọ",
            "content": "<h3>Chế biến tiêu đen:</h3><p>Hạt tiêu sau khi tuốt được đem phơi trực tiếp dưới nắng trên sân gạch, xi măng hoặc bạt sạch. Phơi liên tục 3-5 ngày, đảo đều cho đến khi vỏ ngoài săn lại, chuyển màu đen và độ ẩm còn khoảng 12-13%.</p><h3>Chế biến tiêu sọ (tiêu trắng):</h3><p>Hạt tiêu chín được ngâm trong nước 7-10 ngày để vỏ mềm ra, sau đó chà xát để loại bỏ vỏ. Phần sọ bên trong được rửa sạch và đem phơi khô. Tiêu sọ có giá trị cao hơn nhưng quy trình phức tạp hơn.</p><h3>Bảo quản:</h3><p>Tiêu khô sau khi làm sạch được đóng vào bao hai lớp (lớp trong là nilon) và bảo quản nơi khô ráo, thoáng mát, tránh ánh sáng trực tiếp để giữ được hương vị lâu dài.</p>"
          }
        ]
      }
    ]
  },
  "dragonfruit-course-v1": {
    "title": "Kỹ thuật trồng Thanh long ruột đỏ xuất khẩu",
    "meta": {
      "expert": "Chuyên gia Nguyễn Văn Thành",
      "field": "Cây ăn quả",
      "duration": "8 giờ"
    },
    "image": "https://images.unsplash.com/photo-1617124694534-17ec933e4555?q=80&w=2070&auto=format&fit=crop",
    "imageAlt": "Thanh long ruột đỏ trên cây",
    "sapo": "Hướng dẫn chi tiết kỹ thuật trồng và chăm sóc thanh long ruột đỏ theo tiêu chuẩn GlobalGAP, đặc biệt là kỹ thuật xử lý ra hoa trái vụ.",
    "quizUrl": null,
    "chapters": [
      {
        "title": "Chương 1: Thiết lập vườn trồng",
        "lessons": [
          {
            "id": "dragonfruit-c1l1",
            "title": "Chọn giống và chuẩn bị trụ",
            "content": "<h3>Chọn giống:</h3><p>Giống thanh long ruột đỏ phổ biến và được ưa chuộng cho xuất khẩu nhất hiện nay là <strong>LD1 (Long Định 1)</strong>. Giống này có ưu điểm vỏ quả đỏ tươi, tai quả xanh và cứng, ruột đỏ đậm, vị ngọt hài hòa và thời gian bảo quản lâu hơn các giống khác.</p><p>Hom giống phải được chọn từ những cành khỏe mạnh (tuổi từ 1-2 năm), sạch bệnh, có màu xanh đậm. Hom nên có chiều dài từ 40-50 cm.</p><h3>Chuẩn bị trụ:</h3><p>Trụ bê tông là lựa chọn tối ưu cho canh tác xuất khẩu vì độ bền và dễ quản lý. Kích thước trụ khuyến cáo là 15x15 cm, cao khoảng 2.2 - 2.5 m (phần chôn dưới đất 0.5-0.7m). Phía trên đỉnh trụ cần có 4 cọng sắt chờ để làm giá đỡ cho bộ tán sau này.</p><p>Mật độ trồng phổ biến là khoảng 1.000 - 1.100 trụ/ha.</p>"
          },
          {
            "id": "dragonfruit-c1l2",
            "title": "Kỹ thuật trồng và tạo tán",
            "content": "<h3>Kỹ thuật trồng:</h3><p>Sau khi chuẩn bị hố và bón lót (phân chuồng, lân, vôi), đặt hom giống vào. Mỗi trụ trồng 3-4 hom, đặt áp sát mặt hom vào trụ. Lấp đất và tưới đẫm nước. Dùng dây vải mềm buộc cố định cành vào trụ để giúp cành leo lên.</p><h3>Tạo tán ban đầu:</h3><p>Khi cành thanh long leo đến đỉnh trụ, tiến hành bấm ngọn để cây phân nhánh. Chỉ giữ lại những cành khỏe mạnh, mọc tỏa đều ra các hướng. Các cành này sẽ tạo thành bộ tán chính cho cây. Sau đó, để cành phát triển tự do và rủ xuống. Đây là những cành sẽ mang quả. Việc tạo một bộ tán thông thoáng ngay từ đầu giúp cây quang hợp tốt và dễ dàng quản lý sâu bệnh.</p>"
          },
          {
            "id": "dragonfruit-c1l3",
            "title": "Hệ thống tưới và chiếu sáng",
            "content": "<h3>Hệ thống tưới tiết kiệm:</h3><p>Canh tác theo tiêu chuẩn xuất khẩu đòi hỏi phải tiết kiệm nước. Hệ thống <strong>tưới nhỏ giọt</strong> hoặc <strong>phun mưa tại gốc</strong> là lựa chọn hàng đầu. Hệ thống này cung cấp nước và dinh dưỡng (khi cần) trực tiếp đến vùng rễ, tránh lãng phí và hạn chế cỏ dại.</p><h3>Hệ thống chiếu sáng (chong đèn):</h3><p>Đây là yếu tố then chốt để xử lý ra hoa trái vụ. Hệ thống bao gồm:</p><ul><li><strong>Bóng đèn:</strong> Sử dụng bóng đèn compact công suất 20-25W, loại ánh sáng vàng hoặc trắng.</li><li><strong>Lắp đặt:</strong> Mỗi trụ được lắp một bóng đèn, treo ở độ cao khoảng 0.8 - 1.2 m so với ngọn trụ, đảm bảo ánh sáng tỏa đều lên các cành già.</li><li><strong>Dây điện:</strong> Phải sử dụng dây có vỏ bọc tốt, đảm bảo an toàn tuyệt đối trong điều kiện ngoài trời.</li></ul>"
          }
        ]
      },
      {
        "title": "Chương 2: Chăm sóc cây",
        "lessons": [
          {
            "id": "dragonfruit-c2l1",
            "title": "Bón phân và quản lý dinh dưỡng",
            "content": "<h3>Nguyên tắc:</h3><p>Bón phân cân đối, tăng cường hữu cơ. Ghi chép nhật ký bón phân là yêu cầu bắt buộc của VietGAP.</p><h3>Lịch trình bón phân tham khảo:</h3><ul><li><strong>Sau thu hoạch:</strong> Bón nhiều phân hữu cơ (15-20 kg/trụ) kết hợp NPK có hàm lượng đạm cao để cây phục hồi.</li><li><strong>Trước khi chong đèn:</strong> Bón NPK có hàm lượng lân và kali cao (ví dụ: 15-30-15) để kích thích tạo mầm hoa.</li><li><strong>Giai đoạn nụ và hoa:</strong> Phun các loại phân bón lá chứa canxi, bo để tăng khả năng đậu quả, chống rụng hoa.</li><li><strong>Giai đoạn nuôi quả:</strong> Bón NPK có hàm lượng kali cao (ví dụ: 15-5-20) và bổ sung canxi, magie để giúp quả to, chắc, vỏ bóng đẹp và ngọt.</li></ul>"
          },
          {
            "id": "dragonfruit-c2l2",
            "title": "Tỉa cành, tạo tai quả đẹp",
            "content": "<h3>Tỉa cành:</h3><p>Tỉa cành là công việc thường xuyên. Cần loại bỏ:</p><ul><li>Các cành già, cành đã cho quả nhiều vụ.</li><li>Cành bị sâu bệnh, cành ốm yếu, cành mọc chen chúc trong tán.</li><li>Các chồi non mọc không đúng vị trí.</li></ul><p>Mục đích là để vườn cây luôn thông thoáng, tập trung dinh dưỡng nuôi cành mới khỏe mạnh.</p><h3>Tạo tai quả đẹp:</h3><p>Tai quả xanh, thẳng và dài là một tiêu chí quan trọng của hàng xuất khẩu. Để làm được điều này, cần phun các chất điều hòa sinh trưởng (như GA3) và phân bón lá có chứa vi lượng vào giai đoạn quả non. Đồng thời, đảm bảo cung cấp đủ nước và dinh dưỡng cho cây.</p>"
          },
          {
            "id": "dragonfruit-c2l3",
            "title": "Phòng trừ sâu bệnh thường gặp",
            "content": "<h3>Các bệnh chính:</h3><ul><li><strong>Bệnh đốm nâu (thán thư):</strong> Gây ra các đốm nâu tròn trên cành và quả. Phòng trừ bằng cách tỉa cành thông thoáng, phun các loại thuốc gốc đồng hoặc Mancozeb, Azoxystrobin.</li><li><strong>Bệnh thối đầu cành:</strong> Do nấm gây ra khi thời tiết ẩm ướt, làm đầu cành non bị thối nhũn. Cần cắt bỏ phần bị bệnh và phun thuốc phòng trừ.</li><li><strong>Bệnh vàng cành:</strong> Thường do nấm hoặc thiếu dinh dưỡng. Cần xác định đúng nguyên nhân để xử lý.</li></ul><h3>Sâu hại:</h3><p>Kiến và ruồi đục quả là hai đối tượng chính. Dùng bẫy Pheromone để dẫn dụ ruồi đục quả. Quản lý kiến để hạn chế rệp sáp. Áp dụng các biện pháp IPM, ưu tiên các loại thuốc sinh học.</p>"
          }
        ]
      },
      {
        "title": "Chương 3: Xử lý ra hoa",
        "lessons": [
          {
            "id": "dragonfruit-c3l1",
            "title": "Nguyên lý xử lý ra hoa trái vụ",
            "content": "<h3>Tại sao cây thanh long ra hoa?</h3><p>Thanh long là cây ngày dài. Trong điều kiện tự nhiên, cây chỉ ra hoa khi có đủ số giờ chiếu sáng trong ngày (thường là vào mùa hè, từ tháng 5 đến tháng 10). Vào mùa đông, ngày ngắn, cây sẽ ở trạng thái 'ngủ' và không ra hoa.</p><h3>Nguyên lý chong đèn:</h3><p>Việc 'chong đèn' vào ban đêm là một cách 'đánh lừa' cây, làm cho cây tưởng rằng ngày đang dài ra. Khi tổng thời gian có ánh sáng (ánh sáng tự nhiên + ánh sáng đèn) đủ dài, cây sẽ phá vỡ trạng thái ngủ nghỉ và bắt đầu quá trình phân hóa mầm hoa. Đây chính là chìa khóa để sản xuất thanh long trái vụ.</p>"
          },
          {
            "id": "dragonfruit-c3l2",
            "title": "Kỹ thuật chong đèn",
            "content": "<h3>Thời điểm và thời lượng:</h3><p>Bắt đầu chong đèn khi cành đã đủ già (màu xanh đậm, cứng cáp). Thời gian chong đèn kéo dài từ 10-20 đêm, mỗi đêm chong khoảng 7-10 tiếng (từ 7h tối đến 5h sáng hôm sau). Tổng thời gian chong đèn phụ thuộc vào tuổi cành và thời tiết (trời càng lạnh, càng cần chong đèn lâu hơn).</p><h3>Dấu hiệu nhận biết:</h3><p>Sau khoảng 7-10 ngày chong đèn, trên cành sẽ xuất hiện các nụ hoa nhỏ như hạt đậu xanh. Khi thấy nụ đã ra đều, có thể ngừng chong đèn để tiết kiệm chi phí.</p>"
          },
          {
            "id": "dragonfruit-c3l3",
            "title": "Dinh dưỡng cho giai đoạn nuôi quả",
            "content": "<h3>Tỉa nụ và tuyển quả:</h3><p>Sau khi hoa nở và đậu quả, cần tiến hành tỉa bớt. Mỗi cành chỉ nên giữ lại 1-2 quả ở vị trí tốt nhất (quả tròn đều, không bị sâu bệnh). Việc này giúp cây tập trung dinh dưỡng để nuôi quả to, đồng đều.</p><h3>Dinh dưỡng:</h3><p>Đây là giai đoạn cây cần nhiều dinh dưỡng nhất. Cần tăng cường bón phân có hàm lượng Kali cao để giúp quả ngọt và chắc. Bổ sung Canxi và Magie qua lá để giúp vỏ quả cứng, bóng đẹp và hạn chế nứt quả. Luôn đảm bảo cung cấp đủ nước cho cây trong suốt quá trình nuôi quả.</p>"
          }
        ]
      },
      {
        "title": "Chương 4: Thu hoạch và sau thu hoạch",
        "lessons": [
          {
            "id": "dragonfruit-c4l1",
            "title": "Thu hoạch đúng thời điểm",
            "content": "<h3>Xác định độ chín:</h3><p>Thu hoạch khi quả chuyển sang màu đỏ tươi hoàn toàn (khoảng 28-32 ngày sau khi hoa nở). Một dấu hiệu quan trọng khác là các tai quả bắt đầu mềm nhẹ và chuyển màu từ xanh sang hơi vàng ở chóp. Thu hoạch quá sớm quả sẽ chua, vỏ không đẹp. Thu hoạch quá muộn quả dễ bị nứt và khó bảo quản.</p><h3>Kỹ thuật hái:</h3><p>Dùng kéo sắc hoặc dao cắt cuống quả, chừa lại một đoạn cuống dài khoảng 1.5-2 cm. Hái nhẹ nhàng, tránh làm trầy xước vỏ quả. Nên thu hoạch vào buổi sáng sớm hoặc chiều mát để quả không bị sốc nhiệt.</p>"
          },
          {
            "id": "dragonfruit-c4l2",
            "title": "Sơ chế và đóng gói",
            "content": "<h3>Quy trình sơ chế:</h3><ol><li><strong>Làm sạch:</strong> Dùng khăn mềm, ẩm lau sạch bụi bẩn trên bề mặt quả. Không rửa trực tiếp dưới vòi nước mạnh.</li><li><strong>Phân loại:</strong> Phân loại quả dựa trên kích thước, trọng lượng và mẫu mã. Loại bỏ tất cả những quả bị trầy xước, dập nát, hoặc có dấu hiệu sâu bệnh.</li><li><strong>Dán nhãn:</strong> Dán tem truy xuất nguồn gốc (nếu có) lên từng quả.</li></ol><h3>Đóng gói:</h3><p>Xếp quả vào thùng carton có lót giấy mềm hoặc mút xốp để tránh va đập. Mỗi quả thường được bọc trong một lớp lưới xốp. Thùng phải có lỗ thông hơi. Đóng gói theo đúng quy cách về trọng lượng và số lượng quả mỗi thùng theo yêu cầu của nhà nhập khẩu.</p>"
          },
          {
            "id": "dragonfruit-c4l3",
            "title": "Bảo quản và vận chuyển",
            "content": "<h3>Bảo quản lạnh:</h3><p>Sau khi đóng gói, cần nhanh chóng đưa quả vào kho lạnh. Nhiệt độ bảo quản tối ưu cho thanh long là <strong>5-8°C</strong> với độ ẩm <strong>90-95%</strong>. Ở điều kiện này, quả có thể được bảo quản tươi trong khoảng 20-25 ngày.</p><h3>Vận chuyển:</h3><p>Phải sử dụng xe tải hoặc container lạnh để vận chuyển, duy trì nhiệt độ ổn định trong suốt quá trình đi đến cảng hoặc nhà máy chế biến. Việc duy trì chuỗi lạnh không bị đứt gãy là yếu tố sống còn để đảm bảo chất lượng hàng xuất khẩu.</p>"
          }
        ]
      }
    ]
  },
  "pomelo-course-v1": {
    "title": "Trồng và chăm sóc Bưởi da xanh",
    "meta": {
      "expert": "KS. Phạm Thị Thu Hà",
      "field": "Cây ăn quả",
      "duration": "7 giờ"
    },
    "image": "https://images.unsplash.com/photo-1624334321948-cb28859e9c12?q=80&w=1974&auto=format&fit=crop",
    "imageAlt": "Những quả bưởi trên cây",
    "sapo": "Khóa học cung cấp kiến thức toàn diện về kỹ thuật trồng, chăm sóc, và phòng trừ sâu bệnh cho cây bưởi da xanh để đạt năng suất và chất lượng cao.",
    "quizUrl": null,
    "chapters": [
      {
        "title": "Chương 1: Chuẩn bị trồng",
        "lessons": [
          {
            "id": "pomelo-c1l1",
            "title": "Chọn đất và thiết kế vườn",
            "content": "<h3>Tiêu chí chọn đất:</h3><p>Bưởi da xanh không kén đất nhưng phát triển tốt nhất trên đất thịt pha cát, tơi xốp, giàu hữu cơ và có khả năng thoát nước tốt. Độ pH đất lý tưởng là từ 5.5 đến 6.5. Bà con nên lấy mẫu đất để kiểm tra pH, nếu đất quá chua (pH < 5.5) cần xử lý bằng vôi. Vườn trồng phải chủ động được nguồn nước tưới, đặc biệt là vào mùa khô.</p><h3>Thiết kế vườn:</h3><ul><li><strong>Lên liếp (Mô):</strong> Ở các vùng đất thấp như Đồng bằng sông Cửu Long, việc lên liếp là bắt buộc để rễ cây không bị ngập úng. Liếp nên rộng 6-8m, cao 0.5-0.8m so với mặt nước trong mương. Mương nước nên rộng ít nhất 1.5-2m để thoát nước tốt và trữ nước tưới.</li><li><strong>Mật độ trồng:</strong> Mật độ phổ biến là khoảng 250-400 cây/ha. Khoảng cách trồng thích hợp là 5m x 5m hoặc 6m x 5m. Trồng quá dày sẽ khiến vườn bị rậm rạp, khó kiểm soát sâu bệnh và cây cho năng suất kém ở các tầng lá thấp do thiếu ánh sáng.</li><li><strong>Trồng cây chắn gió:</strong> Nên trồng hàng cây như tràm, muồng đen hoặc tre xung quanh vườn để tạo thành vành đai bảo vệ. Việc này giúp giảm tác hại của gió mạnh, tránh gãy cành, rụng hoa và quả non.</li></ul>"
          },
          {
            "id": "pomelo-c1l2",
            "title": "Chọn giống và kỹ thuật trồng",
            "content": "<h3>Tiêu chuẩn chọn cây giống:</h3><p>Chất lượng cây giống quyết định sự thành công của cả vườn cây sau này. Cần chọn cây giống ghép có nguồn gốc rõ ràng, sạch bệnh. Cụ thể:</p><ul><li><strong>Gốc ghép:</strong> Phải là gốc bưởi Bung, bưởi Chua hoặc cam Sành để có bộ rễ khỏe, khả năng chống chịu bệnh thối gốc, thối rễ tốt.</li><li><strong>Cây giống:</strong> Chiều cao từ 60-80cm, đường kính gốc ghép từ 1.5-2cm. Mắt ghép đã liền sẹo tốt, chồi ghép đã mọc khỏe, lá xanh tốt, không có dấu hiệu vàng lá, xoăn lá hoặc các đốm bệnh.</li></ul><h3>Thời vụ và kỹ thuật trồng:</h3><p>Thời vụ trồng tốt nhất là vào đầu mùa mưa (tháng 5-6) để tiết kiệm công tưới và cây có tỷ lệ sống cao. Các bước trồng như sau:</p><ol><li>Đào hố trồng kích thước 60x60x60 cm. Tách riêng lớp đất mặt.</li><li>Bón lót: Trộn lớp đất mặt với 15-20kg phân chuồng hoai mục + 0.5kg lân + 0.5kg vôi. Lấp hỗn hợp này xuống hố trước khi trồng ít nhất 1 tháng để phân và vôi có thời gian phân rã.</li><li>Khi trồng, xé bỏ vỏ bầu, nhẹ nhàng đặt cây con vào giữa hố sao cho mặt bầu cao hơn mặt đất xung quanh 5-10cm (trồng nổi để tránh bệnh thối cổ rễ). Lấp đất và nén nhẹ.</li><li>Cắm 2-3 cọc chéo nhau để cố định cây, tránh bị gió lung lay làm đứt rễ non. Tưới đẫm nước và tủ gốc bằng rơm rạ, cách gốc 10cm.</li></ol>"
          },
          {
            "id": "pomelo-c1l3",
            "title": "Bón lót và hệ thống tưới",
            "content": "<h3>Tầm quan trọng của bón lót:</h3><p>Bón lót không chỉ cung cấp dinh dưỡng ban đầu mà còn cải tạo cấu trúc vật lý và hóa học của đất. Phân chuồng cung cấp mùn giúp đất tơi xốp. Lân giúp kích thích bộ rễ phát triển mạnh ngay từ đầu. Vôi giúp ổn định pH đất và khử các mầm bệnh có sẵn.</p><h3>Hệ thống tưới hiệu quả:</h3><p>Để đảm bảo năng suất và chất lượng, vườn bưởi cần được cung cấp nước đầy đủ, đặc biệt là vào mùa khô và giai đoạn nuôi quả. Các hệ thống tưới được khuyến khích:</p><ul><li><strong>Tưới phun mưa tại gốc:</strong> Sử dụng béc tưới có bán kính nhỏ, tập trung nước vào vùng rễ, tiết kiệm nước và chi phí vận hành. Đây là phương pháp phổ biến và cân bằng giữa hiệu quả và chi phí.</li><li><strong>Tưới nhỏ giọt:</strong> Là phương pháp hiện đại và tiết kiệm nhất (tiết kiệm đến 60% nước). Hệ thống này cho phép kết hợp bón phân qua hệ thống tưới (fertigation), cung cấp dinh dưỡng trực tiếp và thường xuyên cho cây, giúp tiết kiệm tối đa nước và phân bón. Tuy nhiên, chi phí đầu tư ban đầu cao hơn.</li></ul>"
          }
        ]
      },
      {
        "title": "Chương 2: Chăm sóc cây non",
        "lessons": [
          {
            "id": "pomelo-c2l1",
            "title": "Tưới nước và quản lý cỏ dại",
            "content": "<h3>Tưới nước giai đoạn kiến thiết:</h3><p>Trong 1-2 năm đầu, bộ rễ của cây còn yếu và ăn nông, do đó cần được tưới nước thường xuyên để bộ rễ phát triển tốt. Vào mùa khô, cần duy trì độ ẩm đất ổn định bằng cách tưới 2-3 lần/tuần, tránh để đất quá khô hoặc quá ẩm gây sốc cho cây.</p><h3>Quản lý cỏ dại bền vững:</h3><p>Hạn chế sử dụng thuốc trừ cỏ hóa học vì có thể làm chai đất và ảnh hưởng rễ cây. Thay vào đó, áp dụng các biện pháp:</p><ul><li><strong>Làm cỏ thủ công:</strong> Dùng máy cắt cỏ thường xuyên, giữ thảm cỏ thấp trong vườn. Chỉ làm cỏ sạch quanh gốc (cách gốc 0.5-1m).</li><li><strong>Tủ gốc:</strong> Dùng rơm rạ, cỏ khô, màng phủ nông nghiệp để phủ quanh gốc. Việc này không chỉ ngăn cỏ dại mà còn giữ ẩm, điều hòa nhiệt độ đất và bổ sung chất hữu cơ khi phân hủy.</li><li><strong>Trồng cây che phủ:</strong> Trồng các loại cây họ đậu như lạc dại trong vườn. Cây che phủ giúp che phủ đất, cải tạo đất (cố định đạm), và hạn chế cỏ dại cạnh tranh.</li></ul>"
          },
          {
            "id": "pomelo-c2l2",
            "title": "Bón phân định kỳ",
            "content": "<h3>Giai đoạn kiến thiết cơ bản (1-3 năm):</h3><p>Giai đoạn này cây cần nhiều đạm (N) và lân (P) để phát triển thân, cành, lá và bộ rễ. Có thể sử dụng phân NPK có tỷ lệ N và P cao như 20-20-15 hoặc 16-16-8.</p><ul><li><strong>Năm 1:</strong> Bón khoảng 1kg NPK/cây/năm, chia làm 4-5 lần bón, thường bón vào các đợt cây ra đọt non.</li><li><strong>Năm 2-3:</strong> Tăng lượng phân lên 2-3kg NPK/cây/năm, cũng chia làm 4-5 lần.</li></ul><p>Cách bón: Đào rãnh nông xung quanh tán lá, rải phân và lấp đất lại, sau đó tưới nước. Kết hợp bón bổ sung 5-10kg phân hữu cơ hoai mục cho mỗi gốc vào cuối mùa mưa hàng năm.</p>"
          },
          {
            "id": "pomelo-c2l3",
            "title": "Tạo tán và tỉa cành",
            "content": "<h3>Mục đích:</h3><p>Tạo cho cây có một bộ khung tán khỏe mạnh, cân đối, dạng 'hình dù' mở rộng. Một bộ tán đẹp sẽ giúp cây quang hợp tốt, dễ chăm sóc, hạn chế sâu bệnh và cho năng suất cao, ổn định sau này.</p><h3>Kỹ thuật tạo tán:</h3><ul><li><strong>Hãm ngọn:</strong> Khi cây cao khoảng 0.8-1m, bấm đọt ngọn chính để cây phân cành.</li><li><strong>Tạo cành cấp 1:</strong> Chọn giữ lại 3-4 cành khỏe mạnh, mọc từ thân chính và tỏa đều các hướng. Đây sẽ là các cành khung chính của cây.</li><li><strong>Tạo cành cấp 2, 3:</strong> Từ mỗi cành cấp 1, tiếp tục chọn 2-3 cành cấp 2. Thực hiện tương tự để tạo cành cấp 3.</li></ul><p>Trong quá trình này, thường xuyên loại bỏ các cành tăm (cành nhỏ, yếu), cành vượt (mọc thẳng đứng), cành mọc yếu, cành bị sâu bệnh để cây thông thoáng và tập trung dinh dưỡng.</p>"
          }
        ]
      },
      {
        "title": "Chương 3: Giai đoạn kinh doanh",
        "lessons": [
          {
            "id": "pomelo-c3l1",
            "title": "Xử lý ra hoa, đậu quả",
            "content": "<h3>Kích thích ra hoa:</h3><p>Sau khi thu hoạch, bà con cần tỉa cành, bón phân phục hồi cho cây. Sau đó, có thể áp dụng biện pháp 'xiết nước' (ngưng tưới khoảng 2-3 tuần) để tạo khô hạn, giúp cây phân hóa mầm hoa. Khi thấy lá hơi héo và chồi ngọn có dấu hiệu nhú mầm hoa, tiến hành tưới đẫm trở lại, cây sẽ ra hoa đồng loạt.</p><h3>Tăng đậu quả:</h3><p>Giai đoạn hoa nở rất quan trọng. Để tăng tỷ lệ đậu quả, bà con cần:</p><ul><li><strong>Cung cấp đủ nước:</strong> Giữ ẩm đất ổn định, tránh để đất khô hoặc ngập úng.</li><li><strong>Phun phân bón lá:</strong> Phun các loại phân bón lá chứa Bo, Kẽm, Canxi để tăng sức sống hạt phấn, giúp quá trình thụ phấn diễn ra tốt hơn, chống rụng hoa và quả non.</li><li><strong>Hỗ trợ thụ phấn:</strong> Có thể nuôi ong trong vườn để hỗ trợ thụ phấn chéo, giúp quả đậu nhiều và đều hơn.</li></ul>"
          },
          {
            "id": "pomelo-c3l2",
            "title": "Phòng trừ sâu bệnh hại chính",
            "content": "<h3>Các đối tượng chính và cách quản lý:</h3><ul><li><strong>Sâu vẽ bùa:</strong> Gây hại trên lá non, làm lá xoăn lại, tạo điều kiện cho bệnh loét xâm nhập. Phòng trừ bằng cách phun các loại thuốc gốc Abamectin, Imidacloprid khi cây ra đọt non.</li><li><strong>Nhện đỏ, nhện vàng:</strong> Chích hút làm lá và vỏ quả bị vàng, sần sùi (da cám), làm mất giá trị thương phẩm. Thường xuyên kiểm tra và phun các loại thuốc đặc trị nhện (ví dụ gốc Propargite, Fenpyroximate) khi mật độ cao.</li><li><strong>Sâu đục trái:</strong> Sâu non đục vào quả gây thối rụng. Biện pháp hiệu quả và an toàn nhất là thực hiện bao trái từ khi quả còn nhỏ (bằng nắm tay).</li><li><strong>Bệnh vàng lá Greening:</strong> Bệnh nguy hiểm nhất do vi khuẩn gây ra và rầy chổng cánh làm vector truyền bệnh. Biện pháp duy nhất là phòng bệnh: trồng giống sạch bệnh, quản lý tốt rầy chổng cánh bằng cách phun thuốc định kỳ khi cây ra đọt non. Nhổ bỏ và tiêu hủy ngay những cây có biểu hiện bệnh.</li><li><strong>Bệnh loét, ghẻ, thối gốc:</strong> Do nấm và vi khuẩn. Phòng trừ bằng cách giữ vườn thông thoáng, thoát nước tốt, tỉa cành tạo tán hợp lý và phun các loại thuốc gốc đồng hoặc kháng sinh nông nghiệp khi cần thiết.</li></ul>"
          },
          {
            "id": "pomelo-c3l3",
            "title": "Dinh dưỡng nuôi quả",
            "content": "<h3>Bón phân nuôi quả theo từng giai đoạn:</h3><p>Giai đoạn nuôi quả kéo dài nhiều tháng và có nhu cầu dinh dưỡng khác nhau:</p><ul><li><strong>Sau khi đậu quả đến khi quả ổn định:</strong> Bón phân có hàm lượng Đạm, Lân, Kali cân bằng (ví dụ NPK 20-20-15) để giúp quả lớn nhanh.</li><li><strong>Giai đoạn quả phát triển và tích lũy chất khô:</strong> Tập trung vào Kali (K) để giúp quả to, ngọt và mọng nước. Sử dụng các loại NPK có hàm lượng Kali cao như 12-12-17, 15-5-20.</li></ul><h3>Bón bổ sung qua lá:</h3><p>Phun định kỳ phân bón lá chứa các trung, vi lượng thiết yếu như Canxi, Bo, Magie. Canxi giúp vỏ quả cứng, hạn chế nứt. Bo giúp quả phát triển đều, không bị méo. Magie giúp lá xanh tốt, tăng khả năng quang hợp để nuôi quả. Luôn đảm bảo cung cấp đủ nước trong suốt quá trình mang quả.</p>"
          }
        ]
      },
      {
        "title": "Chương 4: Thu hoạch",
        "lessons": [
          {
            "id": "pomelo-c4l1",
            "title": "Nhận biết bưởi chín",
            "content": "<h3>Các dấu hiệu nhận biết độ chín:</h3><ul><li><strong>Màu sắc vỏ:</strong> Vỏ bưởi chuyển từ màu xanh đậm sang xanh vàng, bề mặt vỏ căng bóng, các túi tinh dầu nở to.</li><li><strong>Độ nảy của vỏ:</strong> Dùng ngón tay búng nhẹ vào quả, nếu có tiếng 'cạch cạch' đanh, chắc là bưởi đã đủ độ chín. Nếu tiếng 'bụp bụp' là quả còn non.</li><li><strong>Thời gian:</strong> Dựa vào việc ghi chép nhật ký, tính từ lúc đậu quả đến lúc thu hoạch khoảng 7-8 tháng. Đây là phương pháp chính xác và chuyên nghiệp.</li></ul><p>Không nên để bưởi quá chín trên cây vì quả sẽ bị khô (xốp), vị nhạt, làm giảm chất lượng và giá trị thương phẩm. Nên thu hoạch đúng độ chín để đảm bảo hương vị tốt nhất.</p>"
          },
          {
            "id": "pomelo-c4l2",
            "title": "Kỹ thuật thu hái",
            "content": "<h3>Nguyên tắc:</h3><p>'Nhẹ tay, không làm dập'. Vỏ bưởi chứa các túi tinh dầu, nếu các túi này bị dập vỡ, tinh dầu sẽ làm cháy vỏ quả, tạo vết thâm và làm quả nhanh hỏng.</p><h3>Dụng cụ và Cách thực hiện:</h3><p>Nên thu hoạch vào ngày trời râm mát, tránh thu hoạch sau cơn mưa hoặc lúc nắng gắt. Sử dụng kéo chuyên dụng, sắc bén để cắt sát cuống quả, không nên dùng tay vặn hoặc giật. Tránh làm rơi quả xuống đất. Quả sau khi hái cần được đặt nhẹ nhàng vào giỏ hoặc sọt có lót giấy mềm hoặc vải, không chất đống quá cao gây dập nát.</p>"
          },
          {
            "id": "pomelo-c4l3",
            "title": "Bảo quản sau thu hoạch",
            "content": "<h3>Xử lý trước khi bảo quản ('Để bưởi xuống đường'):</h3><p>Sau khi thu hoạch, không nên ăn ngay. Cần để bưởi ở nơi khô ráo, thoáng mát trong khoảng 10-15 ngày. Quá trình này giúp vỏ bưởi héo đi một chút, lượng nước trong quả giảm, làm tăng nồng độ đường và các axit hữu cơ chuyển hóa, giúp bưởi ăn ngọt và đậm vị hơn. Dùng khăn sạch lau khô bề mặt vỏ quả và có thể dùng vôi ăn trầu bôi vào cuống quả để ngăn nấm bệnh xâm nhập.</p><h3>Phương pháp bảo quản:</h3><p>Để bưởi ở nơi thoáng mát, trên kệ hoặc sàn nhà có lót giấy hoặc cát khô. Có thể bảo quản được từ 1 đến 2 tháng. Nếu có kho lạnh, bảo quản ở nhiệt độ 10-12°C với độ ẩm 85-90% sẽ giữ được bưởi tươi lâu hơn, lên đến 3-4 tháng.</p>"
          }
        ]
      }
    ]
  },
  "durian-course-v1": {
    "title": "Kỹ thuật canh tác Sầu riêng Monthong & Ri6",
    "meta": {
      "expert": "ThS. Hoàng Minh Đức",
      "field": "Cây ăn quả",
      "duration": "12 giờ"
    },
    "image": "https://images.unsplash.com/photo-1608783459362-34d1d91b5a2f?q=80&w=1964&auto=format&fit=crop",
    "imageAlt": "Quả sầu riêng trên cây",
    "sapo": "Làm chủ kỹ thuật trồng và chăm sóc sầu riêng, từ khâu chọn giống, xử lý ra hoa đến phòng trừ bệnh xì mủ, thán thư để tối đa hóa lợi nhuận.",
    "quizUrl": null,
    "chapters": [
      {
        "title": "Chương 1: Kiến thức cơ bản",
        "lessons": [
          {
            "id": "durian-c1l1",
            "title": "Đặc điểm sinh thái cây sầu riêng",
            "content": "<h3>Yêu cầu về khí hậu:</h3><p>Sầu riêng là cây nhiệt đới điển hình, ưa khí hậu nóng ẩm, mưa nhiều. Nhiệt độ thích hợp nhất cho cây sinh trưởng là từ 24-32°C. Cây không chịu được sương giá và gió mạnh (cành giòn, dễ gãy).</p><h3>Yêu cầu về đất đai:</h3><p>Đây là yếu tố quan trọng nhất. Sầu riêng yêu cầu đất phải:</p><ul><li><strong>Tầng canh tác dày:</strong> Bộ rễ cần không gian để phát triển sâu, do đó tầng đất phải dày ít nhất 1m.</li><li><strong>Thoát nước cực tốt:</strong> Cây sầu riêng cực kỳ ghét úng nước. Vườn bị đọng nước vào mùa mưa chắc chắn sẽ bị bệnh thối rễ, xì mủ. Đất dốc nhẹ là một lợi thế.</li><li><strong>Giàu hữu cơ:</strong> Đất tơi xốp, giàu mùn sẽ giúp bộ rễ phát triển khỏe mạnh, tăng khả năng chống chịu sâu bệnh.</li></ul>"
          },
          {
            "id": "durian-c1l2",
            "title": "So sánh giống Monthong và Ri6",
            "content": "<h3>Giống Ri6:</h3><p>Là giống sầu riêng của Việt Nam, được trồng rất phổ biến. <strong>Đặc điểm:</strong> Trái hình tròn hoặc bầu dục, cơm màu vàng đậm, hạt lép, vị ngọt đậm và béo, mùi thơm nồng đặc trưng. <strong>Ưu điểm:</strong> Dễ trồng, thích nghi tốt, được thị trường nội địa ưa chuộng.</p><h3>Giống Monthong (Gối Vàng):</h3><p>Là giống của Thái Lan, được mệnh danh là 'vua' của sầu riêng xuất khẩu. <strong>Đặc điểm:</strong> Trái to, dài, có hình dạng giống quả bí ngô. Cơm rất dày, màu vàng nhạt, vị ngọt thanh, béo ngậy, gần như không có xơ, và mùi thơm nhẹ hơn Ri6. <strong>Ưu điểm:</strong> Năng suất cao, thời gian bảo quản sau thu hoạch dài, đáp ứng tốt tiêu chuẩn xuất khẩu.</p><h3>Lựa chọn:</h3><p>Việc chọn giống phụ thuộc vào thị trường mục tiêu. Nếu hướng đến xuất khẩu, Monthong là lựa chọn hàng đầu. Nếu tập trung vào thị trường nội địa, Ri6 vẫn là một giống rất tốt và dễ canh tác hơn.</p>"
          },
          {
            "id": "durian-c1l3",
            "title": "Thiết kế vườn và hệ thống tưới",
            "content": "<h3>Thiết kế vườn:</h3><p>Ở những vùng đất bằng phẳng, bắt buộc phải lên mô (liếp) cao từ 0.8-1.2m để đảm bảo thoát nước tốt. Mật độ trồng sầu riêng phải thưa để cây có đủ không gian và ánh sáng, khoảng cách phổ biến là 8m x 10m hoặc 10m x 10m (khoảng 100-125 cây/ha). Cần thiết kế hệ thống mương rãnh để thoát nước hiệu quả vào mùa mưa.</p><h3>Hệ thống tưới:</h3><p>Đầu tư hệ thống tưới tự động ngay từ đầu là một quyết định khôn ngoan. Hệ thống tưới phun mưa tại gốc hoặc tưới nhỏ giọt là phù hợp nhất, giúp cung cấp nước đều, tiết kiệm nước và có thể kết hợp bón phân qua hệ thống tưới một cách dễ dàng.</p>"
          }
        ]
      },
      {
        "title": "Chương 2: Chăm sóc kiến thiết",
        "lessons": [
          {
            "id": "durian-c2l1",
            "title": "Kỹ thuật trồng và chăm sóc cây con",
            "content": "<h3>Kỹ thuật trồng:</h3><p>Sau khi chuẩn bị mô và bón lót, đặt cây giống vào hố, lấp đất và tưới đẫm. Cần che nắng cho cây con trong vài tháng đầu để cây không bị sốc nhiệt và cháy lá. Che chắn kỹ vào mùa khô và thoát nước tốt vào mùa mưa là hai yếu tố sống còn cho cây con.</p><h3>Chăm sóc:</h3><p>Giai đoạn này (1-3 năm đầu) cần giữ ẩm đất liên tục nhưng không được úng. Bón phân định kỳ (2-3 tháng/lần) với các loại phân NPK có hàm lượng đạm và lân cao để thúc đẩy phát triển thân lá và rễ.</p>"
          },
          {
            "id": "durian-c2l2",
            "title": "Tạo tán, tỉa cành giai đoạn nhỏ",
            "content": "<h3>Mục đích:</h3><p>Tạo một bộ khung tán khỏe mạnh, cân đối và thông thoáng. Việc này quyết định khả năng mang trái của cây sau này.</p><h3>Kỹ thuật:</h3><ul><li>Để lại một thân chính duy nhất.</li><li>Khi cây cao khoảng 1m, bắt đầu chọn các cành cấp 1. Cành cấp 1 đầu tiên nên cách mặt đất ít nhất 0.8m.</li><li>Chọn giữ lại các cành khỏe mạnh, mọc theo các hướng khác nhau, cách nhau khoảng 20-30cm.</li><li>Thường xuyên tỉa bỏ các cành mọc yếu, cành mọc đứng, cành bị sâu bệnh và các chồi mọc từ gốc ghép.</li></ul>"
          },
          {
            "id": "durian-c2l3",
            "title": "Quản lý dinh dưỡng và cỏ dại",
            "content": "<h3>Dinh dưỡng:</h3><p>Trong 3 năm đầu, cây cần dinh dưỡng để sinh trưởng. Bón phân NPK kết hợp với phân hữu cơ hoai mục. Phun bổ sung phân bón lá chứa các vi lượng như Kẽm (Zn), Mangan (Mn), Sắt (Fe) để giúp lá xanh tốt, quang hợp mạnh.</p><h3>Quản lý cỏ dại:</h3><p>Làm sạch cỏ quanh gốc (đường kính 1.5-2m). Phần còn lại trong vườn có thể dùng máy cắt cỏ hoặc giữ thảm thực vật thấp để chống xói mòn và giữ ẩm. Hạn chế tối đa việc dùng thuốc trừ cỏ, đặc biệt là gần gốc cây con.</p>"
          }
        ]
      },
      {
        "title": "Chương 3: Xử lý ra hoa, đậu quả",
        "lessons": [
          {
            "id": "durian-c3l1",
            "title": "Tạo mầm hoa và xử lý ra hoa",
            "content": "<h3>Điều kiện cây sẵn sàng:</h3><p>Cây phải khỏe mạnh, đã ra ít nhất 2-3 cơi đọt hoàn chỉnh, lá già và dày.</p><h3>Kỹ thuật xử lý:</h3><ol><li><strong>Tạo khô hạn (xiết nước):</strong> Ngưng tưới nước trong khoảng 10-14 ngày để tạo stress cho cây.</li><li><strong>Phun tạo mầm:</strong> Sử dụng các sản phẩm tạo mầm hoa chuyên dụng chứa Lân (P) và Kali (K) cao (ví dụ MKP, NPK 10-60-10) phun lên lá.</li><li><strong>Tưới lại:</strong> Sau khi thấy mắt cua (mầm hoa) nhú ra rõ, tiến hành tưới nước đẫm trở lại để kích thích hoa nở đồng loạt.</li></ol>"
          },
          {
            "id": "durian-c3l2",
            "title": "Thụ phấn bổ sung và tỉa quả",
            "content": "<h3>Thụ phấn bổ sung:</h3><p>Hoa sầu riêng nở vào ban đêm và tỷ lệ thụ phấn tự nhiên khá thấp. Để tăng tỷ lệ đậu quả và giúp quả tròn đều, việc thụ phấn bổ sung là cực kỳ cần thiết. Vào khoảng 7-9h tối, dùng chổi lông mềm quét nhẹ lên nhị của hoa này để lấy phấn, sau đó quét lên đầu nhụy của hoa khác.</p><h3>Tỉa quả:</h3><p>Đây là kỹ thuật bắt buộc để có được những trái sầu riêng chất lượng. Tỉa bỏ những quả méo mó, quả bị sâu bệnh, quả nhỏ và những quả mọc quá chen chúc. Mỗi chùm chỉ nên giữ lại 1-2 quả khỏe mạnh nhất. Việc tỉa quả giúp cây tập trung dinh dưỡng, tạo ra những quả to, đều và chất lượng cao, đồng thời tránh làm gãy cành do mang quá nặng.</p>"
          },
          {
            "id": "durian-c3l3",
            "title": "Phòng trừ sâu bệnh giai đoạn mang trái",
            "content": "<h3>Các đối tượng nguy hiểm nhất:</h3><ul><li><strong>Sâu đục trái:</strong> Gây thiệt hại trực tiếp đến sản phẩm. Biện pháp hiệu quả nhất là bao trái hoặc phun các loại thuốc sinh học, hóa học được cấp phép và tuân thủ thời gian cách ly.</li><li><strong>Rệp sáp:</strong> Chích hút nhựa làm quả non rụng, quả lớn chậm phát triển và làm giảm mẫu mã.</li><li><strong>Bệnh thối trái do nấm Phytophthora:</strong> Bệnh phát triển mạnh vào mùa mưa, gây thối quả hàng loạt. Cần giữ vườn thông thoáng, thoát nước tốt, thu gom và tiêu hủy quả bệnh, phun thuốc phòng trừ khi áp lực bệnh cao.</li></ul>"
          }
        ]
      },
      {
        "title": "Chương 4: Phục hồi cây sau thu hoạch",
        "lessons": [
          {
            "id": "durian-c4l1",
            "title": "Kỹ thuật thu hoạch và bảo quản",
            "content": "<h3>Xác định độ chín:</h3><p>Dựa vào các dấu hiệu như gai nở đều, vỏ có màu sắc đặc trưng của giống, gõ vào quả nghe tiếng 'bộp bộp' và ngửi thấy mùi thơm. Quan trọng nhất là tính toán đúng số ngày từ khi hoa nở (thường từ 100-120 ngày tùy giống và điều kiện thời tiết).</p><h3>Thu hoạch:</h3><p>Phải cắt cả cuống, không để quả rụng tự nhiên (đặc biệt là Monthong) vì sẽ làm giảm chất lượng và thời gian bảo quản. Cắt nhẹ nhàng, tránh làm dập gai hoặc tổn thương quả.</p>"
          },
          {
            "id": "durian-c4l2",
            "title": "Tỉa cành và vệ sinh vườn",
            "content": "<h3>Tầm quan trọng:</h3><p>Đây là công việc quan trọng nhất sau khi thu hoạch. Cây đã dồn toàn bộ sức lực để nuôi quả và trở nên suy kiệt. Tỉa cành giúp loại bỏ gánh nặng, tạo điều kiện cho cây ra cơi đọt mới để chuẩn bị cho vụ sau.</p><h3>Các bước thực hiện:</h3><ul><li>Cắt bỏ toàn bộ cành đã cho quả, cành khô, cành sâu bệnh, cành mọc yếu trong tán.</li><li>Mở 'cửa sổ' cho tán cây, đảm bảo ánh sáng có thể lọt vào bên trong, giúp giảm sâu bệnh.</li><li>Thu gom toàn bộ cành lá, quả rụng ra khỏi vườn để tiêu hủy, cắt đứt nguồn bệnh.</li></ul>"
          },
          {
            "id": "durian-c4l3",
            "title": "Bón phân phục hồi cây",
            "content": "<h3>Mục tiêu:</h3><p>Bù đắp lại lượng dinh dưỡng khổng lồ mà cây đã sử dụng để nuôi quả, đồng thời kích thích cây ra cơi đọt mới đồng loạt và khỏe mạnh.</p><h3>Cách bón:</h3><ul><li><strong>Phân hữu cơ:</strong> Bón một lượng lớn phân hữu cơ (20-30kg/gốc) hoặc phân hữu cơ vi sinh. Đây là nền tảng để phục hồi sức khỏe của đất và bộ rễ.</li><li><strong>Phân hóa học:</strong> Bón NPK có hàm lượng đạm cao (ví dụ 30-20-10 hoặc 20-20-15) kết hợp với các sản phẩm kích rễ.</li><li><strong>Phun qua lá:</strong> Phun các loại phân bón lá chứa amino acid, rong biển và vi lượng để giúp cây hấp thu nhanh, nhanh chóng ra đọt mới.</li></ul><p>Một cơi đọt mới khỏe mạnh là tiền đề cho một vụ mùa bội thu tiếp theo.</p>"
          }
        ]
      }
    ]
  },
  "pig-farming-v1": {
    "title": "Chăn nuôi heo thịt an toàn sinh học",
    "meta": {
      "expert": "TS. Vũ Ngọc Sơn",
      "field": "Chăn nuôi",
      "duration": "10 giờ"
    },
    "image": "https://images.unsplash.com/photo-1516427132953-b54920d912a7?q=80&w=2070&auto=format&fit=crop",
    "imageAlt": "Đàn heo khỏe mạnh trong chuồng sạch",
    "sapo": "Hướng dẫn xây dựng quy trình chăn nuôi heo thịt khép kín, an toàn sinh học, phòng chống dịch tả heo châu Phi và các dịch bệnh nguy hiểm khác.",
    "quizUrl": null,
    "chapters": [
      {
        "title": "Chương 1: Chuồng trại và Giống",
        "lessons": [
          {
            "id": "pig-c1l1",
            "title": "Thiết kế chuồng trại hiện đại",
            "content": "<h3>Yêu cầu chung:</h3><p>Chuồng trại là hàng rào vật lý đầu tiên bảo vệ đàn heo. Thiết kế chuồng phải đảm bảo nguyên tắc 'cách ly', thông thoáng, dễ vệ sinh và phù hợp với từng giai đoạn phát triển của heo.</p><h3>Các mô hình chuồng trại:</h3><ul><li><strong>Chuồng kín:</strong> Là mô hình hiện đại, có hệ thống kiểm soát nhiệt độ, độ ẩm, ánh sáng tự động (dàn mát cooling pad, quạt hút). Giúp hạn chế tối đa ảnh hưởng của thời tiết và ngăn chặn mầm bệnh từ bên ngoài. Chi phí đầu tư cao nhưng hiệu quả phòng bệnh và năng suất vượt trội.</li><li><strong>Chuồng hở:</strong> Phổ biến ở quy mô nông hộ, có mái che và tường lửng. Cần đảm bảo thông thoáng tự nhiên, có bạt che để tránh mưa tạt, gió lùa. Phải có biện pháp chống nóng vào mùa hè (phun sương, quạt).</li></ul><h3>Các thành phần quan trọng:</h3><p><strong>Sàn chuồng:</strong> Có thể dùng sàn bê tông có độ dốc để dễ thoát nước hoặc sàn nhựa, sàn gang (dành cho heo con) để giữ ấm và vệ sinh. <strong>Hệ thống xử lý chất thải:</strong> Bắt buộc phải có hầm biogas hoặc hệ thống bể lắng để xử lý chất thải, tránh ô nhiễm môi trường và phát tán mầm bệnh.</p>"
          },
          {
            "id": "pig-c1l2",
            "title": "Lựa chọn giống heo siêu nạc",
            "content": "<h3>Tầm quan trọng của giống:</h3><p>Giống heo quyết định đến tốc độ tăng trưởng, tỷ lệ nạc, và hiệu quả chuyển hóa thức ăn (FCR). Giống tốt sẽ rút ngắn thời gian nuôi và tăng lợi nhuận.</p><h3>Các giống heo phổ biến:</h3><ul><li><strong>Landrace & Yorkshire:</strong> Là hai giống heo mẹ phổ biến, có khả năng sinh sản tốt, thân dài, nuôi con khéo.</li><li><strong>Duroc & Pietrain:</strong> Là các giống heo bố, có cơ bắp phát triển, tỷ lệ nạc rất cao, được dùng để tạo ra các tổ hợp heo lai thương phẩm.</li></ul><p><strong>Heo thương phẩm:</strong> Heo thịt nuôi trong các trang trại hiện nay thường là heo lai 3-4 máu (ví dụ: (Landrace x Yorkshire) x Duroc), kết hợp được ưu điểm của nhiều giống.</p><h3>Tiêu chí chọn heo con:</h3><p>Chọn những con nhanh nhẹn, da hồng hào, lông mượt, lưng thẳng, bụng thon gọn, không có dị tật. Heo phải có nguồn gốc rõ ràng từ các cơ sở giống uy tín, đã được tiêm phòng các loại vaccine cơ bản.</p>"
          },
          {
            "id": "pig-c1l3",
            "title": "Quy trình nhập heo và cách ly",
            "content": "<h3>Nguyên tắc vàng:</h3><p>Tuyệt đối không nhập heo không rõ nguồn gốc. Heo mới phải được nuôi ở khu cách ly riêng biệt, cuối hướng gió và cách xa khu chuồng chính.</p><h3>Các bước thực hiện:</h3><ol><li><strong>Chuẩn bị khu cách ly:</strong> Vệ sinh, sát trùng kỹ lưỡng khu chuồng cách ly trước khi heo về.</li><li><strong>Thời gian cách ly:</strong> Heo mới phải được nuôi cách ly ít nhất 3-4 tuần.</li><li><strong>Theo dõi sức khỏe:</strong> Trong thời gian cách ly, theo dõi chặt chẽ tình trạng sức khỏe của heo (ăn uống, biểu hiện bệnh). Thực hiện các xét nghiệm cần thiết để đảm bảo heo không mang mầm bệnh.</li><li><strong>Bổ sung vaccine:</strong> Thực hiện tiêm phòng bổ sung các loại vaccine cần thiết theo lịch của trại.</li><li><strong>Nhập đàn:</strong> Sau thời gian cách ly, nếu heo hoàn toàn khỏe mạnh mới được chuyển vào khu chuồng nuôi chính.</li></ol>"
          }
        ]
      },
      {
        "title": "Chương 2: Dinh dưỡng theo giai đoạn",
        "lessons": [
          {
            "id": "pig-c2l1",
            "title": "Dinh dưỡng cho heo con",
            "content": "<h3>Giai đoạn theo mẹ:</h3><p>Sữa đầu của heo mẹ là nguồn dinh dưỡng và kháng thể vô giá, phải đảm bảo heo con được bú sữa đầu càng sớm càng tốt. Bổ sung sắt cho heo con vào lúc 3 ngày tuổi là bắt buộc, vì sữa mẹ rất nghèo sắt, heo con sẽ bị thiếu máu nếu không được bổ sung.</p><h3>Tập ăn:</h3><p>Bắt đầu cho heo con tập ăn từ 7 ngày tuổi bằng các loại cám chuyên dụng (cám tập ăn). Việc này giúp hệ tiêu hóa của heo con sớm hoàn thiện và giảm stress khi cai sữa.</p><h3>Cai sữa:</h3><p>Khi cai sữa (khoảng 21-28 ngày tuổi), heo con rất dễ bị tiêu chảy. Cần cung cấp thức ăn chất lượng cao, dễ tiêu hóa và bổ sung men tiêu hóa, vitamin để giúp heo vượt qua giai đoạn này.</p>"
          },
          {
            "id": "pig-c2l2",
            "title": "Thức ăn cho heo thịt",
            "content": "<h3>Chăn nuôi theo giai đoạn:</h3><p>Nhu cầu dinh dưỡng của heo thay đổi theo trọng lượng. Việc cho ăn đúng loại thức ăn theo từng giai đoạn sẽ giúp tối ưu hóa sự tăng trưởng và giảm chi phí.</p><ul><li><strong>Giai đoạn sau cai sữa đến 15kg:</strong> Cần thức ăn có hàm lượng đạm cao (20-22%), tiêu hóa tốt.</li><li><strong>Giai đoạn 15-30kg (heo choai):</strong> Hàm lượng đạm khoảng 18-19%.</li><li><strong>Giai đoạn 30-60kg:</strong> Hàm lượng đạm khoảng 16-17%.</li><li><strong>Giai đoạn trên 60kg (vỗ béo):</strong> Giảm đạm xuống còn 14-15% và tăng cường năng lượng để heo tích nạc.</li></ul>"
          },
          {
            "id": "pig-c2l3",
            "title": "Quản lý nước uống và phụ gia",
            "content": "<h3>Tầm quan trọng của nước:</h3><p>Nước chiếm 70% cơ thể heo và là yếu tố quan trọng nhất. Heo có thể nhịn ăn nhưng không thể nhịn uống. Nước phải luôn sạch, mát và đầy đủ. Sử dụng hệ thống núm uống tự động là tốt nhất, đảm bảo vệ sinh và tránh lãng phí.</p><h3>Chất phụ gia:</h3><ul><li><strong>Men tiêu hóa (Probiotics):</strong> Bổ sung các vi sinh vật có lợi, giúp cân bằng hệ vi sinh vật đường ruột, phòng ngừa tiêu chảy hiệu quả.</li><li><strong>Acid hữu cơ:</strong> Giúp giảm pH đường ruột, ức chế sự phát triển của các vi khuẩn có hại như E.coli, Salmonella.</li><li><strong>Vitamin và khoáng:</strong> Trộn premix vitamin-khoáng vào thức ăn để đảm bảo heo không bị thiếu các vi chất cần thiết.</li></ul>"
          }
        ]
      },
      {
        "title": "Chương 3: Quản lý và Phòng bệnh",
        "lessons": [
          {
            "id": "pig-c3l1",
            "title": "An toàn sinh học trong chăn nuôi",
            "content": "<h3>Đây là chìa khóa thành công:</h3><p>An toàn sinh học là một hệ thống các biện pháp được áp dụng đồng bộ để ngăn chặn mầm bệnh.</p><h3>Các trụ cột của an toàn sinh học:</h3><ol><li><strong>Cách ly:</strong> Xây dựng hàng rào vật lý, kiểm soát chặt chẽ người, phương tiện, và các động vật khác ra vào trại. Người vào trại phải thay quần áo, giày dép, và tắm sát trùng.</li><li><strong>Vệ sinh, sát trùng:</strong> Thường xuyên vệ sinh chuồng trại. Phun sát trùng định kỳ toàn bộ khu vực chăn nuôi và các phương tiện. Có hố sát trùng chứa vôi hoặc thuốc sát trùng ở tất cả các cổng ra vào.</li><li><strong>Nguyên tắc 'Cùng vào - Cùng ra':</strong> Nuôi heo cùng một lứa, xuất bán cùng lúc. Sau mỗi lứa, phải thực hiện vệ sinh sát trùng và để trống chuồng ít nhất 1-2 tuần.</li></ol>"
          },
          {
            "id": "pig-c3l2",
            "title": "Lịch vaccine và tẩy giun sán",
            "content": "<h3>Vaccine - Lá chắn bắt buộc:</h3><p>Tiêm phòng đầy đủ là biện pháp rẻ tiền và hiệu quả nhất để phòng các bệnh truyền nhiễm nguy hiểm. Một số vaccine không thể thiếu:</p><ul><li><strong>Dịch tả heo cổ điển (CSF):</strong> Bệnh gây sốt cao, xuất huyết, tỷ lệ chết cao.</li><li><strong>Tai xanh (PRRS):</strong> Gây rối loạn sinh sản và suy giảm miễn dịch, mở đường cho các bệnh khác.</li><li><strong>Lở mồm long móng (FMD):</strong> Gây mụn nước ở miệng, chân, vú.</li><li><strong>Phó thương hàn (Salmonella):</strong> Gây tiêu chảy, viêm phổi.</li><li><strong>Mycoplasma:</strong> Gây bệnh viêm phổi địa phương.</li></ul><p>Lịch vaccine cụ thể sẽ phụ thuộc vào tình hình dịch tễ của từng vùng.</p><h3>Tẩy giun sán:</h3><p>Tẩy giun sán định kỳ (3-4 tháng/lần) cho toàn đàn để giúp heo hấp thu dinh dưỡng tốt hơn và sinh trưởng khỏe mạnh.</p>"
          },
          {
            "id": "pig-c3l3",
            "title": "Phòng chống dịch tả heo châu Phi (ASF)",
            "content": "<h3>Mức độ nguy hiểm:</h3><p>ASF là bệnh do virus gây ra, không có vaccine hiệu quả và không có thuốc điều trị. Tỷ lệ chết khi nhiễm bệnh có thể lên đến 100%. Virus có sức đề kháng cao trong môi trường. Con đường lây lan chính là qua tiếp xúc trực tiếp và gián tiếp (thức ăn thừa, phương tiện, dụng cụ, người...).</p><h3>Phòng bệnh là duy nhất:</h3><p>Không có cách nào khác ngoài việc thực hiện an toàn sinh học một cách CỰC KỲ NGHIÊM NGẶT:</p><ul><li><strong>Kiểm soát người và phương tiện:</strong> Hạn chế tối đa người lạ vào trại. Phải có khu vực thay đồ và tắm sát trùng. Sát trùng kỹ lưỡng tất cả các phương tiện.</li><li><strong>Kiểm soát nguồn thức ăn, nước uống:</strong> Không sử dụng thức ăn thừa từ nhà bếp. Nguồn nước phải đảm bảo sạch.</li><li><strong>Không mua heo không rõ nguồn gốc:</strong> Thực hiện quy trình cách ly tuyệt đối.</li><li><strong>Diệt vật chủ trung gian:</strong> Tích cực diệt chuột, ruồi, muỗi và các côn trùng khác.</li></ul><p>Khi có heo bệnh, chết bất thường, phải báo ngay cho cơ quan thú y và thực hiện các biện pháp xử lý theo hướng dẫn.</p>"
          }
        ]
      },
      {
        "title": "Chương 4: Xuất chuồng và Môi trường",
        "lessons": [
          {
            "id": "pig-c4l1",
            "title": "Kỹ thuật xuất chuồng",
            "content": "<h3>Thời điểm xuất chuồng:</h3><p>Heo thịt thường được xuất chuồng khi đạt trọng lượng từ 100-120 kg (khoảng 5-6 tháng tuổi). Đây là giai đoạn heo có tỷ lệ nạc cao và hiệu quả sử dụng thức ăn còn tốt.</p><h3>Chuẩn bị trước khi xuất:</h3><ul><li>Ngưng cho heo ăn trước khi bắt khoảng 6-8 tiếng để tránh heo bị nôn mửa, giảm stress và chất lượng thịt tốt hơn. Vẫn cung cấp đủ nước sạch.</li><li>Chuẩn bị khu vực bắt heo và lối đi thông thoáng, chắc chắn.</li><li>Lùa heo nhẹ nhàng, không đánh đập, la hét gây hoảng loạn cho đàn heo.</li></ul>"
          },
          {
            "id": "pig-c4l2",
            "title": "Xử lý chất thải và biogas",
            "content": "<h3>Tầm quan trọng của xử lý chất thải:</h3><p>Chất thải chăn nuôi nếu không được xử lý sẽ gây ô nhiễm nghiêm trọng nguồn nước, đất, không khí và là nguồn lây lan dịch bệnh. Xử lý tốt chất thải không chỉ bảo vệ môi trường mà còn tạo ra nguồn lợi kinh tế.</p><h3>Hầm Biogas:</h3><p>Đây là giải pháp hiệu quả nhất. Toàn bộ chất thải được dẫn vào hầm kín để vi sinh vật yếm khí phân hủy, tạo ra:</p><ul><li><strong>Khí gas:</strong> Dùng làm chất đốt cho sinh hoạt hoặc chạy máy phát điện.</li><li><strong>Nước thải sau biogas:</strong> Có thể dùng tưới cho cây trồng.</li><li><strong>Bã thải:</strong> Là nguồn phân hữu cơ rất tốt.</li></ul>"
          },
          {
            "id": "pig-c4l3",
            "title": "Hạch toán kinh tế",
            "content": "<h3>Các chi phí chính:</h3><p>Để đánh giá hiệu quả, cần hạch toán đầy đủ các chi phí:</p><ul><li><strong>Chi phí giống:</strong> Tiền mua heo con.</li><li><strong>Chi phí thức ăn:</strong> Chiếm tỷ trọng lớn nhất (khoảng 65-75% tổng chi phí).</li><li><strong>Chi phí thuốc thú y:</strong> Vaccine, thuốc phòng trị bệnh.</li><li><strong>Chi phí điện, nước, nhân công.</strong></li><li><strong>Chi phí khấu hao chuồng trại.</strong></li></ul><h3>Chỉ số quan trọng: FCR</h3><p><strong>FCR (Feed Conversion Ratio)</strong> là hệ số chuyển đổi thức ăn, tức là cần bao nhiêu kg thức ăn để tạo ra 1kg tăng trọng. FCR càng thấp, hiệu quả chăn nuôi càng cao. Ví dụ, FCR = 2.5 nghĩa là heo ăn 2.5kg cám để tăng 1kg. Mục tiêu của chăn nuôi hiện đại là đưa FCR xuống dưới 2.5. Việc ghi chép và tính toán FCR giúp người chăn nuôi đánh giá được chất lượng cám, sức khỏe đàn heo và hiệu quả của quy trình chăn nuôi.</p>"
          }
        ]
      }
    ]
  },
  "cattle-farming-v1": {
    "title": "Chăn nuôi bò thịt và bò sữa",
    "meta": {
      "expert": "Chuyên gia Lê Minh Tuấn",
      "field": "Chăn nuôi",
      "duration": "11 giờ"
    },
    "image": "https://images.unsplash.com/photo-1590390311824-aZ73320f7c2?q=80&w=2070&auto=format&fit=crop",
    "imageAlt": "Đàn bò đang gặm cỏ trên đồng",
    "sapo": "Khóa học tổng hợp về kỹ thuật chăn nuôi bò, từ bò thịt vỗ béo đến bò sữa cao sản, giúp người nuôi nâng cao hiệu quả kinh tế.",
    "quizUrl": null,
    "chapters": [
      {
        "title": "Chương 1: Cơ sở chăn nuôi",
        "lessons": [
          {
            "id": "cattle-c1l1",
            "title": "Các giống bò phổ biến tại Việt Nam",
            "content": "<h3>Giống bò hướng thịt:</h3><ul><li><strong>Bò Vàng Việt Nam:</strong> Giống bò địa phương, có khả năng thích nghi tốt với điều kiện khí hậu khắc nghiệt, chịu kham khổ, thịt thơm ngon. Tuy nhiên, tầm vóc nhỏ, tăng trọng chậm. Thường được dùng làm nền để lai tạo.</li><li><strong>Bò lai Sind:</strong> Là kết quả lai tạo giữa bò Vàng Việt Nam và bò Red Sindhi. Bò có màu đỏ cánh gián, tầm vóc lớn hơn bò Vàng, khả năng cho thịt và thích nghi tốt.</li><li><strong>Bò Brahman:</strong> Giống bò Zebu của Mỹ, có u to, yếm rộng, tai dài. Có khả năng chịu nóng, kháng ve tốt. Thường được dùng để tạo ra các tổ hợp bò lai chuyên thịt như BBB, Angus.</li><li><strong>Bò BBB (Blanc Bleu Belge):</strong> Giống bò của Bỉ, nổi tiếng với cơ bắp siêu phát triển, tỷ lệ thịt xẻ rất cao. Thường được dùng trong lai tạo cuối cùng để tạo ra bê lai F1 nuôi thịt.</li></ul><h3>Giống bò hướng sữa:</h3><ul><li><strong>Bò Holstein Friesian (HF):</strong> Giống bò sữa chủ lực trên thế giới và tại Việt Nam. Bò có màu lông lang trắng đen đặc trưng, sản lượng sữa rất cao (trung bình 6,000-8,000 kg/chu kỳ) nhưng yêu cầu điều kiện chăm sóc và dinh dưỡng cao.</li><li><strong>Bò Jersey:</strong> Giống bò của Anh, có tầm vóc nhỏ hơn HF nhưng chất lượng sữa vượt trội với tỷ lệ bơ và protein rất cao, sữa thơm ngon.</li></ul>"
          },
          {
            "id": "cattle-c1l2",
            "title": "Thiết kế chuồng trại bò",
            "content": "<h3>Yêu cầu chung:</h3><p>Chuồng trại phải được xây dựng ở nơi cao ráo, sạch sẽ, thoáng mát về mùa hè và ấm áp về mùa đông. Hướng chuồng tốt nhất là hướng Nam hoặc Đông Nam.</p><h3>Thiết kế chi tiết:</h3><ul><li><strong>Nền chuồng:</strong> Phải làm bằng bê tông, có độ nhám để chống trơn trượt và có độ dốc 2-3% về phía rãnh thoát nước.</li><li><strong>Máng ăn, máng uống:</strong> Xây bằng xi măng hoặc dùng các máng inox, nhựa chuyên dụng. Kích thước phải đủ rộng để bò ăn uống thoải mái. Máng uống nên lắp đặt van tự động để đảm bảo bò luôn có đủ nước sạch.</li><li><strong>Khu vực nghỉ ngơi:</strong> Phải khô ráo. Có thể lót rơm hoặc đệm cao su chuyên dụng cho bò sữa để tránh tổn thương vú và chân.</li><li><strong>Sân chơi/Bãi chăn thả:</strong> Nếu có điều kiện, cần có sân chơi để bò vận động, giúp chúng khỏe mạnh và giảm stress.</li></ul>"
          },
          {
            "id": "cattle-c1l3",
            "title": "Trồng cỏ và chuẩn bị thức ăn thô",
            "content": "<h3>Tầm quan trọng của thức ăn thô:</h3><p>Thức ăn thô xanh là nền tảng trong chăn nuôi bò, giúp hệ tiêu hóa của bò (đặc biệt là dạ cỏ) hoạt động tốt. Chủ động được nguồn thức ăn thô sẽ giúp giảm chi phí và nâng cao hiệu quả.</p><h3>Các giống cỏ năng suất cao:</h3><ul><li><strong>Cỏ Voi (Napier):</strong> Rất phổ biến, năng suất cao, có thể thu hoạch nhiều lứa.</li><li><strong>Cỏ VA06, Ghine:</strong> Các giống cỏ lai, sinh trưởng mạnh, thân mềm, hàm lượng dinh dưỡng cao.</li><li><strong>Cây ngô (bắp):</strong> Có thể trồng để thu hoạch cả thân, lá, bắp làm thức ăn xanh hoặc ủ chua.</li></ul><h3>Kỹ thuật ủ chua (Silage):</h3><p>Ủ chua là phương pháp bảo quản thức ăn thô xanh, giúp dự trữ thức ăn cho mùa khô và tăng cường khả năng tiêu hóa. Cỏ, thân cây ngô được cắt ngắn, trộn với một ít rỉ mật đường, muối và men vi sinh, sau đó nén chặt trong hố hoặc túi ủ để lên men yếm khí.</p>"
          }
        ]
      },
      {
        "title": "Chăn nuôi bò thịt",
        "lessons": [
          {
            "id": "cattle-c2l1",
            "title": "Kỹ thuật vỗ béo bò",
            "content": "<h3>Vỗ béo là gì?</h3><p>Là giai đoạn cuối cùng trong chăn nuôi bò thịt, kéo dài khoảng 2-3 tháng trước khi xuất chuồng. Mục tiêu là thúc đẩy bò tăng trọng nhanh, tích lũy mỡ trong cơ bắp để thịt mềm và ngon hơn.</p><h3>Phương pháp vỗ béo:</h3><ul><li><strong>Chọn bò:</strong> Chọn những con bò gầy nhưng có khung xương to, khỏe mạnh để vỗ béo.</li><li><strong>Chế độ ăn:</strong> Giảm lượng thức ăn thô và tăng cường thức ăn tinh giàu năng lượng (cám gạo, bột ngô, sắn). Cung cấp thức ăn nhiều lần trong ngày.</li><li><strong>Hạn chế vận động:</strong> Nuôi nhốt tại chuồng để bò giảm tiêu hao năng lượng và tập trung vào việc tăng trọng.</li></ul>"
          },
          {
            "id": "cattle-c2l2",
            "title": "Phối trộn thức ăn tinh",
            "content": "<h3>Nguyên liệu phổ biến:</h3><p>Bao gồm cám gạo, bột ngô, khô dầu (đậu tương, lạc), sắn lát khô, rỉ mật đường...</p><h3>Công thức tham khảo cho 100kg thức ăn:</h3><ul><li>Bột ngô: 40-50 kg</li><li>Cám gạo: 30-40 kg</li><li>Khô dầu đậu tương: 10-15 kg</li><li>Bột xương hoặc bột vỏ sò: 1 kg (cung cấp canxi)</li><li>Muối ăn: 0.5 kg</li><li>Premix khoáng-vitamin: theo hướng dẫn của nhà sản xuất.</li></ul><p>Tất cả nguyên liệu được trộn đều và có thể cho ăn trực tiếp hoặc làm ẩm. Khẩu phần ăn tinh khoảng 1-1.5% trọng lượng cơ thể bò mỗi ngày.</p>"
          },
          {
            "id": "cattle-c2l3",
            "title": "Phòng bệnh cho bò thịt",
            "content": "<h3>Các bệnh thường gặp:</h3><ul><li><strong>Tụ huyết trùng:</strong> Bệnh truyền nhiễm cấp tính, gây sốt cao, khó thở. Cần tiêm vaccine phòng bệnh định kỳ 6 tháng/lần.</li><li><strong>Lở mồm long móng (FMD):</strong> Bệnh do virus gây ra, lây lan nhanh. Tiêm vaccine là biện pháp phòng bệnh hiệu quả nhất.</li><li><strong>Ký sinh trùng đường máu:</strong> Do ve, mòng truyền bệnh. Cần vệ sinh chuồng trại, diệt ve, mòng định kỳ.</li><li><strong>Các bệnh về đường tiêu hóa:</strong> Chướng bụng đầy hơi, tiêu chảy. Nguyên nhân thường do thay đổi thức ăn đột ngột. Cần quản lý tốt khẩu phần ăn.</li></ul>"
          }
        ]
      },
      {
        "title": "Chăn nuôi bò sữa",
        "lessons": [
          {
            "id": "cattle-c3l1",
            "title": "Chăm sóc bò sữa mang thai",
            "content": "<h3>Giai đoạn cạn sữa:</h3><p>Trước khi bò đẻ 2 tháng, cần phải cho bò cạn sữa (ngưng vắt sữa). Đây là giai đoạn cực kỳ quan trọng để bò mẹ có thời gian phục hồi sức khỏe, tái tạo biểu mô tuyến vú và tập trung dinh dưỡng nuôi thai.</p><h3>Dinh dưỡng cho bò cạn sữa:</h3><p>Khẩu phần ăn cần được điều chỉnh để tránh bò quá mập (gây khó đẻ). Cung cấp đủ thức ăn thô chất lượng tốt và bổ sung khoáng, vitamin. Trước khi đẻ khoảng 2-3 tuần, bắt đầu cho bò ăn một lượng nhỏ thức ăn tinh để hệ vi sinh vật dạ cỏ quen dần.</p>"
          },
          {
            "id": "cattle-c3l2",
            "title": "Kỹ thuật khai thác sữa",
            "content": "<h3>Vệ sinh là trên hết:</h3><p>Quy trình vắt sữa phải đảm bảo vệ sinh tuyệt đối để sữa không bị nhiễm khuẩn và phòng bệnh viêm vú.</p><h3>Các bước vắt sữa:</h3><ol><li>Vệ sinh chuồng trại, khu vực vắt sữa và bản thân người vắt sữa.</li><li>Rửa sạch bầu vú và núm vú bằng nước ấm, sau đó lau khô bằng khăn sạch riêng cho từng con.</li><li>Vắt bỏ vài tia sữa đầu tiên vào ly riêng để kiểm tra (xem sữa có bị vón, có máu không) và loại bỏ sữa có lượng vi khuẩn cao nhất.</li><li>Tiến hành vắt sữa (bằng tay hoặc bằng máy). Thao tác phải nhanh và dứt khoát.</li><li>Sau khi vắt xong, nhúng từng núm vú vào dung dịch sát trùng chuyên dụng để đóng kín lỗ núm vú, ngăn vi khuẩn xâm nhập.</li></ol>"
          },
          {
            "id": "cattle-c3l3",
            "title": "Phòng bệnh viêm vú",
            "content": "<h3>Nguyên nhân:</h3><p>Viêm vú là bệnh phổ biến và gây thiệt hại kinh tế nặng nề nhất trong chăn nuôi bò sữa. Nguyên nhân chính là do vi khuẩn xâm nhập qua lỗ núm vú, thường do điều kiện vệ sinh kém trong quá trình vắt sữa hoặc do chuồng trại bẩn thỉu.</p><h3>Biện pháp phòng ngừa:</h3><ul><li><strong>Vệ sinh:</strong> Thực hiện nghiêm ngặt quy trình vệ sinh khi vắt sữa.</li><li><strong>Môi trường:</strong> Giữ chuồng trại và khu vực nghỉ ngơi của bò luôn khô ráo, sạch sẽ.</li><li><strong>Kiểm tra sữa hàng ngày:</strong> Vắt bỏ các tia sữa đầu để kiểm tra sữa bất thường.</li><li><strong>Điều trị kịp thời:</strong> Khi phát hiện bò bị viêm, cần cách ly và điều trị ngay theo hướng dẫn của cán bộ thú y.</li><li><strong>Cạn sữa đúng cách:</strong> Sử dụng thuốc cạn sữa để phòng viêm vú trong giai đoạn cạn sữa.</li></ul>"
          }
        ]
      },
      {
        "title": "Chương 4: Sinh sản và Thú y",
        "lessons": [
          {
            "id": "cattle-c4l1",
            "title": "Phối giống và quản lý sinh sản",
            "content": "<h3>Phát hiện động dục:</h3><p>Đây là khâu quan trọng nhất. Các dấu hiệu bò động dục bao gồm: kêu rống, bồn chồn, ăn uống kém, âm hộ sưng đỏ, chảy dịch nhờn trong và đỉnh điểm là hành vi 'nhảy lên con khác' hoặc 'đứng yên cho con khác nhảy'.</p><h3>Thời điểm phối giống:</h3><p>Thời điểm vàng để phối giống là vào cuối kỳ động dục (khoảng 12-18 giờ sau khi có các biểu hiện đầu tiên). Phối giống vào thời điểm này sẽ cho tỷ lệ đậu thai cao nhất.</p><h3>Thụ tinh nhân tạo:</h3><p>Đây là phương pháp phổ biến hiện nay, giúp cải tạo chất lượng đàn bò một cách nhanh chóng, tránh lây lan bệnh qua đường sinh dục và tiết kiệm chi phí nuôi bò đực giống.</p>"
          },
          {
            "id": "cattle-c4l2",
            "title": "Chăm sóc bê con",
            "content": "<h3>Giai đoạn đầu đời:</h3><ul><li><strong>Sau khi sinh:</strong> Để bò mẹ tự liếm khô bê hoặc dùng khăn sạch lau khô. Cắt rốn và sát trùng bằng cồn iod.</li><li><strong>Bú sữa đầu:</strong> Phải cho bê bú sữa đầu của mẹ càng sớm càng tốt (trong vòng 2 giờ đầu sau sinh). Sữa đầu chứa hàm lượng dinh dưỡng và kháng thể rất cao, giúp bê có sức đề kháng ban đầu.</li><li><strong>Nuôi dưỡng:</strong> Bê được nuôi bằng sữa mẹ hoặc sữa thay thế trong khoảng 2-3 tháng. Bắt đầu cho bê tập ăn thức ăn tinh và cỏ non từ tuần thứ 2.</li></ul>"
          },
          {
            "id": "cattle-c4l3",
            "title": "Các bệnh thường gặp ở bê",
            "content": "<h3>Các bệnh chính và cách phòng:</h3><ul><li><strong>Tiêu chảy:</strong> Là nguyên nhân gây chết phổ biến nhất ở bê non, thường do vi khuẩn E.coli, Salmonella hoặc virus Rota, Corona. Phòng bệnh bằng cách cho bê bú đủ sữa đầu, giữ chuồng trại và dụng cụ cho ăn luôn sạch sẽ, khô ráo.</li><li><strong>Viêm phổi:</strong> Thường xảy ra khi thời tiết thay đổi đột ngột, chuồng trại ẩm thấp, lạnh. Cần giữ ấm cho bê và đảm bảo chuồng trại thông thoáng nhưng không có gió lùa.</li><li><strong>Viêm rốn:</strong> Do nhiễm trùng sau khi cắt rốn. Cần thực hiện sát trùng kỹ vị trí cắt rốn bằng cồn iod.</li></ul><p>Thực hiện tiêm phòng vaccine Tụ huyết trùng và các bệnh khác cho bê theo lịch khuyến cáo của cơ quan thú y.</p>"
          }
        ]
      }
    ]
  },
  "shrimp-farming-v1": {
    "title": "Nuôi tôm thẻ chân trắng công nghệ cao",
    "meta": {
      "expert": "KS. Bùi Quang Tề",
      "field": "Thủy sản",
      "duration": "12 giờ"
    },
    "image": "https://images.unsplash.com/photo-1594917951152-7b5634a41e6c?q=80&w=2070&auto=format&fit=crop",
    "imageAlt": "Một tay đang cầm một con tôm thẻ chân trắng",
    "sapo": "Làm chủ quy trình nuôi tôm thẻ chân trắng 2-3 giai đoạn, ứng dụng công nghệ biofloc, lót bạt HDPE để đạt năng suất cao và kiểm soát dịch bệnh.",
    "quizUrl": null,
    "chapters": [
      {
        "title": "Chương 1: Chuẩn bị ao nuôi",
        "lessons": [
          {
            "id": "shrimp-c1l1",
            "title": "Thiết kế ao nuôi công nghệ cao",
            "content": "<h3>Các yếu tố thiết kế chính:</h3><ul><li><strong>Ao lót bạt HDPE:</strong> Đây là yêu cầu bắt buộc. Lót bạt HDPE (dày 0.5 - 1.0mm) giúp cách ly hoàn toàn ao nuôi với môi trường đất bên ngoài, ngăn ngừa rò rỉ, phèn và mầm bệnh từ đất.</li><li><strong>Hình dạng ao:</strong> Ao tròn hoặc ao có góc bo tròn là tối ưu nhất. Thiết kế này giúp tạo dòng chảy ly tâm, dễ dàng gom tụ chất thải vào trung tâm.</li><li><strong>Hệ thống xi-phông trung tâm:</strong> Đáy ao có độ dốc về phía trung tâm, nơi đặt ống xi-phông để có thể loại bỏ chất thải (phân tôm, vỏ tôm, xác tảo) hàng ngày một cách dễ dàng.</li><li><strong>Hệ thống sục khí và tạo dòng:</strong> Bao gồm quạt nước và hệ thống sục khí đáy (ống nano, đĩa khí) để đảm bảo hàm lượng oxy hòa tan (DO) luôn trên 5mg/L và tạo dòng chảy liên tục.</li></ul>"
          },
          {
            "id": "shrimp-c1l2",
            "title": "Cải tạo và xử lý nước đầu vào",
            "content": "<h3>Cải tạo ao:</h3><p>Sau mỗi vụ, ao cần được vệ sinh kỹ lưỡng. Chà rửa sạch bạt, ngâm sát trùng bằng Chlorine (nồng độ 20-30 ppm) hoặc các chất sát trùng khác, sau đó rửa sạch và phơi ao 3-5 ngày.</p><h3>Xử lý nước đầu vào:</h3><p>Nước phải được lấy vào ao lắng để xử lý trước khi cấp vào ao nuôi. Quy trình xử lý bao gồm:</p><ol><li><strong>Lắng và lọc:</strong> Để lắng các chất lơ lửng và lọc qua túi lọc để loại bỏ rác, trứng cá, giáp xác.</li><li><strong>Diệt khuẩn:</strong> Dùng Chlorine, TCCA hoặc thuốc tím (KMnO4) để diệt các mầm bệnh, virus, vi khuẩn.</li><li><strong>Trung hòa và gây màu:</strong> Sau khi diệt khuẩn, chạy quạt nước mạnh để trung hòa lượng Clo dư. Sau đó tiến hành gây màu nước.</li></ol>"
          },
          {
            "id": "shrimp-c1l3",
            "title": "Gây màu nước và tạo biofloc",
            "content": "<h3>Gây màu nước:</h3><p>Màu nước đẹp (màu trà hoặc xanh vỏ đậu) cho thấy sự phát triển của tảo có lợi (tảo Silic - Diatom). Tảo này là nguồn thức ăn tự nhiên ban đầu cho tôm và giúp ổn định môi trường. Có thể gây màu bằng các sản phẩm gây màu chuyên dụng hoặc bón phân vô cơ (Urê, DAP) với liều lượng được kiểm soát.</p><h3>Tạo Biofloc:</h3><p>Biofloc là công nghệ cốt lõi trong nuôi tôm công nghệ cao. Đây là các cụm kết dính của vi khuẩn dị dưỡng, tảo, protozoa... <strong>Lợi ích:</strong></p><ul><li><strong>Làm sạch nước:</strong> Vi khuẩn dị dưỡng tiêu thụ các chất thải chứa nitơ (NH3) của tôm, chuyển hóa thành sinh khối của chính nó.</li><li><strong>Cung cấp nguồn thức ăn:</strong> Hạt floc rất giàu protein (25-50%), là nguồn thức ăn bổ sung chất lượng cao cho tôm, giúp giảm hệ số FCR.</li></ul><p>Để tạo floc, cần duy trì tỷ lệ C:N (Carbon:Nito) trong ao khoảng 15:1 bằng cách bổ sung nguồn carbon như rỉ mật đường, cám gạo.</p>"
          }
        ]
      },
      {
        "title": "Chương 2: Giống và Thả nuôi",
        "lessons": [
          {
            "id": "shrimp-c2l1",
            "title": "Chọn và kiểm tra chất lượng tôm giống",
            "content": "<h3>Tiêu chí chọn giống (Post-larvae - PL):</h3><ul><li><strong>Nguồn gốc:</strong> Mua từ các công ty, trại giống uy tín, có giấy kiểm dịch.</li><li><strong>Cảm quan:</strong> Tôm giống phải đều kích cỡ, bơi lội linh hoạt, bám vào thành bể, phản ứng nhanh với tiếng động. Đường ruột phải đầy thức ăn, không bị đứt quãng.</li><li><strong>Kiểm tra PCR:</strong> Yêu cầu giấy xét nghiệm PCR từ trại giống, đảm bảo tôm âm tính với các bệnh nguy hiểm như đốm trắng (WSSV), hoại tử gan tụy cấp (AHPND), EHP...</li><li><strong>Sốc formol:</strong> Thử sốc tôm bằng formol (nồng độ 100-200 ppm). Tỷ lệ sống sau 30 phút phải trên 95%.</li></ul>"
          },
          {
            "id": "shrimp-c2l2",
            "title": "Thuần hóa và thả giống đúng cách",
            "content": "<h3>Thuần hóa (Acclimatization):</h3><p>Đây là bước quan trọng để giảm stress cho tôm giống. Đặt các bọc chứa tôm giống nổi trên mặt ao nuôi khoảng 15-20 phút để cân bằng nhiệt độ. Sau đó, từ từ cho nước ao vào bọc để tôm thích nghi dần với độ mặn và pH của ao nuôi. Quá trình này kéo dài khoảng 20-30 phút.</p><h3>Thời điểm và cách thả:</h3><p>Nên thả tôm vào lúc trời mát (sáng sớm hoặc chiều tối) để tránh sốc nhiệt. Nghiêng miệng bọc và để tôm từ từ bơi ra. Nên thả ở khu vực đầu gió để tôm phân tán đều khắp ao.</p>"
          },
          {
            "id": "shrimp-c2l3",
            "title": "Quản lý tôm trong giai đoạn đầu",
            "content": "<h3>Chăm sóc sau khi thả:</h3><p>Trong 10 ngày đầu, hệ tiêu hóa của tôm còn yếu. Cần cho ăn các loại thức ăn mảnh, giàu đạm, và cho ăn nhiều cữ nhỏ trong ngày (5-6 cữ). Trộn thêm men tiêu hóa và vitamin vào thức ăn để tăng cường sức khỏe đường ruột và sức đề kháng.</p><h3>Kiểm tra và theo dõi:</h3><p>Hàng ngày cần kiểm tra nhá/sàng ăn để xem sức ăn của tôm. Theo dõi các yếu tố môi trường như pH, kiềm, oxy để điều chỉnh kịp thời. Chạy quạt nước nhẹ nhàng để cung cấp đủ oxy.</p>"
          }
        ]
      },
      {
        "title": "Chương 3: Quản lý trong quá trình nuôi",
        "lessons": [
          {
            "id": "shrimp-c3l1",
            "title": "Quản lý thức ăn và sức khỏe tôm",
            "content": "<h3>Sử dụng sàng ăn (nhá):</h3><p>Đây là công cụ không thể thiếu để quản lý thức ăn chính xác. Đặt các sàng ăn ở các vị trí khác nhau trong ao. Sau khoảng 1.5 - 2 giờ cho ăn, nhấc sàng lên để kiểm tra. Nếu hết thức ăn, có thể tăng lượng cho cữ sau. Nếu còn nhiều, phải giảm lượng thức ăn. Việc này giúp tránh cho ăn thừa (gây ô nhiễm nước) hoặc thiếu (tôm chậm lớn).</p><h3>Bổ sung dinh dưỡng:</h3><p>Trộn định kỳ các chất bổ sung vào thức ăn như: men tiêu hóa, vitamin C, khoáng chất (đặc biệt là Canxi, Magie để tôm cứng vỏ), và các chất tăng cường miễn dịch (Beta-glucan).</p>"
          },
          {
            "id": "shrimp-c3l2",
            "title": "Quản lý các yếu tố môi trường nước",
            "content": "<h3>Các chỉ số quan trọng cần theo dõi hàng ngày:</h3><ul><li><strong>pH:</strong> Dao động trong ngày không quá 0.5, lý tưởng ở mức 7.8 - 8.3.</li><li><strong>Độ kiềm:</strong> Phải luôn duy trì trên 120 mg/L CaCO3 để ổn định pH. Có thể tăng kiềm bằng vôi Dolomite, Soda (NaHCO3).</li><li><strong>Oxy hòa tan (DO):</strong> Luôn phải trên 5 mg/L. Chạy quạt và sục khí liên tục.</li><li><strong>Khí độc (NH3, NO2):</strong> Phải được kiểm soát ở mức thấp nhất. Sử dụng vi sinh và công nghệ biofloc để xử lý khí độc.</li></ul><p>Định kỳ xi-phông đáy ao để loại bỏ chất thải, giúp môi trường nước luôn sạch sẽ.</p>"
          },
          {
            "id": "shrimp-c3l3",
            "title": "Sử dụng vi sinh và chế phẩm sinh học",
            "content": "<h3>Vai trò của vi sinh:</h3><p>Trong nuôi tôm công nghệ cao, vi sinh đóng vai trò cực kỳ quan trọng. Chúng là những 'công nhân' thầm lặng giúp:</p><ul><li><strong>Phân hủy chất thải hữu cơ:</strong> Chuyển hóa phân tôm, thức ăn thừa thành các chất ít độc hơn.</li><li><strong>Xử lý khí độc:</strong> Các dòng vi sinh như Nitrosomonas, Nitrobacter giúp chuyển hóa NH3 và NO2.</li><li><strong>Ức chế vi khuẩn có hại:</strong> Các dòng Bacillus spp. có khả năng cạnh tranh, lấn át các vi khuẩn gây bệnh như Vibrio.</li></ul><p>Cần sử dụng vi sinh định kỳ (7-10 ngày/lần) để duy trì mật độ vi sinh có lợi trong ao nuôi.</p>"
          }
        ]
      },
      {
        "title": "Chương 4: Phòng bệnh và Thu hoạch",
        "lessons": [
          {
            "id": "shrimp-c4l1",
            "title": "Phòng bệnh hoại tử gan tụy (AHPND)",
            "content": "<h3>Tác nhân và triệu chứng:</h3><p>Bệnh do vi khuẩn Vibrio parahaemolyticus gây ra, thường tấn công tôm trong 30 ngày nuôi đầu tiên, gây chết hàng loạt. Tôm bệnh có gan tụy teo, nhũn, ruột rỗng.</p><h3>Biện pháp phòng ngừa:</h3><ul><li>Chọn giống đã được xét nghiệm và sạch bệnh.</li><li>Quản lý tốt thức ăn, không cho ăn thừa.</li><li>Sử dụng vi sinh có lợi (probiotics) định kỳ để ức chế sự phát triển của vi khuẩn Vibrio.</li><li>Duy trì môi trường nước ổn định.</li></ul>"
          },
          {
            "id": "shrimp-c4l2",
            "title": "Phòng bệnh đốm trắng (WSSV)",
            "content": "<h3>Tác nhân và triệu chứng:</h3><p>Bệnh do virus gây ra, có khả năng gây chết 100% chỉ trong vài ngày. Dấu hiệu đặc trưng là các đốm trắng nhỏ xuất hiện dưới vỏ đầu ngực.</p><h3>Biện pháp phòng ngừa:</h3><p>An toàn sinh học là chìa khóa:</p><ul><li>Tuyệt đối không để các vật chủ trung gian như cua, còng, cá tạp... xâm nhập vào ao.</li><li>Lọc nước kỹ, diệt khuẩn triệt để.</li><li>Tăng cường sức đề kháng cho tôm bằng Vitamin C và các chất bổ sung.</li><li>Tránh gây sốc cho tôm, đặc biệt là sốc nhiệt độ và pH.</li></ul>"
          },
          {
            "id": "shrimp-c4l3",
            "title": "Kỹ thuật thu hoạch và bảo quản",
            "content": "<h3>Thời điểm và kỹ thuật thu hoạch:</h3><p>Tôm thường được thu hoạch sau 3-4 tháng nuôi, khi đạt kích cỡ thương phẩm (size 30-50 con/kg). Trước khi thu hoạch, ngừng cho tôm ăn khoảng 4-6 tiếng.</p><p>Đối với ao công nghệ cao, việc thu hoạch khá dễ dàng: tháo cạn nước từ từ qua cống trung tâm, tôm sẽ theo dòng chảy tập trung về một lưới thu ở cuối kênh xả. Dùng vợt để vớt tôm lên.</p><h3>Bảo quản sau thu hoạch:</h3><p>Chất lượng tôm sau thu hoạch phụ thuộc vào việc xử lý và bảo quản. Ngay sau khi vớt lên, tôm phải được rửa sạch và gây sốc nhiệt ngay lập tức bằng cách ngâm trong nước đá sạch (nhiệt độ 0-2°C). Quá trình này giúp tôm chết nhanh, giữ được độ tươi, màu sắc và độ săn chắc của thịt. Sau đó, tôm được đóng vào thùng xốp, ướp đá theo từng lớp và nhanh chóng vận chuyển đến nhà máy.</p>"
          }
        ]
      }
    ]
  },
  "fish-farming-v1": {
    "title": "Nuôi cá tra thương phẩm xuất khẩu",
    "meta": {
      "expert": "GS.TS. Nguyễn Thanh Phương",
      "field": "Thủy sản",
      "duration": "9 giờ"
    },
    "image": "https://plus.unsplash.com/premium_photo-1661963953696-e137452d2f7f?q=80&w=2070&auto=format&fit=crop",
    "imageAlt": "Đàn cá tra trong ao nuôi",
    "sapo": "Cung cấp quy trình nuôi cá tra thâm canh, quản lý môi trường nước, phòng trị bệnh và đáp ứng các tiêu chuẩn an toàn thực phẩm cho xuất khẩu.",
    "quizUrl": null,
    "chapters": [
      {
        "title": "Chương 1: Cơ sở hạ tầng",
        "lessons": [
          {
            "id": "fish-c1l1",
            "title": "Thiết kế và xây dựng ao nuôi",
            "content": "<h3>Vị trí và diện tích:</h3><p>Ao nuôi cá tra cần được xây dựng ở khu vực gần nguồn nước ngọt sạch, không bị ô nhiễm công nghiệp hay nông nghiệp. Diện tích ao lý tưởng cho nuôi thâm canh là từ 3,000 m² đến 10,000 m². Ao quá nhỏ sẽ khó quản lý, ao quá lớn sẽ khó thu hoạch và xử lý khi có sự cố.</p><h3>Kết cấu ao:</h3><ul><li><strong>Hình dạng:</strong> Ao nên có hình chữ nhật để dễ dàng kéo lưới thu hoạch và lắp đặt hệ thống quạt nước.</li><li><strong>Độ sâu:</strong> Mực nước trong ao nên duy trì từ 2.5m đến 3.5m. Độ sâu này giúp ổn định nhiệt độ nước và cung cấp đủ không gian cho cá phát triển.</li><li><strong>Bờ ao:</strong> Phải chắc chắn, không bị rò rỉ, cao hơn mực nước cao nhất trong năm ít nhất 0.5m. Bờ ao nên được trồng cỏ để chống sạt lở.</li><li><strong>Đáy ao:</strong> Đáy ao phải bằng phẳng, dốc nhẹ về phía cống thoát để dễ dàng tháo cạn nước và thu gom chất thải.</li></ul>"
          },
          {
            "id": "fish-c1l2",
            "title": "Hệ thống cấp và thoát nước",
            "content": "<h3>Tầm quan trọng:</h3><p>Hệ thống cấp thoát nước chủ động là yếu tố sống còn, giúp quản lý chất lượng nước và xử lý các tình huống khẩn cấp. Hệ thống phải đảm bảo việc cấp và thoát nước không ảnh hưởng lẫn nhau.</p><h3>Thiết kế hệ thống:</h3><ul><li><strong>Ao lắng:</strong> Bắt buộc phải có ao lắng, diện tích bằng 20-30% diện tích ao nuôi. Nước từ sông, kênh được bơm vào ao lắng để xử lý (lắng phèn, diệt khuẩn) trước khi cấp vào ao nuôi.</li><li><strong>Cống cấp nước:</strong> Đặt ở đầu ao, có lưới chắn để ngăn cá tạp và rác xâm nhập.</li><li><strong>Cống thoát nước (cống bửng):</strong> Đặt ở cuối ao và ở vị trí thấp nhất, giúp tháo cạn nước và thu hoạch dễ dàng.</li></ul>"
          },
          {
            "id": "fish-c1l3",
            "title": "Trang thiết bị cho ao nuôi",
            "content": "<h3>Các thiết bị không thể thiếu:</h3><ul><li><strong>Hệ thống quạt nước (dàn quạt):</strong> Cung cấp oxy hòa tan (DO) cho ao, đặc biệt là vào ban đêm và lúc sáng sớm khi oxy xuống thấp. Đồng thời, quạt nước giúp tạo dòng chảy, gom tụ chất thải và phân tán đều thức ăn.</li><li><strong>Máy cho ăn tự động:</strong> Giúp rải đều thức ăn, giảm công lao động và tránh cho ăn thừa.</li><li><strong>Dụng cụ kiểm tra môi trường:</strong> Bao gồm máy đo DO, máy đo pH, test kit kiểm tra khí độc NH3, NO2. Việc kiểm tra các chỉ số này hàng ngày là bắt buộc.</li><li><strong>Thuyền, xuồng và lưới:</strong> Dùng để di chuyển trong ao, kiểm tra cá và thu hoạch.</li><li><strong>Máy bơm nước:</strong> Công suất lớn để có thể cấp hoặc thoát nước nhanh khi cần thiết.</li></ul>"
          }
        ]
      },
      {
        "title": "Chương 2: Con giống và Thức ăn",
        "lessons": [
          {
            "id": "fish-c2l1",
            "title": "Lựa chọn cá giống chất lượng",
            "content": "<h3>Tiêu chuẩn chọn giống:</h3><p>Chất lượng con giống quyết định hơn 50% sự thành công của vụ nuôi.</p><ul><li><strong>Nguồn gốc:</strong> Mua từ các trại sản xuất giống uy tín, có kiểm dịch đầy đủ.</li><li><strong>Cảm quan:</strong> Cá giống phải đồng đều về kích cỡ, bơi lội nhanh nhẹn, không dị hình, không có dấu hiệu xây xát hay bệnh tật (xuất huyết, lở loét).</li><li><strong>Kích cỡ:</strong> Chọn cá có kích cỡ phù hợp, thường từ 4-6cm (mẫu 80-100 con/kg) để có tỷ lệ sống cao.</li></ul><h3>Thả giống:</h3><p>Trước khi thả, cần tắm cá bằng nước muối loãng (2-3%) trong 5-10 phút để sát khuẩn. Thả cá vào lúc trời mát và để túi chứa cá xuống ao 15-20 phút để cân bằng nhiệt độ.</p>"
          },
          {
            "id": "fish-c2l2",
            "title": "Dinh dưỡng và thức ăn cho cá tra",
            "content": "<h3>Nhu cầu dinh dưỡng:</h3><p>Cá tra là loài ăn tạp nhưng trong nuôi thâm canh, thức ăn công nghiệp đóng vai trò chính. Nhu cầu protein giảm dần theo độ tuổi của cá:</p><ul><li><strong>Giai đoạn cá giống (< 50g):</strong> Nhu cầu đạm 30-35%.</li><li><strong>Giai đoạn cá thịt (50g - 500g):</strong> Nhu cầu đạm 28-30%.</li><li><strong>Giai đoạn vỗ béo (> 500g):</strong> Nhu cầu đạm 25-28%.</li></ul><h3>Thức ăn công nghiệp:</h3><p>Sử dụng thức ăn viên nổi chuyên dụng cho cá tra. Thức ăn phải đảm bảo không chứa kháng sinh cấm, có mùi thơm hấp dẫn và độ bền trong nước tốt để tránh thất thoát, ô nhiễm.</p>"
          },
          {
            "id": "fish-c2l3",
            "title": "Kỹ thuật cho ăn hiệu quả",
            "content": "<h3>Nguyên tắc:</h3><p>Cho ăn đúng lượng, đúng chất, đúng thời điểm và đúng vị trí. Mục tiêu là đạt hệ số chuyển đổi thức ăn (FCR) thấp nhất có thể. FCR lý tưởng cho cá tra là từ 1.5 - 1.7.</p><h3>Phương pháp:</h3><ul><li><strong>Sử dụng sàng ăn (nhá):</strong> Đặt sàng ăn trong ao để kiểm tra sức ăn của cá. Sau 30-45 phút, kiểm tra lượng thức ăn còn lại trong sàng để điều chỉnh lượng cho ăn cho ngày hôm sau.</li><li><strong>Tần suất cho ăn:</strong> Cho ăn 2 lần/ngày vào lúc sáng sớm và chiều mát.</li><li><strong>Điều chỉnh theo thời tiết:</strong> Giảm lượng thức ăn khi thời tiết xấu (trời quá nóng, có mưa lớn) vì cá sẽ ăn kém đi.</li></ul>"
          }
        ]
      },
      {
        "title": "Chương 3: Quản lý và Phòng bệnh",
        "lessons": [
          {
            "id": "fish-c3l1",
            "title": "Quản lý chất lượng nước ao",
            "content": "<h3>Các chỉ số quan trọng và ngưỡng an toàn:</h3><ul><li><strong>Oxy hòa tan (DO):</strong> Luôn phải > 4 mg/L. Cần chạy quạt nước liên tục, đặc biệt là vào ban đêm.</li><li><strong>pH:</strong> Dao động từ 6.5 - 8.0. Biến động pH trong ngày không nên quá 0.5.</li><li><strong>Độ trong:</strong> Từ 25-35 cm. Độ trong quá cao (nước trong) chứng tỏ ao thiếu tảo, quá thấp (nước đặc) là do tảo phát triển quá mức, có nguy cơ tảo tàn gây thiếu oxy.</li><li><strong>Khí độc (NH3, NO2):</strong> Luôn phải ở mức thấp nhất (< 0.02 mg/L đối với NH3). Quản lý bằng cách cho ăn hợp lý, xi-phông đáy ao và sử dụng vi sinh định kỳ.</li></ul><p>Thực hiện thay nước định kỳ (10-20% lượng nước trong ao) để giữ môi trường sạch sẽ.</p>"
          },
          {
            "id": "fish-c3l2",
            "title": "Các bệnh thường gặp trên cá tra",
            "content": "<h3>Các bệnh do vi khuẩn:</h3><ul><li><strong>Bệnh xuất huyết (do Aeromonas):</strong> Cá có các đốm xuất huyết trên da, vây, hậu môn sưng đỏ.</li><li><strong>Bệnh gan thận mủ:</strong> Do vi khuẩn Edwardsiella ictaluri gây ra, làm gan, thận có nhiều đốm mủ trắng li ti.</li></ul><h3>Bệnh do ký sinh trùng:</h3><ul><li><strong>Bệnh trắng gan, trắng mang:</strong> Do ký sinh trùng nội bào gây ra.</li><li><strong>Bệnh trùng bánh xe, trùng quả dưa:</strong> Ký sinh trên da và mang, làm cá ngứa ngáy, bơi lội không định hướng.</li></ul><h3>Phòng và trị:</h3><p>Phòng bệnh là chính. Khi cá bệnh, cần xác định đúng tác nhân và sử dụng thuốc theo hướng dẫn của cán bộ thủy sản, tuyệt đối tuân thủ liều lượng và thời gian ngưng thuốc.</p>"
          },
          {
            "id": "fish-c3l3",
            "title": "Biện pháp phòng trị bệnh tổng hợp",
            "content": "<h3>Nguyên tắc 'Phòng bệnh hơn chữa bệnh':</h3><p>Chi phí phòng bệnh luôn rẻ hơn chi phí chữa bệnh. Một quy trình phòng bệnh tổng hợp bao gồm:</p><ul><li><strong>Con giống chất lượng:</strong> Nền tảng quan trọng nhất.</li><li><strong>Quản lý môi trường tốt:</strong> Giữ nước ao luôn sạch.</li><li><strong>Mật độ nuôi hợp lý:</strong> Tránh nuôi quá dày làm tăng stress và nguy cơ lây bệnh.</li><li><strong>Dinh dưỡng đầy đủ:</strong> Cho ăn thức ăn chất lượng, bổ sung vitamin C và men tiêu hóa định kỳ để tăng sức đề kháng.</li><li><strong>Sử dụng chế phẩm sinh học (probiotics):</strong> Định kỳ sử dụng vi sinh để cải thiện chất lượng nước, xử lý đáy ao và ức chế vi khuẩn có hại.</li></ul>"
          }
        ]
      },
      {
        "title": "Chương 4: Thu hoạch và Chất lượng",
        "lessons": [
          {
            "id": "fish-c4l1",
            "title": "Kỹ thuật thu hoạch cá",
            "content": "<h3>Thời điểm thu hoạch:</h3><p>Cá tra thường được thu hoạch sau 6-8 tháng nuôi, khi đạt kích cỡ thương phẩm từ 800g - 1.2kg/con. Đây là kích cỡ phù hợp để chế biến phi-lê xuất khẩu.</p><h3>Chuẩn bị thu hoạch:</h3><p>Ngưng cho cá ăn ít nhất 1-2 ngày trước khi thu hoạch để làm sạch đường ruột, giúp giảm ô nhiễm nước trong quá trình vận chuyển và nâng cao chất lượng thịt cá.</p><h3>Phương pháp thu hoạch:</h3><p>Dùng lưới kéo để dồn cá về một góc ao, sau đó dùng vợt hoặc bơm chuyên dụng để đưa cá lên xe vận chuyển. Thao tác phải nhanh gọn, nhẹ nhàng để tránh làm cá bị xây xát.</p>"
          },
          {
            "id": "fish-c4l2",
            "title": "Vận chuyển và sơ chế",
            "content": "<h3>Vận chuyển cá sống:</h3><p>Cá sau khi thu hoạch được vận chuyển đến nhà máy chế biến bằng ghe hoặc xe tải có thùng chứa nước và hệ thống sục khí oxy. Mật độ vận chuyển vừa phải để đảm bảo cá không bị ngạt.</p><h3>Sơ chế tại nhà máy:</h3><p>Tại nhà máy, cá được xử lý qua các công đoạn như: làm ngất, cắt tiết, lạng phi-lê, lột da, chỉnh hình, phân loại kích cỡ, cấp đông và đóng gói. Toàn bộ quy trình phải tuân thủ nghiêm ngặt các tiêu chuẩn về vệ sinh an toàn thực phẩm.</p>"
          },
          {
            "id": "fish-c4l3",
            "title": "Đảm bảo chất lượng theo tiêu chuẩn",
            "content": "<h3>Tiêu chuẩn xuất khẩu:</h3><p>Các thị trường khó tính như EU, Mỹ, Nhật Bản yêu cầu sản phẩm phải đạt các chứng nhận như <strong>ASC, GlobalG.A.P, BAP</strong>. Các chứng nhận này đòi hỏi người nuôi phải tuân thủ các quy định khắt khe về:</p><ul><li><strong>Truy xuất nguồn gốc:</strong> Ghi chép nhật ký đầy đủ từ con giống, thức ăn, thuốc sử dụng...</li><li><strong>An toàn thực phẩm:</strong> Tuyệt đối không có dư lượng kháng sinh cấm.</li><li><strong>Trách nhiệm môi trường:</strong> Xử lý tốt nước thải, không gây ô nhiễm.</li><li><strong>Trách nhiệm xã hội:</strong> Đảm bảo điều kiện lao động cho công nhân.</li></ul><h3>Màu thịt phi-lê:</h3><p>Thị trường xuất khẩu đặc biệt ưa chuộng phi-lê cá tra có màu trắng. Để có được màu thịt trắng, người nuôi cần quản lý tốt môi trường nước, tránh để tảo độc phát triển và có thể bổ sung các chất hỗ trợ vào thức ăn trong giai đoạn cuối theo hướng dẫn của chuyên gia.</p>"
          }
        ]
      }
    ]
  },
  "organic-veg-v1": {
    "title": "Trồng rau hữu cơ trong nhà kính",
    "meta": {
      "expert": "KS. Nguyễn Thị Hồng",
      "field": "Trồng trọt công nghệ cao",
      "duration": "8 giờ"
    },
    "image": "https://images.unsplash.com/photo-1587351173893-a99b421714b6?q=80&w=2070&auto=format&fit=crop",
    "imageAlt": "Rau hữu cơ tươi xanh trong nhà kính",
    "sapo": "Làm chủ quy trình trồng rau hữu cơ từ khâu làm đất, chọn giống, tự làm phân bón hữu cơ đến phòng trừ sâu bệnh bằng biện pháp sinh học.",
    "quizUrl": null,
    "chapters": [
      {
        "title": "Chương 1: Nền tảng hữu cơ",
        "lessons": [
          {
            "id": "organic-c1l1",
            "title": "Nguyên tắc nông nghiệp hữu cơ",
            "content": "<h3>Bốn nguyên tắc chính:</h3><p>Nông nghiệp hữu cơ không chỉ là không dùng hóa chất, mà còn dựa trên một hệ tư tưởng toàn diện:</p><ul><li><strong>Sức khỏe:</strong> Canh tác phải duy trì và nâng cao sức khỏe của đất, cây trồng, động vật, con người và hành tinh như một thể thống nhất.</li><li><strong>Sinh thái:</strong> Nông nghiệp phải dựa trên các chu trình sinh thái sống, làm việc và duy trì chúng. Phải bảo vệ và làm giàu đa dạng sinh học.</li><li><strong>Công bằng:</strong> Phải đảm bảo sự công bằng đối với môi trường chung và các cơ hội trong cuộc sống. Điều này bao gồm cả việc đối xử công bằng với người lao động và động vật.</li><li><strong>Cẩn trọng:</strong> Canh tác phải được quản lý một cách phòng ngừa và có trách nhiệm để bảo vệ sức khỏe và phúc lợi của các thế hệ hiện tại, tương lai và môi trường.</li></ul>"
          },
          {
            "id": "organic-c1l2",
            "title": "Thiết kế nhà kính trồng rau",
            "content": "<h3>Yêu cầu thiết kế:</h3><p>Nhà kính cho rau hữu cơ cần tối ưu hóa các yếu tố tự nhiên và ngăn chặn sâu bệnh từ bên ngoài.</p><ul><li><strong>Vật liệu lợp:</strong> Sử dụng màng PE của Israel hoặc các loại có chất lượng tương đương, có khả năng khuếch tán ánh sáng tốt, chống tia UV và chống đọng sương.</li><li><strong>Thông gió:</strong> Rất quan trọng để kiểm soát nhiệt độ và độ ẩm. Nhà kính nên có hệ thống thông gió đỉnh (mái mở) và thông gió hông (lưới cuốn lên xuống).</li><li><strong>Lưới chắn côn trùng:</strong> Toàn bộ các ô thoáng phải được bao bọc bằng lưới chắn côn trùng (loại 32-50 mesh) để ngăn chặn rầy, bọ phấn, ruồi... xâm nhập.</li><li><strong>Cửa ra vào:</strong> Nên thiết kế cửa hai lớp (phòng đệm) để hạn chế tối đa côn trùng bay vào khi người ra vào nhà kính.</li></ul>"
          },
          {
            "id": "organic-c1l3",
            "title": "Chuẩn bị giá thể và đất trồng",
            "content": "<h3>Tầm quan trọng của giá thể:</h3><p>Trong canh tác hữu cơ, giá thể là 'ngôi nhà' của bộ rễ và hệ vi sinh vật đất. Một giá thể tốt phải tơi xốp, giữ ẩm tốt, thoát nước tốt và giàu dinh dưỡng.</p><h3>Công thức phối trộn giá thể tham khảo:</h3><ul><li>50% xơ dừa (đã qua xử lý chát).</li><li>30% phân trùn quế hoặc compost hoai mục.</li><li>15% đá Perlite hoặc trấu hun.</li><li>5% nấm đối kháng Trichoderma để phòng bệnh thối rễ.</li></ul><h3>Xử lý đất/giá thể trước khi trồng:</h3><p>Để loại bỏ mầm bệnh, tuyến trùng mà không dùng hóa chất, có thể áp dụng:</p><ul><li><strong>Phơi ải:</strong> Phơi đất/giá thể dưới nắng gắt trong 1-2 tuần.</li><li><strong>Xử lý bằng hơi nước nóng:</strong> Phương pháp hiệu quả nhưng tốn kém hơn.</li></ul>"
          }
        ]
      },
      {
        "title": "Chương 2: Dinh dưỡng hữu cơ",
        "lessons": [
          {
            "id": "organic-c2l1",
            "title": "Ủ phân compost và phân trùn quế",
            "content": "<h3>Phân Compost:</h3><p>Là quá trình phân hủy các vật liệu hữu cơ (rơm rạ, cỏ, lá cây, phân gia súc) nhờ hoạt động của vi sinh vật. Một đống ủ tốt cần có sự cân bằng giữa vật liệu 'nâu' (giàu carbon, như lá khô, rơm) và vật liệu 'xanh' (giàu nitơ, như cỏ tươi, phân động vật). Cần giữ ẩm và đảo trộn định kỳ để cung cấp oxy cho vi sinh vật.</p><h3>Phân trùn quế:</h3><p>Là phân của trùn đất, được xem là 'vàng đen' trong nông nghiệp hữu cơ. Phân trùn quế không chỉ giàu dinh dưỡng mà còn chứa các enzyme và vi sinh vật có lợi giúp cải tạo đất và kích thích cây trồng phát triển. Có thể tự nuôi trùn quế bằng các loại rác hữu cơ nhà bếp và phân gia súc.</p>"
          },
          {
            "id": "organic-c2l2",
            "title": "Sử dụng phân bón lá hữu cơ",
            "content": "<h3>Các loại phân bón lá tự làm:</h3><ul><li><strong>Trà trùn quế (Worm Tea):</strong> Ngâm phân trùn quế trong nước sục khí để nhân sinh khối vi sinh vật có lợi, sau đó lọc lấy nước để phun cho cây.</li><li><strong>Dịch chuối, dịch trứng sữa:</strong> Ngâm chuối, trứng, sữa với các chế phẩm vi sinh (như EM) để tạo ra dung dịch giàu dinh dưỡng, đặc biệt tốt cho giai đoạn cây con và nuôi quả.</li><li><strong>Phân cá:</strong> Ủ cá với rỉ mật đường và chế phẩm EM để tạo ra phân bón giàu đạm và amino acid.</li></ul><p>Phun phân bón lá vào lúc chiều mát để cây hấp thu tốt nhất.</p>"
          },
          {
            "id": "organic-c2l3",
            "title": "Luân canh và xen canh",
            "content": "<h3>Luân canh:</h3><p>Là trồng các loại cây khác nhau trên cùng một mảnh đất theo các mùa vụ kế tiếp. Ví dụ, sau khi trồng một vụ rau ăn lá (cải, xà lách) vốn hút nhiều đạm, nên luân canh bằng một vụ cây họ đậu (đậu cô ve, đậu đũa) để trả lại đạm cho đất. Việc này giúp cắt đứt vòng đời của sâu bệnh và cân bằng dinh dưỡng đất.</p><h3>Xen canh:</h3><p>Là trồng nhiều loại cây khác nhau trên cùng một mảnh đất trong cùng một thời điểm. Ví dụ: trồng xen hành, tỏi, húng quế, cúc vạn thọ vào các luống rau. Mùi hương của các cây này giúp xua đuổi côn trùng gây hại một cách tự nhiên.</p>"
          }
        ]
      },
      {
        "title": "Chương 3: Phòng trừ sâu bệnh sinh học",
        "lessons": [
          {
            "id": "organic-c3l1",
            "title": "Nhận diện sâu bệnh hại rau",
            "content": "<h3>Sâu hại phổ biến trong nhà kính:</h3><ul><li><strong>Bọ phấn trắng:</strong> Chích hút nhựa cây, truyền bệnh virus.</li><li><strong>Rầy mềm (rệp):</strong> Gây xoăn ngọn, làm cây còi cọc.</li><li><strong>Nhện đỏ:</strong> Rất nhỏ, tạo mạng nhện mỏng dưới mặt lá, làm lá vàng và rụng.</li></ul><h3>Bệnh hại phổ biến:</h3><ul><li><strong>Bệnh phấn trắng:</strong> Tạo lớp bột màu trắng trên lá.</li><li><strong>Bệnh sương mai:</strong> Tạo các đốm vàng trên mặt trên lá và lớp mốc màu xám ở mặt dưới.</li></ul><p>Thăm vườn thường xuyên để phát hiện sớm là yếu tố quan trọng nhất.</p>"
          },
          {
            "id": "organic-c3l2",
            "title": "Sử dụng thiên địch",
            "content": "<h3>Thiên địch là gì?</h3><p>Là những sinh vật có ích giúp tiêu diệt sâu hại. Trong nhà kính, có thể chủ động thả hoặc tạo điều kiện cho thiên địch phát triển.</p><ul><li><strong>Bọ rùa:</strong> Là 'khắc tinh' của các loài rệp.</li><li><strong>Ong ký sinh:</strong> Đẻ trứng vào sâu non hoặc trứng của sâu hại, tiêu diệt chúng từ bên trong.</li><li><strong>Bọ bắt mồi:</strong> Tấn công và ăn thịt nhiều loại côn trùng nhỏ như bọ phấn, nhện đỏ.</li></ul><p>Trồng các loại cây có hoa như sao nhái, thì là trong và xung quanh nhà kính để thu hút thiên địch.</p>"
          },
          {
            "id": "organic-c3l3",
            "title": "Tự làm thuốc trừ sâu thảo mộc",
            "content": "<h3>Nguyên tắc:</h3><p>Các loại thuốc này có tác dụng xua đuổi hoặc gây rối loạn sinh trưởng của sâu hại, an toàn cho người và môi trường. Cần phun định kỳ để phòng ngừa.</p><h3>Một số công thức đơn giản:</h3><ul><li><strong>Dung dịch tỏi, ớt, gừng:</strong> Giã nát 1 củ tỏi, 1 củ gừng, 10 quả ớt, ngâm trong 1 lít rượu trong 1 tuần. Khi dùng, pha 100ml dung dịch này với 5 lít nước để phun.</li><li><strong>Dầu Neem:</strong> Mua dầu neem nguyên chất, pha với nước và một ít nước rửa chén (chất bám dính) theo hướng dẫn để phun trừ rệp, bọ phấn.</li><li><strong>Nước tro bếp:</strong> Lấy tro bếp sạch, ngâm vào nước, lọc lấy nước trong để phun. Nước tro có tính kiềm giúp phòng trừ một số loại nấm bệnh.</li></ul>"
          }
        ]
      },
      {
        "title": "Chương 4: Chứng nhận và Thị trường",
        "lessons": [
          {
            "id": "organic-c4l1",
            "title": "Tiêu chuẩn hữu cơ Việt Nam",
            "content": "<h3>Giới thiệu về VietGAP Organic:</h3><p>Là tiêu chuẩn quốc gia về thực hành nông nghiệp hữu cơ tốt tại Việt Nam. Để đạt chứng nhận, trang trại phải tuân thủ nghiêm ngặt các quy định về không sử dụng phân bón hóa học, thuốc BVTV hóa học, chất kích thích tăng trưởng, và giống biến đổi gen.</p><h3>Tầm quan trọng của ghi chép nhật ký:</h3><p>Đây là yêu cầu bắt buộc và là bằng chứng cho quá trình sản xuất hữu cơ. Cần ghi chép chi tiết mọi hoạt động: ngày gieo trồng, loại phân bón sử dụng (nguồn gốc, cách ủ), các biện pháp phòng trừ sâu bệnh, ngày thu hoạch...</p>"
          },
          {
            "id": "organic-c4l2",
            "title": "Xây dựng thương hiệu và truy xuất nguồn gốc",
            "content": "<h3>Kể câu chuyện của bạn:</h3><p>Người tiêu dùng sản phẩm hữu cơ không chỉ mua rau, họ mua cả niềm tin. Hãy xây dựng một câu chuyện thương hiệu về quá trình canh tác, về tâm huyết của bạn. Điều này tạo ra sự kết nối và giá trị gia tăng cho sản phẩm.</p><h3>Truy xuất nguồn gốc:</h3><p>Sử dụng mã QR trên bao bì sản phẩm. Khi người tiêu dùng quét mã, họ có thể xem được toàn bộ nhật ký sản xuất của lô rau đó: ngày trồng, ngày bón phân, hình ảnh vườn rau... Điều này tạo ra sự minh bạch và tin tưởng tuyệt đối.</p>"
          },
          {
            "id": "organic-c4l3",
            "title": "Kết nối với thị trường tiêu thụ",
            "content": "<h3>Các kênh phân phối tiềm năng:</h3><ul><li><strong>Cửa hàng thực phẩm sạch/hữu cơ:</strong> Đây là kênh phân phối chính, tập trung đúng đối tượng khách hàng.</li><li><strong>Hợp tác với nhà hàng, trường học:</strong> Cung cấp rau sạch cho các bếp ăn tập thể có yêu cầu cao về chất lượng.</li><li><strong>Bán hàng trực tiếp (CSA - Community Supported Agriculture):</strong> Xây dựng một cộng đồng khách hàng thân thiết, họ đăng ký mua rau định kỳ trực tiếp từ trang trại của bạn.</li><li><strong>Bán hàng online và giao hàng tận nơi:</strong> Tận dụng mạng xã hội và website để giới thiệu sản phẩm và nhận đơn hàng trực tiếp.</li></ul>"
          }
        ]
      }
    ]
  },
  "hydroponics-v1": {
    "title": "Nông nghiệp công nghệ cao: Thủy canh",
    "meta": {
      "expert": "ThS. Đỗ Anh Khoa",
      "field": "Trồng trọt công nghệ cao",
      "duration": "7 giờ"
    },
    "image": "https://images.unsplash.com/photo-1605578334826-42756ad28a42?q=80&w=2070&auto=format&fit=crop",
    "imageAlt": "Hệ thống rau thủy canh trong trang trại",
    "sapo": "Khám phá và ứng dụng kỹ thuật trồng rau bằng phương pháp thủy canh, từ quy mô gia đình đến trang trại thương mại.",
    "quizUrl": null,
    "chapters": [
      {
        "title": "Chương 1: Giới thiệu về thủy canh",
        "lessons": [
          {
            "id": "hydro-c1l1",
            "title": "Lịch sử và ưu điểm của thủy canh",
            "content": "<h3>Thủy canh là gì?</h3><p>Thủy canh (Hydroponics) là kỹ thuật trồng cây không sử dụng đất. Thay vào đó, rễ cây được trồng trực tiếp trong dung dịch dinh dưỡng hoặc trong các giá thể trơ (như xơ dừa, sỏi nhẹ, đá perlite) và được cung cấp dinh dưỡng qua một dung dịch nước đã được pha chế.</p><h3>Ưu điểm vượt trội:</h3><ul><li><strong>Tiết kiệm nước:</strong> Các hệ thống thủy canh hồi lưu có thể tiết kiệm đến 90% lượng nước so với canh tác truyền thống.</li><li><strong>Tăng năng suất:</strong> Cây được cung cấp dinh dưỡng tối ưu và liên tục nên phát triển nhanh hơn, cho năng suất cao hơn trên cùng một diện tích.</li><li><strong>Không phụ thuộc vào đất:</strong> Có thể trồng ở bất cứ đâu, từ ban công, sân thượng đến các vùng đất cằn cỗi, sa mạc.</li><li><strong>Kiểm soát sâu bệnh:</strong> Loại bỏ được các mầm bệnh và sâu hại từ đất, giảm thiểu việc sử dụng thuốc bảo vệ thực vật.</li><li><strong>Chất lượng sản phẩm:</strong> Rau sạch, an toàn, đồng đều về chất lượng và mẫu mã.</li></ul>"
          },
          {
            "id": "hydro-c1l2",
            "title": "Các hệ thống thủy canh phổ biến",
            "content": "<h3>Phân loại hệ thống:</h3><p>Có nhiều hệ thống thủy canh khác nhau, nhưng phổ biến nhất là:</p><ul><li><strong>Thủy canh tĩnh (DWC - Deep Water Culture):</strong> Rễ cây được ngâm trực tiếp trong một bể chứa dung dịch dinh dưỡng có sục khí oxy liên tục. Đây là hệ thống đơn giản, dễ làm tại nhà.</li><li><strong>Thủy canh hồi lưu (NFT - Nutrient Film Technique):</strong> Một dòng dung dịch dinh dưỡng mỏng chảy liên tục qua các ống nhựa, lướt qua bộ rễ của cây. Hệ thống này rất hiệu quả cho các loại rau ăn lá.</li><li><strong>Hệ thống nhỏ giọt (Drip System):</strong> Dung dịch dinh dưỡng được bơm và nhỏ giọt từ từ vào gốc từng cây. Thường được áp dụng cho các cây lớn hơn như cà chua, dưa chuột.</li><li><strong>Hệ thống bấc (Wick System):</strong> Là hệ thống thụ động đơn giản nhất, sử dụng một sợi bấc để hút dung dịch dinh dưỡng từ bể chứa lên giá thể trồng cây.</li></ul><p>Việc lựa chọn hệ thống phụ thuộc vào quy mô, loại cây trồng và mức độ đầu tư.</p>"
          },
          {
            "id": "hydro-c1l3",
            "title": "Lựa chọn cây trồng phù hợp",
            "content": "<h3>Các loại cây dễ trồng nhất:</h3><p>Hầu hết các loại cây đều có thể trồng thủy canh, nhưng một số loại đặc biệt phù hợp và cho hiệu quả kinh tế cao:</p><ul><li><strong>Rau ăn lá:</strong> Xà lách, rau diếp, cải bó xôi, cải kale, cải ngọt... là những lựa chọn hàng đầu. Chúng phát triển rất nhanh và có thể thu hoạch liên tục.</li><li><strong>Rau gia vị:</strong> Húng quế, bạc hà, rau mùi, kinh giới... phát triển rất tốt trong hệ thống thủy canh.</li><li><strong>Cây ăn quả (quy mô lớn hơn):</strong> Cà chua, dưa chuột, ớt chuông, dâu tây... đòi hỏi hệ thống lớn hơn và quy trình chăm sóc phức tạp hơn nhưng cho giá trị kinh tế cao.</li></ul><p>Đối với người mới bắt đầu, nên chọn các loại rau ăn lá để dễ dàng thành công trong lần đầu tiên.</p>"
          }
        ]
      },
      {
        "title": "Chương 2: Thiết lập hệ thống",
        "lessons": [
          {
            "id": "hydro-c2l1",
            "title": "Vật liệu và thiết bị cần thiết",
            "content": "<h3>Danh sách thiết bị cơ bản:</h3><ul><li><strong>Thùng/Bể chứa dung dịch:</strong> Dùng để chứa dung dịch dinh dưỡng. Phải làm bằng vật liệu không trong suốt để ngăn ánh sáng, tránh rêu tảo phát triển.</li><li><strong>Máy bơm chìm:</strong> Dùng để bơm dung dịch trong các hệ thống hồi lưu (NFT, nhỏ giọt).</li><li><strong>Máy sục khí oxy:</strong> Cực kỳ quan trọng cho hệ thống thủy canh tĩnh (DWC) để cung cấp oxy cho rễ.</li><li><strong>Ống dẫn, rọ nhựa:</strong> Ống PVC dùng cho hệ thống NFT, rọ nhựa để đựng giá thể và cây con.</li><li><strong>Giá thể:</strong> Xơ dừa, trấu hun, sỏi nhẹ (đá leca), đá perlite, hoặc viên nén rockwool.</li><li><strong>Bút đo pH và EC:</strong> Dụng cụ bắt buộc để kiểm soát chất lượng dung dịch dinh dưỡng.</li></ul>"
          },
          {
            "id": "hydro-c2l2",
            "title": "Tự lắp đặt hệ thống thủy canh tĩnh",
            "content": "<h3>Mô hình cho người mới bắt đầu:</h3><p>Đây là hệ thống dễ làm nhất.</p><ol><li><strong>Chuẩn bị thùng:</strong> Lấy một thùng xốp hoặc thùng nhựa tối màu có nắp, dung tích khoảng 20-50 lít.</li><li><strong>Khoét lỗ trên nắp:</strong> Dùng mũi khoét để khoét các lỗ tròn trên nắp thùng, khoảng cách giữa các lỗ tùy thuộc vào loại rau. Đường kính lỗ vừa với rọ nhựa đã chuẩn bị.</li><li><strong>Lắp đặt máy sục khí:</strong> Đặt cục đá sủi của máy sục khí oxy vào đáy thùng, luồn dây ra ngoài.</li><li><strong>Pha dung dịch:</strong> Pha dung dịch dinh dưỡng theo hướng dẫn và đổ vào thùng, mực nước cách nắp khoảng 3-5 cm.</li><li><strong>Trồng cây:</strong> Đặt các cây con đã ươm sẵn vào rọ nhựa (cùng với giá thể), sau đó đặt các rọ nhựa vào các lỗ đã khoét trên nắp. Đảm bảo bộ rễ của cây chạm vào dung dịch dinh dưỡng.</li><li><strong>Vận hành:</strong> Cắm điện cho máy sục khí chạy liên tục 24/7.</li></ol>"
          },
          {
            "id": "hydro-c2l3",
            "title": "Tự lắp đặt hệ thống thủy canh hồi lưu",
            "content": "<h3>Mô hình NFT dạng ống:</h3><p>Phổ biến cho quy mô thương mại nhỏ.</p><ol><li><strong>Làm khung giàn:</strong> Dùng sắt hoặc thép để làm một khung giàn có độ dốc nhẹ (khoảng 1-2%).</li><li><strong>Lắp ống thủy canh:</strong> Đặt các ống nhựa PVC (đã được khoét lỗ để đặt rọ) lên giàn.</li><li><strong>Lắp đặt hệ thống cấp và hồi lưu:</strong> Đặt một bể chứa dung dịch ở đầu thấp của giàn. Đặt máy bơm chìm trong bể, nối ống để bơm dung dịch lên đầu cao của các ống PVC. Dung dịch sẽ chảy thành một lớp mỏng qua rễ cây trong ống, sau đó chảy về lại bể chứa ở đầu thấp, tạo thành một vòng tuần hoàn.</li><li><strong>Trồng cây và vận hành:</strong> Đặt cây con vào rọ và đặt lên các lỗ trên ống. Cho máy bơm chạy theo chu kỳ (ví dụ: 15 phút chạy, 15 phút nghỉ) hoặc chạy liên tục tùy loại cây.</li></ol>"
          }
        ]
      },
      {
        "title": "Chương 3: Dung dịch dinh dưỡng",
        "lessons": [
          {
            "id": "hydro-c3l1",
            "title": "Vai trò của các nguyên tố dinh dưỡng",
            "content": "<h3>Dinh dưỡng đa lượng:</h3><p>Là các nguyên tố cây cần với số lượng lớn.</p><ul><li><strong>Đạm (N):</strong> Giúp cây phát triển thân, lá.</li><li><strong>Lân (P):</strong> Cần thiết cho sự phát triển của rễ và hoa.</li><li><strong>Kali (K):</strong> Giúp cây cứng cáp, tăng khả năng chống chịu và chất lượng quả.</li><li><strong>Canxi (Ca), Magie (Mg), Lưu huỳnh (S):</strong> Các nguyên tố trung lượng quan trọng.</li></ul><h3>Dinh dưỡng vi lượng:</h3><p>Cây cần với lượng rất nhỏ nhưng không thể thiếu.</p><ul><li>Bao gồm Sắt (Fe), Mangan (Mn), Kẽm (Zn), Đồng (Cu), Bo (B)... Chúng tham gia vào các quá trình enzyme và trao đổi chất của cây.</li></ul>"
          },
          {
            "id": "hydro-c3l2",
            "title": "Cách pha dung dịch thủy canh",
            "content": "<h3>Sử dụng dung dịch thương mại:</h3><p>Đối với người mới, cách đơn giản và an toàn nhất là mua các cặp dung dịch thủy canh A và B có sẵn trên thị trường. Đây là các dung dịch đậm đặc.</p><h3>Nguyên tắc pha chế:</h3><p><strong>KHÔNG BAO GIỜ TRỘN TRỰC TIẾP DUNG DỊCH A VÀ B ĐẬM ĐẶC VỚI NHAU.</strong> Việc này sẽ gây ra phản ứng kết tủa, làm hỏng dinh dưỡng.</p><ol><li>Lấy một thùng chứa nước sạch.</li><li>Đong một lượng dung dịch A theo hướng dẫn và đổ vào thùng nước, khuấy đều.</li><li>Tiếp tục đong một lượng dung dịch B tương ứng và đổ vào thùng, khuấy đều lần nữa.</li><li>Để dung dịch ổn định khoảng 30 phút trước khi đo pH và EC.</li></ol>"
          },
          {
            "id": "hydro-c3l3",
            "title": "Đo và điều chỉnh pH, EC",
            "content": "<h3>pH - Độ chua/kiềm:</h3><p>pH ảnh hưởng đến khả năng hấp thụ các chất dinh dưỡng của rễ cây. Nếu pH quá cao hoặc quá thấp, cây sẽ không thể hấp thụ được một số chất dù chúng có trong dung dịch. <strong>Ngưỡng pH lý tưởng cho hầu hết các loại rau là từ 5.5 đến 6.5.</strong> Dùng bút đo pH để kiểm tra và dùng dung dịch 'pH down' (thường là acid) hoặc 'pH up' (thường là kiềm) để điều chỉnh.</p><h3>EC - Nồng độ dinh dưỡng:</h3><p>EC (Electrical Conductivity) là chỉ số đo tổng nồng độ các chất dinh dưỡng hòa tan trong dung dịch. <strong>Ngưỡng EC lý tưởng:</strong></p><ul><li>Rau ăn lá (xà lách, cải): 1.2 - 1.8 mS/cm</li><li>Cây ăn quả (cà chua, dưa chuột): 2.0 - 3.5 mS/cm</li></ul><p>Dùng bút đo EC để kiểm tra. Nếu EC quá cao, thêm nước sạch. Nếu EC quá thấp, thêm dung dịch dinh dưỡng (cả A và B theo đúng tỷ lệ).</p>"
          }
        ]
      },
      {
        "title": "Chương 4: Vận hành và Chăm sóc",
        "lessons": [
          {
            "id": "hydro-c4l1",
            "title": "Ươm cây con cho hệ thống thủy canh",
            "content": "<h3>Tại sao phải ươm cây?</h3><p>Không nên gieo hạt trực tiếp vào hệ thống thủy canh. Việc ươm cây con riêng giúp tỷ lệ nảy mầm cao hơn, chọn lọc được những cây khỏe mạnh và tiết kiệm không gian trong hệ thống chính.</p><h3>Các bước ươm cây:</h3><ol><li>Ngâm hạt giống trong nước ấm khoảng 2-4 giờ.</li><li>Chuẩn bị giá thể ươm (viên nén xơ dừa, mút xốp hoặc rockwool). Làm ẩm giá thể.</li><li>Gieo 1-2 hạt vào mỗi viên nén/ô mút.</li><li>Đặt khay ươm ở nơi có ánh sáng nhẹ, giữ ẩm liên tục.</li><li>Khi cây ra được 2-4 lá thật (khoảng 10-15 ngày), cây đã đủ khỏe để chuyển vào hệ thống thủy canh.</li></ol>"
          },
          {
            "id": "hydro-c4l2",
            "title": "Quản lý sâu bệnh trong thủy canh",
            "content": "<h3>Phòng bệnh là chính:</h3><p>Thủy canh đã loại bỏ được các bệnh từ đất, nhưng vẫn có thể gặp các loại sâu bệnh lây qua không khí.</p><ul><li><strong>Sâu hại:</strong> Các loại rầy mềm, bọ phấn, nhện đỏ có thể xuất hiện. Cần kiểm tra lá thường xuyên, đặc biệt là mặt dưới lá.</li><li><strong>Bệnh nấm:</strong> Bệnh phấn trắng, sương mai có thể phát triển nếu độ ẩm quá cao và không khí kém lưu thông.</li></ul><h3>Biện pháp xử lý hữu cơ:</h3><p>Khi phát hiện sâu bệnh, ưu tiên các biện pháp an toàn:</p><ul><li>Bắt bằng tay hoặc dùng vòi nước xịt mạnh để rửa trôi.</li><li>Sử dụng các loại thuốc sinh học như dầu Neem, dung dịch tỏi ớt...</li><li>Đảm bảo hệ thống thông gió tốt để giảm độ ẩm.</li></ul>"
          },
          {
            "id": "hydro-c4l3",
            "title": "Thu hoạch và xử lý hệ thống",
            "content": "<h3>Kỹ thuật thu hoạch:</h3><p>Đối với các loại rau ăn lá như xà lách, có hai cách thu hoạch:</p><ul><li><strong>Thu hoạch cả cây:</strong> Nhổ cả cây ra khỏi rọ.</li><li><strong>Thu hoạch tỉa lá (Cut-and-come-again):</strong> Dùng kéo cắt các lá lớn bên ngoài để ăn trước, chừa lại phần ngọn và các lá non bên trong. Cây sẽ tiếp tục ra lá mới cho các lần thu hoạch tiếp theo. Cách này giúp kéo dài thời gian thu hoạch trên cùng một cây.</li></ul><h3>Vệ sinh hệ thống sau vụ:</h3><p>Đây là bước cực kỳ quan trọng để ngăn ngừa sự tích tụ của mầm bệnh. Sau khi thu hoạch xong, cần:</p><ol><li>Tháo toàn bộ rễ và cây cũ ra khỏi hệ thống.</li><li>Xả bỏ toàn bộ dung dịch dinh dưỡng cũ.</li><li>Dùng bàn chải và nước sạch cọ rửa toàn bộ bể chứa, ống dẫn, rọ nhựa.</li><li>Sát trùng hệ thống bằng dung dịch oxy già (H2O2) loãng hoặc dung dịch Chlorine, sau đó rửa lại thật kỹ bằng nước sạch.</li><li>Để hệ thống khô ráo trước khi bắt đầu một vụ mới.</li></ol>"
          }
        ]
      }
    ]
  },
  "mushroom-v1": {
    "title": "Kỹ thuật trồng Nấm bào ngư và Nấm rơm",
    "meta": {
      "expert": "KS. Trần Thị Bích Thủy",
      "field": "Trồng trọt",
      "duration": "6 giờ"
    },
    "image": "https://images.unsplash.com/photo-1594218840534-31945f1b6238?q=80&w=1939&auto=format&fit=crop",
    "imageAlt": "Nấm bào ngư đang phát triển",
    "sapo": "Học quy trình trồng các loại nấm phổ biến như nấm bào ngư, nấm rơm, từ khâu xử lý nguyên liệu, cấy meo đến chăm sóc và thu hái.",
    "quizUrl": null,
    "chapters": [
      {
        "title": "Chương 1: Nguyên liệu và Meo giống",
        "lessons": [
          {
            "id": "mushroom-c1l1",
            "title": "Nguyên liệu trồng nấm",
            "content": "<h3>Nguyên liệu là gì?</h3><p>Nguyên liệu trồng nấm là môi trường dinh dưỡng để sợi nấm (tơ nấm) phát triển và hình thành quả thể (cây nấm). Nguyên liệu phải giàu cellulose, sạch và không bị mốc.</p><h3>Các loại nguyên liệu phổ biến:</h3><ul><li><strong>Mùn cưa:</strong> Là nguyên liệu tốt nhất để trồng nấm bào ngư, nấm hương, mộc nhĩ. Nên dùng mùn cưa từ các loại gỗ mềm, không có tinh dầu.</li><li><strong>Rơm rạ:</strong> Là nguyên liệu chính để trồng nấm rơm và cũng có thể dùng cho nấm bào ngư. Rơm rạ phải khô, sạch, không bị mốc.</li><li><strong>Bã mía, lõi ngô:</strong> Có thể được sử dụng sau khi đã xử lý.</li><li><strong>Các chất phụ gia:</strong> Bổ sung thêm cám gạo, bột ngô để tăng cường dinh dưỡng cho bịch nấm. Bổ sung vôi để điều chỉnh độ pH.</li></ul>"
          },
          {
            "id": "mushroom-c1l2",
            "title": "Lựa chọn và bảo quản meo giống",
            "content": "<h3>Meo giống là gì?</h3><p>Meo giống là 'hạt giống' của nấm, chứa các sợi tơ nấm đã phát triển trên một cơ chất (thường là hạt lúa, hạt ngô). Chất lượng meo giống quyết định trực tiếp đến sự thành bại của vụ nấm.</p><h3>Tiêu chuẩn chọn meo giống tốt:</h3><ul><li><strong>Nguồn gốc:</strong> Mua từ các trung tâm, cơ sở sản xuất meo giống uy tín, có địa chỉ rõ ràng.</li><li><strong>Cảm quan:</strong> Sợi tơ nấm phải mọc đều, trắng muốt, phủ kín cơ chất. Không có các đốm màu lạ (xanh, đen, cam) của nấm mốc. Meo giống có mùi thơm đặc trưng của nấm, không có mùi chua hoặc mùi lạ.</li><li><strong>Tuổi meo:</strong> Meo không quá non (tơ chưa phủ kín) hoặc quá già (tơ đã kết lại thành khối, chuyển màu vàng).</li></ul><h3>Bảo quản meo giống:</h3><p>Bảo quản meo ở nơi khô ráo, thoáng mát. Nếu cần bảo quản lâu hơn, có thể để trong ngăn mát tủ lạnh (nhiệt độ 4-10°C).</p>"
          },
          {
            "id": "mushroom-c1l3",
            "title": "Xử lý và thanh trùng nguyên liệu",
            "content": "<h3>Tại sao phải xử lý và thanh trùng?</h3><p>Mục đích là để làm mềm nguyên liệu, tạo độ ẩm thích hợp và quan trọng nhất là tiêu diệt tất cả các vi sinh vật cạnh tranh (nấm mốc, vi khuẩn) có trong nguyên liệu, tạo điều kiện thuận lợi tuyệt đối cho tơ nấm phát triển.</p><h3>Các bước thực hiện (đối với mùn cưa, rơm rạ):</h3><ol><li><strong>Làm ướt:</strong> Trộn đều nguyên liệu với nước vôi trong (để điều chỉnh pH) và các chất phụ gia (cám gạo, bột ngô). Đảo đều cho đến khi độ ẩm đạt khoảng 60-65% (bốc một nắm nguyên liệu vắt mạnh, nước chỉ rịn ra kẽ tay).</li><li><strong>Ủ đống:</strong> Đánh đống ủ nguyên liệu thành hình nón, cao 1-1.5m, dùng bạt che lại. Ủ trong 3-5 ngày, đảo trộn 1-2 lần. Quá trình này giúp các vi sinh vật lên men, làm mềm nguyên liệu.</li><li><strong>Thanh trùng:</strong> Đây là bước quan trọng nhất. Có thể thanh trùng bằng cách hấp cách thủy trong nồi hấp, lò hấp chuyên dụng ở nhiệt độ 100°C trong 8-10 giờ, hoặc luộc trong thùng phuy lớn.</li></ol>"
          }
        ]
      },
      {
        "title": "Chương 2: Trồng Nấm Bào Ngư",
        "lessons": [
          {
            "id": "mushroom-c2l1",
            "title": "Đóng bịch và cấy meo",
            "content": "<h3>Chuẩn bị:</h3><p>Nguyên liệu sau khi thanh trùng cần để nguội đến nhiệt độ phòng. Chuẩn bị túi nilon chịu nhiệt, cổ nút và bông không thấm nước.</p><h3>Thao tác:</h3><ol><li><strong>Đóng bịch:</strong> Cho nguyên liệu vào túi nilon, nén chặt vừa phải. Trọng lượng mỗi bịch khoảng 1.2 - 1.4kg.</li><li><strong>Tạo lỗ cấy meo:</strong> Dùng một cây gỗ tròn, sạch để tạo một lỗ ở giữa bịch, sâu khoảng 2/3 bịch.</li><li><strong>Cấy meo:</strong> Khều meo giống cho vào lỗ đã tạo. Thao tác phải nhanh và dứt khoát trong môi trường sạch sẽ để tránh nhiễm tạp.</li><li><strong>Đậy nút:</strong> Dùng bông gòn đậy chặt miệng bịch, sau đó dùng nắp đậy lại.</li></ol>"
          },
          {
            "id": "mushroom-c2l2",
            "title": "Giai đoạn ươm sợi và rạch bịch",
            "content": "<h3>Ươm sợi (nuôi tơ):</h3><p>Các bịch nấm sau khi cấy được chuyển vào nhà ươm. Nhà ươm cần đảm bảo: <ul><li><strong>Tối:</strong> Không cần ánh sáng, ánh sáng sẽ làm tơ kết lại sớm.</li><li><strong>Sạch sẽ, thoáng khí:</strong> Tránh gió lùa trực tiếp.</li><li><strong>Nhiệt độ:</strong> 25-30°C.</li></ul>Thời gian ươm kéo dài khoảng 25-30 ngày, cho đến khi tơ nấm ăn trắng đều khắp bịch.</p><h3>Rạch bịch:</h3><p>Khi tơ đã ăn trắng, dùng lưỡi dao lam sạch rạch 6-8 vết rạch xung quanh bịch để kích thích nấm ra quả thể. Sau khi rạch, chuyển các bịch nấm sang nhà trồng.</p>"
          },
          {
            "id": "mushroom-c2l3",
            "title": "Chăm sóc và thu hái nấm bào ngư",
            "content": "<h3>Điều kiện nhà trồng:</h3><ul><li><strong>Ánh sáng:</strong> Ánh sáng khuếch tán, có thể đọc sách được.</li><li><strong>Độ ẩm:</strong> Rất cao, khoảng 85-95%. Cần tưới phun sương nhiều lần trong ngày. Nền nhà luôn phải ẩm.</li><li><strong>Thông thoáng:</strong> Cần thông thoáng để thải khí CO2 do nấm hô hấp.</li></ul><h3>Thu hái:</h3><p>Sau khi rạch bịch khoảng 7-10 ngày, nấm sẽ bắt đầu mọc ra từ các vết rạch. Thu hoạch khi mũ nấm đã duỗi ra nhưng mép nấm vẫn còn hơi cụp vào. Dùng tay xoay nhẹ cả cụm nấm để hái, không dùng dao cắt vì phần chân còn lại sẽ gây thối bịch. Nấm bào ngư có thể cho thu hoạch 4-5 lứa.</p>"
          }
        ]
      },
      {
        "title": "Chương 3: Trồng Nấm Rơm",
        "lessons": [
          {
            "id": "mushroom-c3l1",
            "title": "Chuẩn bị mô rơm và cấy meo",
            "content": "<h3>Xử lý rơm:</h3><p>Rơm khô được làm ướt bằng nước vôi trong, sau đó vớt ra để ráo nước. Độ ẩm lý tưởng là khi nắm rơm trong tay bóp mạnh không thấy nước chảy ra.</p><h3>Chất mô (xếp luống):</h3><p>Rơm được xếp thành từng luống (mô) trên nền đất cao hoặc trên các kệ trong nhà trồng. Luống thường rộng khoảng 40-50cm, cao 30-40cm. Nén rơm vừa phải để giữ được độ thông thoáng.</p><h3>Cấy meo:</h3><p>Vò tơi meo giống và rắc đều xung quanh luống rơm, sau đó dùng một lớp rơm mỏng phủ lên trên. Cũng có thể cấy theo từng lớp khi chất mô.</p>"
          },
          {
            "id": "mushroom-c3l2",
            "title": "Chăm sóc giai đoạn tơ nấm",
            "content": "<h3>Ủ mô và đảo mô:</h3><p>Sau khi cấy, dùng nilon hoặc bạt che kín luống rơm để giữ nhiệt và độ ẩm, giúp tơ nấm phát triển. Nhiệt độ trong mô sẽ tăng lên. Sau 3-4 ngày, dỡ bạt ra để đảo nhiệt, sau đó đậy lại. Quá trình này giúp tơ nấm phát triển đều.</p><h3>Tưới nước đón nấm:</h3><p>Sau khoảng 7-8 ngày, khi tơ nấm đã ăn trắng, dỡ bạt ra hoàn toàn. Bắt đầu tưới nước dạng phun sương nhẹ nhàng lên bề mặt luống để kích thích nấm tạo quả thể. Giai đoạn này cần giữ ẩm liên tục.</p>"
          },
          {
            "id": "mushroom-c3l3",
            "title": "Thu hái và bảo quản nấm rơm",
            "content": "<h3>Thời điểm thu hoạch vàng:</h3><p>Nấm rơm cho chất lượng ngon nhất khi thu hoạch ở giai đoạn <strong>hình trứng (búp)</strong>, trước khi mũ nấm bung ra. Nên thu hái vào sáng sớm khi nấm còn cứng và tươi.</p><h3>Kỹ thuật hái:</h3><p>Dùng tay xoay nhẹ quả nấm để hái, tránh làm ảnh hưởng đến các nụ nấm nhỏ bên cạnh. Thu hái hàng ngày, có thể thu 2-3 đợt trong một vụ.</p><h3>Bảo quản:</h3><p>Nấm rơm rất nhanh hỏng. Sau khi hái, cần nhanh chóng làm sạch và bảo quản trong ngăn mát tủ lạnh (nhiệt độ 10-15°C), có thể giữ được 2-3 ngày. Để bảo quản lâu hơn, có thể chần qua nước sôi rồi cấp đông hoặc sấy khô.</p>"
          }
        ]
      },
      {
        "title": "Chương 4: Phòng trừ bệnh và thị trường",
        "lessons": [
          {
            "id": "mushroom-c4l1",
            "title": "Các bệnh thường gặp ở nấm",
            "content": "<h3>Nguyên nhân chính:</h3><p>Hầu hết các bệnh đều do khâu xử lý nguyên liệu và vệ sinh không đảm bảo, tạo điều kiện cho các vi sinh vật cạnh tranh phát triển.</p><h3>Các loại mốc phổ biến:</h3><ul><li><strong>Mốc xanh (Trichoderma, Penicillium):</strong> Rất phổ biến, cạnh tranh dinh dưỡng và ức chế sự phát triển của tơ nấm.</li><li><strong>Mốc đen (Aspergillus):</strong> Thường xuất hiện khi nguyên liệu quá ẩm.</li><li><strong>Mốc cam (Neurospora):</strong> Lây lan cực nhanh, rất khó xử lý.</li></ul><h3>Cách xử lý:</h3><p>Khi phát hiện bịch/mô nấm bị nhiễm mốc, cần nhanh chóng loại bỏ chúng ra khỏi khu vực nuôi trồng để tránh lây lan. Phòng bệnh là chính bằng cách đảm bảo vệ sinh và quy trình thanh trùng nguyên liệu nghiêm ngặt.</p>"
          },
          {
            "id": "mushroom-c4l2",
            "title": "Sơ chế và đóng gói",
            "content": "<h3>Sơ chế:</h3><p>Nấm sau khi thu hoạch cần được làm sạch, cắt bỏ phần chân nấm còn dính nguyên liệu. Không nên rửa nấm dưới vòi nước trực tiếp vì nấm sẽ hút nước, nhanh hỏng và mất vị ngon. Chỉ cần dùng khăn ẩm lau sạch nếu cần.</p><h3>Đóng gói:</h3><p>Có thể đóng gói nấm trong các khay xốp có màng bọc thực phẩm hoặc hút chân không để kéo dài thời gian bảo quản. Ghi rõ ngày thu hoạch trên bao bì.</p>"
          },
          {
            "id": "mushroom-c4l3",
            "title": "Tìm kiếm thị trường đầu ra",
            "content": "<h3>Các kênh tiêu thụ:</h3><ul><li><strong>Chợ địa phương:</strong> Kênh tiêu thụ truyền thống, dễ tiếp cận nhưng giá cả không ổn định.</li><li><strong>Nhà hàng, quán ăn:</strong> Nguồn tiêu thụ ổn định, yêu cầu chất lượng và sản lượng đều đặn.</li><li><strong>Siêu thị, cửa hàng thực phẩm sạch:</strong> Yêu cầu cao về mẫu mã, bao bì, truy xuất nguồn gốc nhưng giá bán tốt hơn.</li><li><strong>Chế biến sâu:</strong> Sấy khô, làm ruốc nấm, làm snack... để tạo ra sản phẩm có giá trị gia tăng và thời gian bảo quản lâu dài.</li></ul>"
          }
        ]
      }
    ]
  },
  "drone-course-v1": {
    "title": "Ứng dụng Drone trong nông nghiệp",
    "meta": {
      "expert": "Kỹ sư AI Nguyễn Phi Hùng",
      "field": "Nông nghiệp công nghệ cao",
      "duration": "8 giờ"
    },
    "image": "https://images.unsplash.com/photo-1621358944805-40a413342217?q=80&w=1932&auto=format&fit=crop",
    "imageAlt": "Drone đang phun thuốc trên cánh đồng lúa",
    "sapo": "Tìm hiểu và làm chủ công nghệ sử dụng máy bay không người lái (drone) để phun thuốc, bón phân, và khảo sát sức khỏe cây trồng.",
    "quizUrl": null,
    "chapters": [
      {
        "title": "Chương 1: Tổng quan về Drone nông nghiệp",
        "lessons": [
          {
            "id": "drone-c1l1",
            "title": "Lợi ích của Drone trong nông nghiệp",
            "content": "<h3>Cuộc cách mạng từ trên không:</h3><p>Drone nông nghiệp không chỉ là một thiết bị bay, mà là một công cụ mạnh mẽ giúp tối ưu hóa sản xuất.</p><ul><li><strong>Tiết kiệm thời gian và nhân công:</strong> Một drone có thể phun thuốc cho 1 hecta chỉ trong 10-15 phút, công việc mà trước đây cần nhiều giờ và nhiều nhân công.</li><li><strong>Tiết kiệm chi phí:</strong> Drone giúp tiết kiệm tới 30% lượng thuốc BVTV và 90% lượng nước nhờ vào công nghệ phun ly tâm, tạo ra các hạt sương siêu nhỏ bám đều trên cây.</li><li><strong>Bảo vệ sức khỏe nông dân:</strong> Người nông dân không còn phải tiếp xúc trực tiếp với hóa chất độc hại.</li><li><strong>Tăng năng suất:</strong> Phun thuốc đồng đều và kịp thời, kết hợp với việc phát hiện sớm sâu bệnh giúp bảo vệ mùa màng và tăng năng suất cây trồng.</li><li><strong>Hoạt động linh hoạt:</strong> Drone có thể hoạt động trên mọi địa hình, từ đồng bằng đến đồi núi, và vào cả ban đêm.</li></ul>"
          },
          {
            "id": "drone-c1l2",
            "title": "Các loại Drone và tính năng",
            "content": "<h3>Phân loại theo chức năng:</h3><p>Có hai loại drone nông nghiệp chính:</p><ul><li><strong>Drone phun thuốc (Spraying Drones):</strong> Đây là loại phổ biến nhất. Chúng được trang bị bình chứa dung dịch (thuốc BVTV, phân bón lá), hệ thống bơm và vòi phun. Các mẫu hiện đại có dung tích bình từ 10 lít, 20 lít đến 50 lít, với radar phát hiện vật cản và khả năng bay hoàn toàn tự động.</li><li><strong>Drone quan trắc (Mapping Drones):</strong> Được trang bị các camera chuyên dụng.<ul><li><strong>Camera RGB:</strong> Chụp ảnh thông thường để tạo bản đồ 2D, 3D của trang trại.</li><li><strong>Camera đa phổ (Multispectral):</strong> Ghi lại các dải ánh sáng mà mắt người không thấy được (như cận hồng ngoại) để phân tích sức khỏe cây trồng thông qua các chỉ số như NDVI.</li></ul></li></ul>"
          },
          {
            "id": "drone-c1l3",
            "title": "Quy định pháp lý về sử dụng Drone",
            "content": "<h3>Những điều cần biết trước khi bay:</h3><p>Việc sử dụng drone tại Việt Nam chịu sự quản lý của Bộ Quốc phòng. Để bay hợp pháp, người dùng cần tuân thủ:</p><ul><li><strong>Đăng ký thiết bị:</strong> Tất cả các drone có trọng lượng cất cánh từ 2kg trở lên đều phải được đăng ký.</li><li><strong>Xin giấy phép bay:</strong> Trước mỗi lần thực hiện bay, dù là bay dịch vụ hay bay cho trang trại của mình, đều phải làm đơn xin cấp phép bay gửi đến Cục Tác chiến - Bộ Tổng tham mưu. Đơn xin phép cần nêu rõ thông tin người điều khiển, thông tin thiết bị, khu vực bay, độ cao và thời gian bay.</li><li><strong>Vùng cấm bay:</strong> Tuyệt đối không bay trong các khu vực cấm và hạn chế bay, bao gồm các khu vực quân sự, sân bay, cơ quan nhà nước, và các công trình quan trọng về an ninh quốc gia.</li></ul><p>Vi phạm các quy định này có thể bị xử phạt hành chính nặng, thậm chí bị tịch thu thiết bị.</p>"
          }
        ]
      },
      {
        "title": "Chương 2: Kỹ thuật vận hành",
        "lessons": [
          {
            "id": "drone-c2l1",
            "title": "An toàn bay và bảo trì cơ bản",
            "content": "<h3>Checklist trước mỗi chuyến bay:</h3><ol><li>Kiểm tra tình trạng vật lý của drone: Cánh quạt không bị nứt, gãy; các càng đáp chắc chắn.</li><li>Kiểm tra pin: Pin phải được sạc đầy, không bị phồng, biến dạng.</li><li>Kiểm tra bộ điều khiển: Pin tay cầm đã được sạc đầy.</li><li>Khởi động drone và kiểm tra tín hiệu GPS: Đảm bảo drone đã bắt đủ vệ tinh (thường là trên 10 vệ tinh) để bay ổn định.</li><li>Kiểm tra khu vực bay: Không có vật cản cao, không có người hoặc động vật trong khu vực cất/hạ cánh.</li></ol><h3>Bảo trì cơ bản:</h3><p>Sau mỗi ngày bay, cần dùng khăn mềm và dung dịch chuyên dụng để lau sạch bụi bẩn, hóa chất bám trên thân drone. Thường xuyên kiểm tra và cập nhật firmware (phần mềm điều khiển) cho cả drone và tay cầm để đảm bảo hoạt động ổn định.</p>"
          },
          {
            "id": "drone-c2l2",
            "title": "Thiết lập đường bay tự động",
            "content": "<h3>Sức mạnh của tự động hóa:</h3><p>Hầu hết các drone nông nghiệp hiện nay đều hoạt động tự động. Người điều khiển chỉ cần thiết lập trên ứng dụng điện thoại hoặc máy tính bảng.</p><h3>Các bước thiết lập:</h3><ol><li><strong>Khảo sát thực địa:</strong> Đi bộ một vòng quanh ranh giới của thửa ruộng cần phun. Ứng dụng sẽ tự động vẽ lại bản đồ khu vực làm việc.</li><li><strong>Thiết lập thông số:</strong><ul><li><strong>Độ cao bay:</strong> Khoảng cách từ drone đến ngọn cây (ví dụ 2-4m).</li><li><strong>Tốc độ bay:</strong> Tốc độ di chuyển của drone.</li><li><strong>Độ rộng phun:</strong> Khoảng cách giữa hai đường bay song song.</li><li><strong>Liều lượng phun:</strong> Lượng dung dịch cần phun trên một đơn vị diện tích (ví dụ 10 lít/ha).</li></ul></li><li><strong>Tải nhiệm vụ:</strong> Sau khi thiết lập xong, nhấn nút 'Bắt đầu'. Drone sẽ tự động cất cánh, bay theo đường bay đã vạch sẵn và phun thuốc. Khi hết thuốc hoặc hết pin, nó sẽ tự bay về điểm cất cánh. Sau khi thay pin/thêm thuốc, nó sẽ tự bay trở lại đúng vị trí đã dừng để tiếp tục công việc.</li></ol>"
          },
          {
            "id": "drone-c2l3",
            "title": "Kỹ thuật phun thuốc hiệu quả",
            "content": "<h3>Nguyên lý phun ly tâm:</h3><p>Drone nông nghiệp không dùng béc phun truyền thống. Thay vào đó, dung dịch được đưa vào một đĩa quay với tốc độ rất cao, lực ly tâm sẽ xé nhỏ giọt nước thành các hạt sương có kích thước siêu nhỏ (micron). Luồng gió mạnh từ cánh quạt của drone sẽ ép các hạt sương này xuống, bám đều vào cả mặt trên và mặt dưới của lá cây, tăng hiệu quả của thuốc.</p><h3>Lưu ý khi phun:</h3><ul><li><strong>Thời điểm phun:</strong> Nên phun vào lúc trời mát, không có gió hoặc gió nhẹ (sáng sớm, chiều tối) để tránh thuốc bị bay hơi hoặc trôi dạt (drift) sang khu vực khác.</li><li><strong>Pha thuốc:</strong> Luôn tuân thủ nguyên tắc pha thuốc. Đổ nước vào bình trước, sau đó mới cho thuốc vào và khuấy đều. Sử dụng các chất phụ gia, chất bám dính để tăng hiệu quả.</li></ul>"
          }
        ]
      },
      {
        "title": "Chương 3: Phân tích dữ liệu ảnh",
        "lessons": [
          {
            "id": "drone-c3l1",
            "title": "Thu thập dữ liệu ảnh đa phổ",
            "content": "<h3>Ngoài tầm nhìn của mắt người:</h3><p>Mắt người chỉ nhìn thấy dải ánh sáng khả kiến (Đỏ, Lục, Lam - RGB). Cây trồng khỏe mạnh và cây bị bệnh có thể trông giống nhau ở giai đoạn đầu. Tuy nhiên, chúng phản xạ các loại ánh sáng khác nhau, đặc biệt là ánh sáng cận hồng ngoại (Near-Infrared - NIR).</p><h3>Camera đa phổ:</h3><p>Camera đa phổ trên drone có thể ghi lại được nhiều dải ánh sáng cùng lúc, bao gồm cả RGB và NIR. Dữ liệu này sau đó được sử dụng để tính toán các chỉ số thực vật, giúp 'nhìn thấu' sức khỏe của cây trồng mà mắt thường không thể thấy được.</p>"
          },
          {
            "id": "drone-c3l2",
            "title": "Sử dụng chỉ số NDVI để đánh giá sức khỏe cây",
            "content": "<h3>NDVI là gì?</h3><p><strong>NDVI (Normalized Difference Vegetation Index)</strong> là chỉ số sức khỏe thực vật phổ biến nhất. Nó được tính toán dựa trên sự khác biệt giữa lượng ánh sáng cận hồng ngoại (NIR) và ánh sáng đỏ (Red) mà cây trồng phản xạ lại.</p><ul><li><strong>Cây khỏe mạnh:</strong> Diệp lục trong lá hấp thụ mạnh ánh sáng đỏ và phản xạ rất mạnh ánh sáng cận hồng ngoại. Do đó, cây khỏe có chỉ số NDVI cao (gần +1).</li><li><strong>Cây yếu, bị bệnh:</strong> Khả năng quang hợp kém, hấp thụ ít ánh sáng đỏ và phản xạ ít ánh sáng cận hồng ngoại hơn. Do đó, cây yếu có chỉ số NDVI thấp.</li><li><strong>Đất trống:</strong> Có chỉ số NDVI gần bằng 0.</li></ul>"
          },
          {
            "id": "drone-c3l3",
            "title": "Tạo bản đồ sức khỏe cây trồng",
            "content": "<h3>Từ ảnh đến bản đồ thông minh:</h3><p>Sau khi drone quan trắc bay xong, các phần mềm chuyên dụng sẽ thực hiện các công việc sau:</p><ol><li><strong>Ghép ảnh (Stitching):</strong> Ghép hàng trăm, hàng nghìn bức ảnh nhỏ lại thành một bản đồ lớn, duy nhất của toàn bộ khu vực.</li><li><strong>Tính toán NDVI:</strong> Tính toán chỉ số NDVI cho từng pixel trên bản đồ.</li><li><strong>Tô màu bản đồ:</strong> Gán màu sắc cho các giá trị NDVI. Thường thì màu xanh lá đậm biểu thị cây rất khỏe (NDVI cao), màu vàng biểu thị cây có vấn đề, và màu đỏ biểu thị khu vực cây rất yếu hoặc đất trống (NDVI thấp).</li></ol><p>Kết quả là một 'bản đồ sức khỏe' trực quan, giúp người nông dân nhanh chóng xác định chính xác các khu vực có vấn đề trong trang trại để đi kiểm tra và xử lý kịp thời, thay vì phải đi bộ kiểm tra toàn bộ một cách mò mẫm.</p>"
          }
        ]
      },
      {
        "title": "Chương 4: Hiệu quả kinh tế",
        "lessons": [
          {
            "id": "drone-c4l1",
            "title": "Phân tích chi phí và lợi ích",
            "content": "<h3>Chi phí đầu tư:</h3><p>Chi phí ban đầu để mua một bộ drone nông nghiệp có thể dao động từ 200 triệu đến hơn 500 triệu đồng, tùy thuộc vào dung tích bình chứa và công nghệ. Ngoài ra còn có chi phí pin dự phòng, bảo trì và xin cấp phép bay.</p><h3>Lợi ích kinh tế:</h3><p>Mặc dù chi phí đầu tư cao, lợi ích mang lại rất đáng kể:</p><ul><li><strong>Giảm chi phí vật tư:</strong> Tiết kiệm 20-30% chi phí thuốc BVTV, phân bón lá.</li><li><strong>Giảm chi phí nhân công:</strong> Thay thế cho nhiều lao động phun thuốc thủ công.</li><li><strong>Tăng năng suất:</strong> Bảo vệ cây trồng tốt hơn, ước tính tăng năng suất từ 10-15%.</li><li><strong>Làm dịch vụ:</strong> Có thể dùng drone để làm dịch vụ phun thuê cho các trang trại lân cận, tạo thêm nguồn thu nhập.</li></ul><p>Thời gian hoàn vốn cho một drone nông nghiệp thường từ 1 đến 2 năm, tùy thuộc vào diện tích canh tác và tần suất sử dụng.</p>"
          },
          {
            "id": "drone-c4l2",
            "title": "Mô hình kinh doanh dịch vụ Drone",
            "content": "<h3>Các mô hình phổ biến:</h3><ul><li><strong>Dịch vụ phun thuốc thuê:</strong> Đây là mô hình phổ biến nhất. Các đội bay sẽ cung cấp dịch vụ phun thuốc, bón phân, gieo sạ cho nông dân và tính phí trên mỗi hecta.</li><li><strong>Dịch vụ khảo sát và phân tích:</strong> Sử dụng drone quan trắc để tạo bản đồ sức khỏe cây trồng, sau đó bán báo cáo phân tích và tư vấn giải pháp cho các trang trại lớn hoặc công ty nông nghiệp.</li><li><strong>Kết hợp cả hai:</strong> Cung cấp một gói dịch vụ toàn diện từ khảo sát, phát hiện vấn đề đến phun thuốc xử lý.</li></ul>"
          },
          {
            "id": "drone-c4l3",
            "title": "Tương lai của Drone trong nông nghiệp",
            "content": "<h3>Những xu hướng sắp tới:</h3><ul><li><strong>Drone tự hành thông minh hơn (AI on the edge):</strong> Drone có khả năng tự phân tích hình ảnh và đưa ra quyết định phun thuốc ngay lập tức mà không cần gửi dữ liệu về máy chủ.</li><li><strong>Hoạt động theo bầy (Drone Swarms):</strong> Nhiều drone cùng hoạt động trên một cánh đồng lớn, phối hợp với nhau để hoàn thành công việc nhanh hơn.</li><li><strong>Tích hợp IoT:</strong> Drone sẽ kết hợp dữ liệu từ các cảm biến mặt đất (độ ẩm đất, nhiệt độ) để đưa ra quyết định tưới tiêu hoặc bón phân chính xác hơn.</li><li><strong>Drone đa chức năng:</strong> Một drone có thể vừa phun thuốc, vừa rải phân bón dạng rắn, vừa gieo hạt, giúp tối ưu hóa đầu tư.</li></ul><p>Công nghệ drone đang phát triển không ngừng và sẽ tiếp tục là một phần không thể thiếu của nền nông nghiệp chính xác trong tương lai.</p>"
          }
        ]
      }
    ]
  },
  "iot-course-v1": {
    "title": "Cảm biến IoT và Nông nghiệp chính xác",
    "meta": {
      "expert": "Chuyên gia công nghệ Đinh Quang Huy",
      "field": "Nông nghiệp công nghệ cao",
      "duration": "9 giờ"
    },
    "image": "https://images.unsplash.com/photo-1544795594-279376662489?q=80&w=2070&auto=format&fit=crop",
    "imageAlt": "Một nông dân đang kiểm tra dữ liệu trên máy tính bảng trong trang trại",
    "sapo": "Học cách ứng dụng các cảm biến IoT để theo dõi độ ẩm đất, nhiệt độ, ánh sáng và tự động hóa hệ thống tưới tiêu, bón phân.",
    "quizUrl": null,
    "chapters": [
      {
        "title": "Chương 1: Giới thiệu về IoT nông nghiệp",
        "lessons": [
          {
            "id": "iot-c1l1",
            "title": "IoT là gì và vai trò trong nông nghiệp?",
            "content": "<h3>IoT là gì?</h3><p>IoT (Internet of Things - Mạng lưới vạn vật kết nối) là một mạng lưới các thiết bị vật lý (gọi là 'vật'), được gắn cảm biến, phần mềm và các công nghệ khác cho phép chúng kết nối và trao đổi dữ liệu với nhau qua Internet.</p><h3>Vai trò trong Nông nghiệp (Agriculture 4.0):</h3><p>Trong nông nghiệp, IoT biến trang trại truyền thống thành một 'trang trại thông minh'. Nó cho phép chúng ta:</p><ul><li><strong>Thu thập dữ liệu thời gian thực:</strong> Thay vì phỏng đoán, chúng ta có thể biết chính xác nhiệt độ, độ ẩm đất, cường độ ánh sáng, độ pH... tại bất kỳ thời điểm nào.</li><li><strong>Giám sát từ xa:</strong> Người nông dân có thể theo dõi toàn bộ trang trại của mình qua điện thoại thông minh hoặc máy tính mà không cần phải có mặt trực tiếp.</li><li><strong>Tự động hóa:</strong> Dựa trên dữ liệu thu thập được, hệ thống có thể tự động ra quyết định, ví dụ: tự động bật máy bơm khi đất khô, tự động kéo lưới che khi trời quá nắng.</li><li><strong>Nông nghiệp chính xác:</strong> Cung cấp đúng thứ cây cần, vào đúng thời điểm và đúng vị trí. Ví dụ: chỉ tưới nước cho khu vực đất khô, thay vì tưới cả cánh đồng. Điều này giúp tiết kiệm tài nguyên (nước, phân bón) và tăng năng suất.</li></ul>"
          },
          {
            "id": "iot-c1l2",
            "title": "Các loại cảm biến phổ biến",
            "content": "<h3>Cảm biến là 'giác quan' của trang trại thông minh:</h3><p>Mỗi loại cảm biến đóng vai trò như một giác quan, giúp thu thập một loại dữ liệu cụ thể.</p><ul><li><strong>Cảm biến độ ẩm đất (Soil Moisture Sensor):</strong> Đo lường lượng nước có trong đất, giúp quyết định khi nào cần tưới và tưới bao nhiêu là đủ.</li><li><strong>Cảm biến nhiệt độ và độ ẩm không khí (Temperature & Humidity Sensor):</strong> Theo dõi điều kiện vi khí hậu trong nhà kính hoặc ngoài trời, rất quan trọng để phòng ngừa nấm bệnh và stress nhiệt cho cây.</li><li><strong>Cảm biến ánh sáng (Light Sensor):</strong> Đo cường độ ánh sáng, giúp điều khiển hệ thống che nắng hoặc đèn chiếu sáng bổ sung.</li><li><strong>Cảm biến pH đất:</strong> Đo độ chua/kiềm của đất, giúp điều chỉnh việc bón vôi hoặc các chất cải tạo đất.</li><li><strong>Cảm biến NPK:</strong> Đo hàm lượng các chất dinh dưỡng đa lượng chính trong đất (Đạm, Lân, Kali), giúp bón phân chính xác hơn.</li></ul>"
          },
          {
            "id": "iot-c1l3",
            "title": "Kiến trúc một hệ thống IoT",
            "content": "<h3>Một hệ thống IoT nông nghiệp hoàn chỉnh gồm 4 lớp:</h3><ol><li><strong>Lớp 1: Thiết bị (Things/Devices):</strong> Chính là các cảm biến được đặt tại hiện trường để thu thập dữ liệu (độ ẩm, nhiệt độ...) và các thiết bị chấp hành (máy bơm, van điện từ, quạt...).</li><li><strong>Lớp 2: Cổng kết nối (Gateway):</strong> Là thiết bị trung gian, có nhiệm vụ thu thập dữ liệu từ tất cả các cảm biến và gửi lên Internet. Nó có thể kết nối qua Wifi, 3G/4G, hoặc sóng LoRaWAN.</li><li><strong>Lớp 3: Nền tảng đám mây (Cloud Platform):</strong> Là 'bộ não' của hệ thống. Dữ liệu từ gateway sẽ được gửi lên đây để lưu trữ, xử lý, và phân tích.</li><li><strong>Lớp 4: Ứng dụng (Application):</strong> Là giao diện mà người dùng tương tác, thường là một ứng dụng trên điện thoại hoặc một trang web. Người dùng xem biểu đồ dữ liệu, nhận cảnh báo và ra lệnh điều khiển các thiết bị từ xa qua ứng dụng này.</li></ol>"
          }
        ]
      },
      {
        "title": "Chương 2: Lắp đặt và Cấu hình",
        "lessons": [
          {
            "id": "iot-c2l1",
            "title": "Lắp đặt cảm biến độ ẩm đất",
            "content": "<h3>Vị trí lắp đặt:</h3><p>Vị trí đặt cảm biến quyết định tính chính xác của dữ liệu. Cần đặt cảm biến ở vị trí đại diện cho toàn khu vực. Cắm đầu dò của cảm biến xuống đất, đảm bảo nó tiếp xúc hoàn toàn với đất ở độ sâu của vùng rễ chính của cây trồng (thường là 15-20 cm).</p><h3>Lưu ý:</h3><ul><li>Tránh đặt cảm biến quá gần hoặc quá xa gốc cây.</li><li>Tránh những nơi đất bị nén chặt hoặc quá tơi xốp bất thường.</li><li>Trong một khu vực lớn, nên đặt nhiều cảm biến ở các vị trí khác nhau để có dữ liệu trung bình chính xác hơn.</li></ul>"
          },
          {
            "id": "iot-c2l2",
            "title": "Kết nối cảm biến với bộ điều khiển trung tâm",
            "content": "<h3>Bộ điều khiển trung tâm (Gateway):</h3><p>Gateway thường là một bo mạch như Raspberry Pi, Arduino kết hợp với các module truyền sóng (Wifi, LoRa...). Các cảm biến sẽ được nối dây đến gateway này.</p><h3>Phương thức kết nối:</h3><ul><li><strong>Kết nối có dây:</strong> Đơn giản, ổn định nhưng bị giới hạn về khoảng cách. Phù hợp cho quy mô nhỏ như vườn trên sân thượng.</li><li><strong>Kết nối không dây (LoRa, Zigbee):</strong> Cho phép kết nối các cảm biến ở khoảng cách xa (vài km đối với LoRa) mà không cần dây dẫn, rất phù hợp cho các trang trại lớn. Các cảm biến sẽ có pin riêng và gửi dữ liệu về gateway theo chu kỳ.</li></ul>"
          },
          {
            "id": "iot-c2l3",
            "title": "Thiết lập phần mềm theo dõi",
            "content": "<h3>Các nền tảng IoT phổ biến:</h3><p>Có nhiều nền tảng cho phép bạn xây dựng giao diện điều khiển mà không cần biết lập trình nhiều, ví dụ như Blynk, ThingsBoard, AWS IoT, Azure IoT.</p><h3>Các bước cơ bản:</h3><ol><li><strong>Tạo tài khoản:</strong> Đăng ký một tài khoản trên nền tảng bạn chọn.</li><li><strong>Tạo 'Thiết bị ảo' (Virtual Device):</strong> Tạo một thiết bị ảo trên nền tảng, nó sẽ cấp cho bạn một 'Mã xác thực' (Authentication Token).</li><li><strong>Lập trình cho Gateway:</strong> Nạp một đoạn mã vào gateway để nó đọc dữ liệu từ cảm biến và gửi lên nền tảng đám mây bằng Mã xác thực đã được cấp.</li><li><strong>Thiết kế giao diện:</strong> Trên ứng dụng điện thoại hoặc trang web của nền tảng, bạn có thể kéo-thả các 'widget' như biểu đồ, đồng hồ đo, nút bấm để hiển thị dữ liệu từ cảm biến và tạo các nút điều khiển thiết bị.</li></ol>"
          }
        ]
      },
      {
        "title": "Chương 3: Tự động hóa",
        "lessons": [
          {
            "id": "iot-c3l1",
            "title": "Tự động hóa hệ thống tưới nhỏ giọt",
            "content": "<h3>Kịch bản tự động hóa:</h3><p>Đây là ứng dụng phổ biến và hiệu quả nhất của IoT trong nông nghiệp.</p><h3>Logic hoạt động:</h3><ol><li>Cảm biến độ ẩm đất liên tục đo và gửi dữ liệu về bộ điều khiển.</li><li>Người dùng thiết lập một ngưỡng độ ẩm, ví dụ: 'Nếu độ ẩm đất < 40%, thì BẬT máy bơm'.</li><li>Bộ điều khiển sẽ so sánh dữ liệu thực tế với ngưỡng đã cài đặt.</li><li>Khi độ ẩm xuống dưới 40%, bộ điều khiển sẽ tự động gửi tín hiệu để bật rơ-le (relay), cấp điện cho máy bơm nước.</li><li>Có thể thiết lập thêm: 'Sau khi bật máy bơm 15 phút, thì TẮT'.</li></ol><p>Hệ thống này giúp cây luôn đủ nước, không bị khô héo hay úng nước, đồng thời tiết kiệm tối đa nước và công lao động.</p>"
          },
          {
            "id": "iot-c3l2",
            "title": "Tự động điều khiển quạt, mái che",
            "content": "<h3>Ứng dụng trong nhà kính:</h3><p>Kiểm soát vi khí hậu là yếu tố then chốt trong nhà kính.</p><ul><li><strong>Tự động làm mát:</strong> Cảm biến nhiệt độ và độ ẩm không khí được đặt trong nhà kính. Khi nhiệt độ vượt quá ngưỡng cài đặt (ví dụ: > 35°C), hệ thống sẽ tự động bật quạt thông gió và hệ thống làm mát bằng hơi nước (dàn mát).</li><li><strong>Tự động che nắng:</strong> Cảm biến cường độ ánh sáng được đặt bên ngoài. Khi cường độ ánh sáng quá mạnh, hệ thống sẽ tự động điều khiển motor để kéo lưới che nắng ra, và tự động thu lại khi trời dịu mát.</li></ul><p>Việc này giúp giảm stress cho cây trồng và tạo môi trường sinh trưởng tối ưu.</p>"
          },
          {
            "id": "iot-c3l3",
            "title": "Cảnh báo sớm qua điện thoại",
            "content": "<h3>Giám sát trang trại 24/7:</h3><p>Một trong những lợi ích lớn của IoT là khả năng cảnh báo ngay lập tức khi có sự cố, giúp người nông dân phản ứng kịp thời dù đang ở bất cứ đâu.</p><h3>Các loại cảnh báo có thể thiết lập:</h3><ul><li><strong>Cảnh báo môi trường:</strong> 'Nhiệt độ trong nhà kính quá cao', 'Độ ẩm đất quá thấp', 'Mất điện'.</li><li><strong>Cảnh báo an ninh:</strong> Kết hợp với cảm biến chuyển động hoặc cảm biến cửa, hệ thống có thể gửi cảnh báo 'Phát hiện có sự xâm nhập trái phép'.</li><li><strong>Cảnh báo vận hành:</strong> 'Máy bơm đã chạy được 30 phút', 'Bồn chứa dinh dưỡng sắp cạn'.</li></ul><p>Các cảnh báo này được gửi qua tin nhắn đẩy (push notification) trên ứng dụng điện thoại, email hoặc thậm chí là cuộc gọi tự động.</p>"
          }
        ]
      },
      {
        "title": "Chương 4: Phân tích dữ liệu",
        "lessons": [
          {
            "id": "iot-c4l1",
            "title": "Đọc và hiểu biểu đồ dữ liệu",
            "content": "<h3>Dữ liệu là vàng:</h3><p>Dữ liệu do cảm biến thu thập sẽ được lưu trữ và biểu diễn dưới dạng biểu đồ theo thời gian. Việc phân tích biểu đồ này giúp chúng ta hiểu sâu hơn về trang trại của mình.</p><h3>Ví dụ phân tích biểu đồ độ ẩm đất:</h3><ul><li>Nếu biểu đồ dốc xuống quá nhanh, chứng tỏ đất thoát nước tốt nhưng cũng nhanh khô, cần tưới nhiều lần với lượng nước ít hơn.</li><li>Nếu biểu đồ đi ngang ở mức cao trong thời gian dài sau khi tưới, chứng tỏ đất bị úng, cần cải thiện hệ thống thoát nước.</li><li>So sánh biểu đồ độ ẩm với biểu đồ nhiệt độ và ánh sáng giúp hiểu rõ mối tương quan và sự bốc hơi nước.</li></ul>"
          },
          {
            "id": "iot-c4l2",
            "title": "Ra quyết định dựa trên dữ liệu",
            "content": "<h3>Từ dữ liệu đến hành động:</h3><p>IoT giúp chuyển từ việc canh tác dựa trên kinh nghiệm ('Tôi nghĩ là đất khô rồi') sang canh tác dựa trên bằng chứng ('Dữ liệu cho thấy độ ẩm đất là 35%, cần phải tưới').</p><h3>Các quyết định có thể được cải thiện:</h3><ul><li><strong>Tưới tiêu:</strong> Tưới khi nào, tưới bao nhiêu, tưới vào thời điểm nào trong ngày để hiệu quả nhất.</li><li><strong>Bón phân:</strong> Dựa vào cảm biến NPK và pH, quyết định loại phân cần bón và liều lượng.</li><li><strong>Phòng bệnh:</strong> Dựa vào dữ liệu nhiệt độ và độ ẩm, có thể dự báo nguy cơ bùng phát của một số loại nấm bệnh để phun thuốc phòng ngừa chủ động.</li></ul>"
          },
          {
            "id": "iot-c4l3",
            "title": "Tích hợp IoT và AI",
            "content": "<h3>Bước tiến tiếp theo của Nông nghiệp thông minh:</h3><p>Khi đã có một lượng lớn dữ liệu lịch sử từ các cảm biến IoT, chúng ta có thể ứng dụng Trí tuệ nhân tạo (AI) và Học máy (Machine Learning) để làm những điều tuyệt vời hơn.</p><ul><li><strong>Dự báo:</strong> AI có thể phân tích dữ liệu thời tiết, độ ẩm đất, và giai đoạn sinh trưởng của cây để dự báo chính xác nhu cầu nước của cây trong vài ngày tới, hoặc dự báo thời điểm thu hoạch tối ưu.</li><li><strong>Chẩn đoán bệnh sớm:</strong> Kết hợp dữ liệu từ cảm biến với hình ảnh từ camera hoặc drone, AI có thể phát hiện các dấu hiệu bệnh tật trên cây trồng ở giai đoạn rất sớm, trước cả khi mắt người có thể nhận ra.</li><li><strong>Tối ưu hóa toàn diện:</strong> AI có thể phân tích tất cả các yếu tố đầu vào (giống, phân bón, nước, thời tiết) và kết quả đầu ra (năng suất, chất lượng) qua nhiều vụ để tìm ra một 'công thức' canh tác tối ưu nhất cho trang trại của bạn.</li></ul>"
          }
        ]
      }
    ]
  },
  "cashew-course-v1": {
    "title": "Thâm canh và Chế biến Điều",
    "meta": {
      "expert": "KS. Nguyễn Thế Vinh",
      "field": "Cây công nghiệp",
      "duration": "8 giờ"
    },
    "image": "https://images.unsplash.com/photo-1620706857373-53470373e274?q=80&w=2070&auto=format&fit=crop",
    "imageAlt": "Hạt điều và quả điều",
    "sapo": "Quy trình kỹ thuật trồng, chăm sóc, thu hoạch cây điều và các phương pháp chế biến hạt điều nhân chất lượng cao.",
    "quizUrl": null,
    "chapters": [
      {
        "title": "Chương 1: Trồng và Chăm sóc",
        "lessons": [
          {
            "id": "cashew-c1l1",
            "title": "Chọn giống và kỹ thuật trồng",
            "content": "<h3>Chọn giống:</h3><p>Nên chọn các giống điều ghép cao sản đã được công nhận như AB29, AB0508, PN1... Các giống này có ưu điểm ra hoa đậu quả sớm, năng suất cao (1.5-3 tấn/ha), hạt to, tỷ lệ nhân cao.</p><p>Cây giống phải khỏe mạnh, sạch bệnh, có chiều cao từ 60cm trở lên và mắt ghép đã liền tốt.</p><h3>Kỹ thuật trồng:</h3><ul><li><strong>Thời vụ:</strong> Trồng vào đầu mùa mưa (tháng 5-7) là tốt nhất.</li><li><strong>Mật độ:</strong> Trồng với khoảng cách 8m x 6m hoặc 10m x 5m (khoảng 200-250 cây/ha).</li><li><strong>Chuẩn bị hố:</strong> Đào hố 50x50x50 cm, bón lót bằng 10-15kg phân chuồng hoai mục + 0.5kg lân. Trộn đều và lấp hố trước 1 tháng.</li><li><strong>Trồng cây:</strong> Đặt bầu cây vào hố, lấp đất và tưới đẫm nước. Cần tủ gốc để giữ ẩm cho cây con.</li></ul>"
          },
          {
            "id": "cashew-c1l2",
            "title": "Bón phân và tỉa cành tạo tán",
            "content": "<h3>Bón phân:</h3><ul><li><strong>Giai đoạn kiến thiết (1-3 năm):</strong> Bón NPK có hàm lượng đạm cao để cây phát triển thân lá. Lượng bón tăng dần từ 0.5kg đến 1.5kg/cây/năm, chia làm 2-3 lần bón vào đầu và cuối mùa mưa.</li><li><strong>Giai đoạn kinh doanh:</strong> Bón 2-4kg NPK/cây/năm, tăng hàm lượng Kali để tăng tỷ lệ đậu quả và chất lượng hạt. Kết hợp bón 20-30kg phân hữu cơ/gốc sau khi thu hoạch.</li></ul><h3>Tỉa cành tạo tán:</h3><p>Tỉa cành là biện pháp kỹ thuật quan trọng để tạo bộ tán thông thoáng, hạn chế sâu bệnh và tăng năng suất. Cần tỉa bỏ các cành mọc yếu, cành vượt, cành bị sâu bệnh, cành mọc quá dày trong tán. Công việc này nên được thực hiện sau khi thu hoạch xong.</p>"
          },
          {
            "id": "cashew-c1l3",
            "title": "Phòng trừ sâu bệnh hại điều",
            "content": "<h3>Các đối tượng gây hại chính:</h3><ul><li><strong>Bọ xít muỗi:</strong> Là đối tượng nguy hiểm nhất, chích hút chồi non, lá non, hoa và quả non làm chúng bị khô đen và rụng. Phòng trừ bằng cách vệ sinh vườn thông thoáng, bảo vệ thiên địch (kiến vàng) và phun thuốc khi mật độ bọ xít cao.</li><li><strong>Sâu đục thân/cành:</strong> Gây hại nặng làm cành hoặc cả cây bị chết khô. Cần thường xuyên kiểm tra vườn, phát hiện và tiêu diệt sâu non.</li><li><strong>Bệnh thán thư:</strong> Gây hại trên lá, hoa và quả, đặc biệt trong mùa mưa ẩm ướt. Phòng trừ bằng cách tỉa cành thông thoáng và phun các loại thuốc gốc đồng hoặc Mancozeb.</li></ul>"
          }
        ]
      },
      {
        "title": "Chương 2: Thu hoạch",
        "lessons": [
          {
            "id": "cashew-c2l1",
            "title": "Xác định thời điểm thu hoạch",
            "content": "<h3>Dấu hiệu nhận biết:</h3><p>Cây điều cho thu hoạch sau khoảng 3 năm trồng. Mùa thu hoạch chính thường kéo dài từ tháng 2 đến tháng 5.</p><p>Thời điểm thu hoạch tốt nhất là khi quả giả (trái điều) chín có màu vàng, hồng hoặc đỏ tươi (tùy giống) và hạt điều (quả thật) đã già, có vỏ cứng và chuyển sang màu xám tro. Khi đó, quả sẽ tự rụng xuống đất.</p>"
          },
          {
            "id": "cashew-c2l2",
            "title": "Phương pháp thu hoạch hạt",
            "content": "<h3>Thu nhặt hạt:</h3><p>Phương pháp thu hoạch chính là nhặt những quả đã rụng xuống đất hàng ngày. Cần dọn sạch cỏ và lá cây dưới tán để dễ dàng thu nhặt và tránh hạt bị ẩm mốc.</p><h3>Tách hạt khỏi quả giả:</h3><p>Sau khi nhặt, dùng tay hoặc dao để xoáy và tách hạt điều ra khỏi phần quả giả. Quả giả có thể được dùng để làm nước ép, rượu hoặc thức ăn cho gia súc.</p>"
          },
          {
            "id": "cashew-c2l3",
            "title": "Sơ chế và phơi khô hạt điều thô",
            "content": "<h3>Làm sạch:</h3><p>Hạt điều sau khi tách cần được làm sạch, loại bỏ đất cát và các tạp chất khác.</p><h3>Phơi khô:</h3><p>Đây là bước cực kỳ quan trọng, quyết định chất lượng và thời gian bảo quản. Hạt điều cần được phơi dưới nắng tốt trong 2-3 ngày, đảo đều thường xuyên. Độ ẩm tiêu chuẩn của hạt điều thô để bảo quản là 10-11%. Hạt quá khô sẽ làm nhân bị vỡ khi chế biến, hạt quá ẩm sẽ bị mốc, hỏng.</p><h3>Bảo quản hạt thô:</h3><p>Sau khi phơi khô, cho hạt vào bao tải sạch, thoáng khí và bảo quản ở nơi khô ráo, cao ráo, tránh chuột bọ.</p>"
          }
        ]
      },
      {
        "title": "Chương 3: Chế biến hạt điều",
        "lessons": [
          {
            "id": "cashew-c3l1",
            "title": "Phân loại hạt điều thô",
            "content": "<h3>Mục đích:</h3><p>Phân loại hạt thô theo kích cỡ (size) trước khi chế biến giúp tăng hiệu quả của các công đoạn sau (hấp, cắt), đồng thời nâng cao giá trị của thành phẩm.</p><h3>Phương pháp:</h3><p>Sử dụng máy sàng để phân loại hạt thành các kích cỡ khác nhau. Kích cỡ được đo bằng số hạt/kg. Ví dụ: size lớn (dưới 180 hạt/kg), size trung bình, size nhỏ...</p>"
          },
          {
            "id": "cashew-c3l2",
            "title": "Quy trình hấp và cắt tách vỏ",
            "content": "<h3>Hấp hạt:</h3><p>Hạt điều thô được đưa vào lò hấp bằng hơi nước bão hòa. Mục đích của việc hấp là làm cho vỏ hạt giòn hơn, đồng thời làm cho lớp dầu vỏ (CNSL - một loại axit) chảy ra một phần, giúp cho việc cắt tách vỏ dễ dàng hơn và giảm tỷ lệ nhân bị dính dầu.</p><h3>Cắt tách vỏ:</h3><p>Đây là công đoạn tốn nhiều lao động nhất. Có hai phương pháp:</p><ul><li><strong>Cắt thủ công:</strong> Công nhân dùng máy cắt chuyên dụng để kẹp và tách đôi vỏ hạt. Phương pháp này cho tỷ lệ nhân nguyên vẹn cao nhưng năng suất thấp.</li><li><strong>Cắt tự động:</strong> Sử dụng các dây chuyền máy móc để tự động cắt và tách vỏ. Năng suất cao nhưng tỷ lệ nhân bị vỡ, gãy có thể cao hơn nếu không điều chỉnh máy tốt.</li></ul>"
          },
          {
            "id": "cashew-c3l3",
            "title": "Sấy và bóc vỏ lụa",
            "content": "<h3>Sấy nhân:</h3><p>Nhân điều sau khi tách vỏ còn ẩm và dính vỏ lụa. Cần phải đưa vào lò sấy ở nhiệt độ thích hợp (khoảng 70-80°C) trong nhiều giờ để làm khô nhân, giúp cho lớp vỏ lụa trở nên giòn và dễ dàng tách ra.</p><h3>Bóc vỏ lụa:</h3><p>Sau khi sấy, nhân được đưa vào máy bóc vỏ lụa chuyên dụng hoặc bóc bằng tay. Công đoạn này đòi hỏi sự khéo léo để tránh làm vỡ hoặc trầy xước bề mặt nhân.</p>"
          }
        ]
      },
      {
        "title": "Chương 4: Chất lượng và Thị trường",
        "lessons": [
          {
            "id": "cashew-c4l1",
            "title": "Phân loại hạt điều nhân",
            "content": "<h3>Tiêu chuẩn quốc tế (AFI):</h3><p>Hạt điều nhân được phân loại chủ yếu dựa trên kích cỡ, màu sắc và độ nguyên vẹn. Các loại phổ biến nhất bao gồm:</p><ul><li><strong>W180, W210, W240, W320, W450:</strong> Chữ 'W' (White) chỉ nhân trắng nguyên hạt. Con số chỉ số hạt trên mỗi pound (1 pound ≈ 0.454 kg). Ví dụ, W320 có nghĩa là có khoảng 320 hạt trong 1 pound, đây là loại phổ biến nhất. Số càng nhỏ, hạt càng to, giá trị càng cao.</li><li><strong>SW (Scorched Wholes):</strong> Nhân trắng nguyên hạt bị nám nhẹ.</li><li><strong>LP (Large Pieces), SP (Small Pieces):</strong> Các loại nhân vỡ.</li></ul>"
          },
          {
            "id": "cashew-c4l2",
            "title": "Đóng gói và bảo quản",
            "content": "<h3>Quy cách đóng gói xuất khẩu:</h3><p>Sau khi phân loại và kiểm soát chất lượng, hạt điều nhân thường được đóng gói trong các thùng thiếc hoặc bao nilon chuyên dụng.</p><h3>Công nghệ đóng gói:</h3><ul><li><strong>Hút chân không:</strong> Loại bỏ không khí ra khỏi bao bì.</li><li><strong>Bơm khí trơ (Nitơ):</strong> Sau khi hút chân không, khí Nitơ được bơm vào để làm đầy bao bì. Việc này giúp ngăn chặn quá trình oxy hóa, giữ cho hạt không bị hôi dầu và giữ được độ giòn lâu hơn.</li></ul><p>Bảo quản thành phẩm ở nơi khô ráo, thoáng mát.</p>"
          },
          {
            "id": "cashew-c4l3",
            "title": "Tiêu chuẩn xuất khẩu hạt điều",
            "content": "<h3>Các yêu cầu chính:</h3><p>Để xuất khẩu sang các thị trường khó tính như Mỹ, EU, Nhật Bản, sản phẩm hạt điều phải đáp ứng các tiêu chuẩn nghiêm ngặt về:</p><ul><li><strong>An toàn thực phẩm:</strong> Không có dư lượng thuốc BVTV vượt ngưỡng cho phép, không nhiễm nấm mốc (đặc biệt là Aflatoxin), không có tạp chất lạ. Các nhà máy phải có các chứng nhận như HACCP, BRC, ISO 22000.</li><li><strong>Chất lượng cảm quan:</strong> Hạt phải đúng kích cỡ, màu sắc, không có mùi vị lạ.</li><li><strong>Truy xuất nguồn gốc:</strong> Có khả năng truy xuất được nguồn gốc của lô hàng, từ vùng trồng đến nhà máy chế biến.</li></ul>"
          }
        ]
      }
    ]
  },
  "rubber-course-v1": {
    "title": "Kỹ thuật khai thác mủ Cao su",
    "meta": {
      "expert": "Chuyên gia Huỳnh Văn Lợi",
      "field": "Cây công nghiệp",
      "duration": "7 giờ"
    },
    "image": "https://images.unsplash.com/photo-1620673322108-a51b53c7c4e5?q=80&w=1974&auto=format&fit=crop",
    "imageAlt": "Khai thác mủ từ cây cao su",
    "sapo": "Hướng dẫn chi tiết kỹ thuật cạo mủ cao su đúng cách, sử dụng thuốc kích thích mủ và quản lý vườn cây trong giai đoạn khai thác.",
    "quizUrl": null,
    "chapters": [
      {
        "title": "Chương 1: Chuẩn bị khai thác",
        "lessons": [
          {
            "id": "rubber-c1l1",
            "title": "Xác định cây đủ tiêu chuẩn khai thác",
            "content": "<h3>Tiêu chuẩn vàng:</h3><p>Không nên cạo mủ quá sớm vì sẽ làm cây suy kiệt và giảm tuổi thọ. Cây cao su chỉ được đưa vào khai thác khi đạt 'vanh kinh tế'.</p><ul><li><strong>Đối với cây trồng từ hạt (thực sinh):</strong> Vanh thân cây (đo ở độ cao 1m từ mặt đất) phải đạt từ 50cm trở lên.</li><li><strong>Đối với cây ghép:</strong> Vanh thân cây (đo ở độ cao 1m) phải đạt từ 45-50cm trở lên.</li></ul><p>Ngoài ra, cần đảm bảo ít nhất 70% số cây trong vườn đạt tiêu chuẩn thì mới bắt đầu mở cạo đồng loạt để dễ quản lý.</p>"
          },
          {
            "id": "rubber-c1l2",
            "title": "Dụng cụ và trang thiết bị cần thiết",
            "content": "<h3>Bộ dụng cụ cơ bản của người cạo mủ:</h3><ul><li><strong>Dao cạo mủ:</strong> Là dụng cụ quan trọng nhất, có nhiều loại (dao đẩy, dao kéo). Dao phải luôn sắc bén để vết cạo ngọt, không làm tổn thương mạch mủ.</li><li><strong>Chén đựng mủ:</strong> Thường làm bằng sành hoặc nhựa, dùng để hứng mủ chảy ra.</li><li><strong>Kiềng đỡ chén:</strong> Làm bằng dây kẽm, dùng để cố định chén vào thân cây.</li><li><strong>Máng dẫn mủ (lưỡi gà):</strong> Làm bằng kim loại mỏng, dùng để dẫn dòng mủ chảy từ vết cạo vào chén.</li><li><strong>Thùng chứa mủ:</strong> Dùng để trút mủ từ các chén và vận chuyển về điểm tập kết.</li><li><strong>Đèn đội đầu:</strong> Vì công việc cạo mủ thường diễn ra vào sáng sớm khi trời còn tối.</li></ul>"
          },
          {
            "id": "rubber-c1l3",
            "title": "Mở miệng cạo và trang bị kiềng, chén",
            "content": "<h3>Kỹ thuật mở miệng cạo:</h3><ol><li><strong>Xác định hướng và độ cao:</strong> Miệng cạo đầu tiên được mở từ trái sang phải, ở độ cao khoảng 1-1.2m so với mặt đất.</li><li><strong>Kẻ đường:</strong> Dùng các dụng cụ chuyên dụng để kẻ một đường 'tiền' và một đường 'hậu' làm ranh giới cho phần vỏ sẽ cạo. Góc nghiêng của miệng cạo so với phương ngang khoảng 30-32 độ để mủ chảy tốt.</li><li><strong>Đóng máng dẫn mủ:</strong> Đóng máng dẫn mủ ngay phía dưới đường cạo hậu.</li><li><strong>Trang bị kiềng, chén:</strong> Đặt kiềng và chén ngay dưới máng dẫn mủ để hứng trọn dòng mủ.</li></ol><p>Thao tác mở miệng cạo ban đầu phải chính xác để định hình cho toàn bộ quá trình khai thác sau này.</p>"
          }
        ]
      },
      {
        "title": "Chương 2: Kỹ thuật cạo mủ",
        "lessons": [
          {
            "id": "rubber-c2l1",
            "title": "Các chế độ cạo mủ phổ biến",
            "content": "<h3>Chế độ cạo là gì?</h3><p>Là quy định về tần suất và cường độ cạo mủ, được ký hiệu ví dụ như S/2 d/2.</p><ul><li><strong>S/2 (cạo nửa vòng thân):</strong> Đây là chế độ phổ biến nhất.</li><li><strong>d/2 (cạo 2 ngày nghỉ 1 ngày):</strong> Tức là cạo liên tục 2 ngày, sau đó cho cây nghỉ 1 ngày.</li><li><strong>d/3 (cạo 1 ngày nghỉ 2 ngày):</strong> Tức là cạo 1 ngày, sau đó cho cây nghỉ 2 ngày. Chế độ này giúp cây bền sức hơn.</li></ul><p>Lựa chọn chế độ cạo phụ thuộc vào tuổi cây, sức khỏe của vườn cây và điều kiện lao động. Không nên cạo với cường độ quá cao (như cạo hàng ngày - d/1) vì sẽ làm cây nhanh suy kiệt.</p>"
          },
          {
            "id": "rubber-c2l2",
            "title": "Thao tác cạo mủ đúng kỹ thuật",
            "content": "<h3>Ba yếu tố vàng:</h3><ol><li><strong>Độ sâu vết cạo:</strong> Phải cạo càng sát tầng tượng tầng càng tốt nhưng tuyệt đối không được cạo phạm vào gỗ. Tầng tượng tầng là lớp tế bào mỏng có nhiệm vụ tái sinh vỏ, nếu bị tổn thương, vỏ cây sẽ không thể tái tạo. Độ sâu lý tưởng là cách tầng tượng tầng khoảng 1.0 - 1.5 mm.</li><li><strong>Độ dốc miệng cạo:</strong> Luôn duy trì độ dốc 30-32 độ để mủ chảy hết xuống chén, không bị tràn ra ngoài.</li><li><strong>Hao dăm (độ dày lát cạo):</strong> Mỗi lần cạo chỉ nên bào đi một lớp vỏ rất mỏng, khoảng 1.5 - 2.0 mm. Cạo quá dày sẽ làm lãng phí vỏ, rút ngắn chu kỳ khai thác của cây.</li></ol><p>Một người thợ cạo giỏi là người có thể duy trì ba yếu tố này một cách ổn định trong suốt quá trình cạo.</p>"
          },
          {
            "id": "rubber-c2l3",
            "title": "Những lỗi thường gặp khi cạo mủ",
            "content": "<h3>Các lỗi cần tránh:</h3><ul><li><strong>Cạo phạm (cạo đụng gỗ):</strong> Là lỗi nghiêm trọng nhất, làm tổn thương tầng tượng tầng. Vết cạo sẽ bị u lồi, khó cạo lại và cây có nguy cơ bị nấm bệnh xâm nhập.</li><li><strong>Cạo úp hoặc ngửa:</strong> Cạo không đúng độ dốc, làm mủ chảy tràn ra ngoài hoặc không chảy hết.</li><li><strong>Cạo quá hao dăm:</strong> Làm lãng phí vỏ, rút ngắn tuổi thọ khai thác của cây. Một cây cao su có chu kỳ khai thác khoảng 20-25 năm, nếu cạo quá hao, thời gian này sẽ bị rút ngắn đáng kể.</li></ul>"
          }
        ]
      },
      {
        "title": "Chương 3: Quản lý vườn cây khai thác",
        "lessons": [
          {
            "id": "rubber-c3l1",
            "title": "Bón phân cho cao su kinh doanh",
            "content": "<h3>Bù đắp dinh dưỡng:</h3><p>Việc lấy mủ hàng ngày cũng là lấy đi một lượng lớn dinh dưỡng từ cây. Do đó, phải bón phân đầy đủ để cây phục hồi sức khỏe, tái tạo vỏ và cho mủ ổn định.</p><h3>Lịch trình bón phân:</h3><ul><li><strong>Đầu mùa mưa:</strong> Bón phân có hàm lượng Đạm (N) và Lân (P) cao để thúc đẩy cây ra lá mới khỏe mạnh.</li><li><strong>Giữa và cuối mùa mưa:</strong> Bón phân có hàm lượng Kali (K) cao hơn để tăng cường sức chống chịu, giúp cây cứng cáp và tăng hàm lượng mủ.</li></ul><p>Lượng phân bón phụ thuộc vào tuổi cây và năng suất của vườn, thường dao động từ 400-600 kg NPK/ha/năm, chia làm 2-3 lần bón.</p>"
          },
          {
            "id": "rubber-c3l2",
            "title": "Sử dụng chất kích thích mủ",
            "content": "<h3>Chất kích thích mủ là gì?</h3><p>Thường là các hợp chất có chứa Ethephon, khi bôi lên miệng cạo sẽ giải phóng khí Ethylene, có tác dụng kéo dài thời gian chảy mủ, từ đó làm tăng sản lượng.</p><h3>Nguyên tắc sử dụng:</h3><p>Sử dụng chất kích thích mủ là 'con dao hai lưỡi'. Nếu lạm dụng sẽ làm cây suy kiệt nhanh chóng, gây khô miệng cạo. Cần tuân thủ nghiêm ngặt:</p><ul><li>Chỉ sử dụng trên những cây khỏe mạnh, từ 8-10 năm tuổi trở lên.</li><li>Chỉ bôi khi thời tiết khô ráo, không bôi trước và sau khi trời mưa.</li><li>Sử dụng nồng độ thấp và tần suất thưa (ví dụ 1.25% - 2.5%, 3-4 lần/năm).</li><li>Phải kết hợp với việc tăng cường bón phân để bù đắp dinh dưỡng cho cây.</li></ul>"
          },
          {
            "id": "rubber-c3l3",
            "title": "Phòng trị bệnh loét sọc mặt cạo",
            "content": "<h3>Triệu chứng:</h3><p>Là bệnh phổ biến nhất trên vườn cây khai thác, do nấm Phytophthora gây ra. Trên miệng cạo xuất hiện các sọc đen, thối, chảy nhựa có mùi hôi. Bệnh nặng có thể làm khô cả miệng cạo.</p><h3>Biện pháp phòng trừ:</h3><ul><li>Không cạo mủ khi trời mưa hoặc khi vỏ cây còn ướt.</li><li>Định kỳ phun các loại thuốc gốc đồng lên toàn bộ thân cây vào đầu mùa mưa.</li><li>Khi phát hiện bệnh, cạo sạch vùng bị bệnh và dùng các loại thuốc đặc trị (Metalaxyl, Mancozeb...) bôi trực tiếp lên vết thương. Ngưng cạo trên cây bị bệnh nặng để cây có thời gian phục hồi.</li></ul>"
          }
        ]
      },
      {
        "title": "Chương 4: Thu hoạch và Chất lượng",
        "lessons": [
          {
            "id": "rubber-c4l1",
            "title": "Thu hoạch và vận chuyển mủ",
            "content": "<h3>Thời gian thu hoạch (trút mủ):</h3><p>Sau khi cạo khoảng 2-4 giờ, mủ sẽ ngưng chảy. Công nhân sẽ đi trút mủ từ các chén vào thùng chứa. Cần loại bỏ tạp chất (lá cây, vỏ cây) ra khỏi chén trước khi trút.</p><h3>Các loại sản phẩm:</h3><ul><li><strong>Mủ nước (Latex):</strong> Là sản phẩm chính, được trút từ chén.</li><li><strong>Mủ đông (mủ chén):</strong> Là phần mủ đông lại trong chén sau khi trút.</li><li><strong>Mủ dây:</strong> Là phần mủ đông lại trên miệng cạo.</li></ul><p>Tất cả các loại mủ này đều được thu gom và bán cho nhà máy, nhưng mủ nước có giá trị cao nhất.</p>"
          },
          {
            "id": "rubber-c4l2",
            "title": "Pha chế chất chống đông",
            "content": "<h3>Tại sao cần chống đông?</h3><p>Mủ cao su sẽ tự đông lại sau một thời gian do hoạt động của vi sinh vật. Để giữ mủ ở dạng lỏng trong quá trình vận chuyển từ vườn cây đến nhà máy, cần phải sử dụng chất chống đông.</p><h3>Chất chống đông phổ biến:</h3><p>Dung dịch Amoniac (NH3) là chất được sử dụng phổ biến nhất. Một lượng nhỏ dung dịch Amoniac (nồng độ 5-10%) được cho vào thùng chứa trước khi đi trút mủ. Amoniac có tác dụng tăng độ pH của mủ, ức chế hoạt động của vi khuẩn và giữ cho mủ không bị đông tụ.</p>"
          },
          {
            "id": "rubber-c4l3",
            "title": "Đánh giá chất lượng mủ (độ DRC)",
            "content": "<h3>DRC là gì?</h3><p><strong>DRC (Dry Rubber Content)</strong> là Hàm lượng cao su khô, là tỷ lệ phần trăm khối lượng cao su khô có trong mủ nước. Đây là chỉ số quan trọng nhất để định giá mủ cao su. DRC càng cao, giá mủ càng cao.</p><h3>Yếu tố ảnh hưởng đến DRC:</h3><p>DRC bị ảnh hưởng bởi giống cây, tuổi cây, thời tiết (mưa nhiều làm loãng mủ, giảm DRC), và chế độ chăm sóc. Một vườn cây khỏe mạnh, được bón phân đầy đủ thường cho mủ có độ DRC cao (trên 30%).</p><h3>Cách đo:</h3><p>Tại các điểm thu mua, người ta sẽ lấy một mẫu mủ, cân trọng lượng, sau đó làm đông bằng axit, cán khô và sấy để xác định trọng lượng cao su khô, từ đó tính ra tỷ lệ % DRC.</p>"
          }
        ]
      }
    ]
  },
  "mango-course-v1": {
    "title": "Trồng Xoài Cát Hòa Lộc theo VietGAP",
    "meta": {
      "expert": "ThS. Võ Thanh Phong",
      "field": "Cây ăn quả",
      "duration": "8 giờ"
    },
    "image": "https://images.unsplash.com/photo-1591073113125-e4571194235b?q=80&w=1935&auto=format&fit=crop",
    "imageAlt": "Những quả xoài chín vàng trên cây",
    "sapo": "Quy trình canh tác xoài Cát Hòa Lộc tiên tiến, từ kỹ thuật xử lý ra hoa, bao trái đến các biện pháp phòng trừ sâu bệnh để đạt chuẩn xuất khẩu.",
    "quizUrl": null,
    "chapters": [
      {
        "title": "Chương 1: Giống và Trồng",
        "lessons": [
          {
            "id": "mango-c1l1",
            "title": "Chọn giống và thiết kế vườn xoài",
            "content": "<h3>Chọn giống:</h3><p>Để đảm bảo năng suất và chất lượng, cần chọn đúng giống Xoài Cát Hòa Lộc. Cây giống phải là cây ghép, có gốc ghép là xoài bưởi hoặc xoài sẻ để có khả năng thích nghi tốt. Mắt ghép phải được lấy từ cây mẹ đầu dòng khỏe mạnh, sạch bệnh, đã cho quả ổn định. Cây giống đủ tiêu chuẩn phải cao 60-80cm, mắt ghép liền tốt, lá xanh và không có dấu hiệu sâu bệnh.</p><h3>Thiết kế vườn:</h3><ul><li><strong>Đất trồng:</strong> Xoài Cát Hòa Lộc thích hợp với đất phù sa ven sông, đất thịt nhẹ, thoát nước tốt. Độ pH lý tưởng từ 5.5 - 7.0.</li><li><strong>Mật độ:</strong> Khoảng cách trồng phù hợp là 6m x 8m hoặc 8m x 8m (khoảng 150-200 cây/ha) để cây có đủ không gian phát triển tán và nhận ánh sáng.</li><li><strong>Lên mô/liếp:</strong> Ở vùng đất thấp, cần lên mô cao 0.5-0.8m để chống úng nước vào mùa mưa.</li></ul>"
          },
          {
            "id": "mango-c1l2",
            "title": "Kỹ thuật trồng và bón lót",
            "content": "<h3>Thời vụ:</h3><p>Thời điểm trồng tốt nhất là vào đầu mùa mưa (tháng 5-7 dương lịch) để cây con dễ bén rễ và phát triển.</p><h3>Chuẩn bị hố và bón lót:</h3><p>Đào hố trồng với kích thước 60x60x60 cm. Mỗi hố cần được bón lót bằng hỗn hợp:</p><ul><li>15-20 kg phân chuồng hoai mục.</li><li>0.5 kg vôi bột để khử trùng và nâng pH.</li><li>0.5 kg phân lân super.</li></ul><p>Trộn đều phân với lớp đất mặt và lấp hố trước khi trồng khoảng 1 tháng.</p><h3>Cách trồng:</h3><p>Dùng cuốc đào một lỗ nhỏ giữa hố, nhẹ nhàng xé bỏ vỏ bầu và đặt cây giống vào. Lấp đất sao cho mặt bầu cao hơn mặt đất tự nhiên. Nén đất xung quanh gốc, cắm cọc cố định và tưới đẫm nước.</p>"
          },
          {
            "id": "mango-c1l3",
            "title": "Tạo tán và tỉa cành cho cây con",
            "content": "<h3>Mục đích:</h3><p>Tạo tán trong giai đoạn kiến thiết (1-3 năm đầu) là cực kỳ quan trọng, giúp tạo ra một bộ khung cành khỏe mạnh, cân đối, thông thoáng, làm tiền đề cho việc cho trái sau này.</p><h3>Kỹ thuật:</h3><ul><li><strong>Bấm ngọn:</strong> Khi cây cao khoảng 0.8-1m, tiến hành bấm đọt để cây phân cành, tạo cành cấp 1.</li><li><strong>Tạo cành cấp 1:</strong> Chọn giữ lại 3-4 cành khỏe mạnh, mọc đều các hướng từ thân chính.</li><li><strong>Tạo cành cấp 2, 3:</strong> Từ các cành cấp 1, tiếp tục bấm ngọn để tạo cành cấp 2, và tương tự cho cành cấp 3.</li></ul><p>Thường xuyên tỉa bỏ các cành mọc yếu, cành vượt, cành mọc sâu trong tán để cây tập trung dinh dưỡng nuôi các cành khung chính.</p>"
          }
        ]
      },
      {
        "title": "Chương 2: Chăm sóc định kỳ",
        "lessons": [
          {
            "id": "mango-c2l1",
            "title": "Bón phân và tưới nước",
            "content": "<h3>Bón phân cho cây trưởng thành:</h3><p>Sau khi thu hoạch, cây cần được bón phân để phục hồi. Lượng phân bón tăng dần theo độ tuổi và sản lượng của cây.</p><ul><li><strong>Sau thu hoạch:</strong> Bón nhiều phân hữu cơ (20-30kg/gốc) kết hợp NPK có hàm lượng đạm cao để cây ra đọt non mới.</li><li><strong>Trước khi xử lý ra hoa:</strong> Bón phân có hàm lượng Lân và Kali cao (ví dụ NPK 10-50-10 hoặc 15-30-15) để kích thích phân hóa mầm hoa.</li><li><strong>Nuôi trái:</strong> Bón NPK có hàm lượng Kali cao để tăng độ ngọt và chất lượng quả.</li></ul><h3>Tưới nước:</h3><p>Xoài cần nhiều nước nhất vào giai đoạn ra hoa, đậu quả và quả đang lớn. Thiếu nước trong giai đoạn này sẽ gây rụng hoa, quả và làm giảm kích thước trái.</p>"
          },
          {
            "id": "mango-c2l2",
            "title": "Quản lý sâu bệnh hại thân lá",
            "content": "<h3>Các đối tượng chính:</h3><ul><li><strong>Rầy bông xoài:</strong> Gây hại nặng nhất trong giai đoạn ra hoa, chích hút nhựa làm hoa bị khô và rụng. Cần phun thuốc phòng trừ khi thấy rầy xuất hiện.</li><li><strong>Bệnh thán thư:</strong> Do nấm gây ra, tấn công lá non, hoa và quả, tạo thành các đốm đen. Bệnh phát triển mạnh khi thời tiết ẩm ướt. Phòng trừ bằng cách tỉa cành thông thoáng và phun thuốc gốc đồng hoặc các hoạt chất đặc trị khác.</li><li><strong>Sâu đục thân, cành:</strong> Cần thường xuyên kiểm tra vườn để phát hiện và tiêu diệt.</li></ul><p>Luôn tuân thủ nguyên tắc 4 đúng khi sử dụng thuốc BVTV và ghi chép nhật ký đầy đủ theo tiêu chuẩn VietGAP.</p>"
          },
          {
            "id": "mango-c2l3",
            "title": "Tỉa cành sau thu hoạch",
            "content": "<h3>Tầm quan trọng:</h3><p>Đây là công việc quan trọng để chuẩn bị cho vụ mùa tiếp theo. Mục đích là loại bỏ cành già yếu, sâu bệnh, tạo sự thông thoáng cho tán cây và kích thích cây ra các cơi đọt mới đồng loạt.</p><h3>Cách thực hiện:</h3><ul><li>Cắt bỏ các cành đã cho quả, cành khô, cành bị sâu bệnh.</li><li>Cắt bỏ các cành mọc quá dày, đan chéo vào nhau trong tán.</li><li>Sau khi tỉa, quét vôi hoặc các loại thuốc gốc đồng vào các vết cắt lớn để tránh nấm bệnh xâm nhập.</li></ul>"
          }
        ]
      },
      {
        "title": "Chương 3: Xử lý ra hoa và đậu quả",
        "lessons": [
          {
            "id": "mango-c3l1",
            "title": "Kỹ thuật xử lý ra hoa nghịch vụ",
            "content": "<h3>Nguyên tắc:</h3><p>Để xoài ra hoa theo ý muốn, cần tạo ra các điều kiện 'sốc' để phá vỡ trạng thái sinh trưởng sinh dưỡng và chuyển sang sinh trưởng sinh sản.</p><h3>Các bước thực hiện:</h3><ol><li>Sau khi tỉa cành và bón phân phục hồi, đợi cây ra 1-2 cơi đọt mới và lá đã già.</li><li>Phun các chất ức chế sinh trưởng như Paclobutrazol (với liều lượng khuyến cáo) lên lá hoặc tưới vào gốc để 'hãm' cây, giúp cây tạo mầm hoa.</li><li>Sau khoảng 45-60 ngày, phun các chất phá vỡ miên trạng như Thioure hoặc KNO3 để kích thích mầm hoa bung ra đồng loạt.</li></ol>"
          },
          {
            "id": "mango-c3l2",
            "title": "Tăng đậu quả và nuôi dưỡng quả non",
            "content": "<h3>Giai đoạn hoa nở:</h3><p>Cần giữ cho vườn khô ráo, tránh tưới nước trực tiếp lên hoa. Phun bổ sung các loại phân bón lá chứa Canxi và Bo để tăng sức sống hạt phấn, giúp hoa thụ phấn tốt hơn, tăng tỷ lệ đậu quả.</p><h3>Tỉa quả:</h3><p>Sau khi quả đậu khoảng 2-3 tuần, cần tiến hành tỉa quả. Mỗi chùm chỉ nên giữ lại 1-2 quả to, tròn đều, không bị sâu bệnh. Việc này giúp cây tập trung dinh dưỡng để nuôi quả lớn, mẫu mã đẹp và chất lượng cao.</p>"
          },
          {
            "id": "mango-c3l3",
            "title": "Kỹ thuật bao trái và phòng trừ ruồi đục quả",
            "content": "<h3>Tại sao phải bao trái?</h3><p>Bao trái là biện pháp kỹ thuật bắt buộc trong sản xuất xoài xuất khẩu. Lợi ích:</p><ul><li>Ngăn chặn hiệu quả ruồi đục quả và các loại sâu bệnh khác gây hại cho trái.</li><li>Giảm lượng thuốc BVTV phun trực tiếp lên quả, đảm bảo an toàn thực phẩm.</li><li>Giúp vỏ quả có màu sắc sáng đẹp, bóng, không bị trầy xước, nâng cao giá trị thương phẩm.</li></ul><h3>Thời điểm và cách bao trái:</h3><p>Tiến hành bao trái khi quả lớn bằng quả trứng gà. Sử dụng các loại túi bao chuyên dụng (thường là túi giấy có lớp sáp bên trong). Trước khi bao, có thể phun một lượt thuốc trừ nấm bệnh để phòng ngừa. Lồng túi vào quả và dùng dây kẽm có sẵn trên miệng túi để buộc lại.</p>"
          }
        ]
      },
      {
        "title": "Chương 4: Thu hoạch và Bảo quản",
        "lessons": [
          {
            "id": "mango-c4l1",
            "title": "Xác định độ chín và thu hái",
            "content": "<h3>Dấu hiệu thu hoạch:</h3><p>Xoài Cát Hòa Lộc được thu hoạch khi vỏ quả chuyển sang màu xanh vàng, da căng bóng, phần vai quả (gần cuống) nở to, tròn đầy. Không nên để quả chín vàng trên cây vì sẽ khó vận chuyển và bảo quản.</p><h3>Kỹ thuật thu hái:</h3><p>Nên thu hoạch vào lúc trời mát. Dùng kéo sắc cắt cuống xoài, chừa lại một đoạn cuống dài khoảng 5-10cm. Hái nhẹ nhàng, tránh làm rơi hoặc va đập quả gây dập nát. Dùng giấy hoặc lá cây lót vào giỏ đựng để tránh nhựa từ cuống dính vào vỏ quả gây nám đen.</p>"
          },
          {
            "id": "mango-c4l2",
            "title": "Xử lý sau thu hoạch (rửa, làm khô)",
            "content": "<h3>Quy trình xử lý:</h3><ol><li><strong>Lau mủ:</strong> Dùng khăn sạch lau khô mủ ở cuống quả.</li><li><strong>Rửa quả:</strong> Rửa quả trong nước sạch để loại bỏ bụi bẩn. Có thể xử lý bằng nước nóng (52°C trong 5 phút) để diệt trừ một số mầm bệnh và trứng sâu hại, giúp kéo dài thời gian bảo quản.</li><li><strong>Làm khô:</strong> Để quả khô tự nhiên trong bóng râm hoặc dùng quạt gió để làm khô bề mặt quả trước khi đóng gói.</li></ol>"
          },
          {
            "id": "mango-c4l3",
            "title": "Đóng gói và bảo quản xoài",
            "content": "<h3>Phân loại và đóng gói:</h3><p>Phân loại quả theo kích thước và trọng lượng. Loại bỏ những quả không đạt tiêu chuẩn. Mỗi quả xoài được bọc trong một lớp lưới xốp và xếp cẩn thận vào thùng carton có lỗ thông hơi.</p><h3>Bảo quản:</h3><p>Xoài Cát Hòa Lộc có thể được bảo quản ở nhiệt độ phòng trong vài ngày. Để bảo quản lâu hơn cho mục đích vận chuyển xa hoặc xuất khẩu, cần bảo quản trong kho lạnh ở nhiệt độ 10-12°C. Ở nhiệt độ này, xoài có thể giữ được độ tươi ngon trong khoảng 2-3 tuần.</p>"
          }
        ]
      }
    ]
  },
  "duck-farming-v1": {
    "title": "Chăn nuôi Vịt an toàn sinh học",
    "meta": {
      "expert": "KS. Mai Anh Tuấn",
      "field": "Chăn nuôi",
      "duration": "7 giờ"
    },
    "image": "https://images.unsplash.com/photo-1563502392901-2d9987285bcb?q=80&w=2070&auto=format&fit=crop",
    "imageAlt": "Đàn vịt đang bơi trong ao",
    "sapo": "Hướng dẫn kỹ thuật chăn nuôi vịt thịt và vịt đẻ trứng an toàn, hiệu quả, đặc biệt là các biện pháp phòng chống cúm gia cầm.",
    "quizUrl": null,
    "chapters": [
      {
        "title": "Chương 1: Chuẩn bị chăn nuôi",
        "lessons": [
          {
            "id": "duck-c1l1",
            "title": "Chọn giống vịt phù hợp",
            "content": "<h3>Các giống vịt phổ biến:</h3><ul><li><strong>Vịt hướng thịt:</strong><ul><li><strong>Vịt Siêu thịt (Super Meat/CV Super M):</strong> Lớn rất nhanh, thời gian nuôi ngắn (45-50 ngày), tỷ lệ thịt cao.</li><li><strong>Vịt Cherry Valley:</strong> Giống vịt của Anh, khả năng tăng trọng tốt, thịt ngon.</li></ul></li><li><strong>Vịt hướng trứng:</strong><ul><li><strong>Vịt Khaki Campbell:</strong> Nổi tiếng thế giới về sản lượng trứng, có thể đẻ trên 300 trứng/năm.</li><li><strong>Vịt Cỏ:</strong> Giống vịt địa phương, trứng thơm ngon, sức đề kháng tốt nhưng sản lượng trứng thấp hơn.</li></ul></li><li><strong>Vịt kiêm dụng (thịt - trứng):</strong><ul><li><strong>Vịt Bầu:</strong> Giống vịt địa phương, dễ nuôi, cho cả thịt và trứng.</li></ul></li></ul><h3>Tiêu chí chọn vịt con (1 ngày tuổi):</h3><p>Chọn những con nhanh nhẹn, mắt sáng, lông bông khô, bụng thon gọn, rốn khô và kín. Loại bỏ những con dị tật, khèo chân, hở rốn.</p>"
          },
          {
            "id": "duck-c1l2",
            "title": "Thiết kế chuồng trại và ao",
            "content": "<h3>Mô hình nuôi kết hợp:</h3><p>Mô hình lý tưởng cho vịt là 'nửa sàn, nửa ao' hoặc 'chuồng sàn trên ao'.</p><ul><li><strong>Chuồng nuôi:</strong> Phải khô ráo, sạch sẽ, thông thoáng. Nền chuồng có thể lót trấu hoặc làm sàn lưới/sàn tre cách mặt đất 40-50cm để dễ dọn vệ sinh. Mái che phải chống nóng và chống dột tốt.</li><li><strong>Sân chơi:</strong> Là khu vực khô ráo nối liền chuồng và ao, cho vịt vận động.</li><li><strong>Ao/Bể bơi:</strong> Nước là môi trường không thể thiếu của vịt. Ao giúp vịt làm sạch lông, giao phối và điều hòa thân nhiệt. Nguồn nước phải sạch và cần có cống cấp-thoát nước chủ động để dễ dàng thay nước, giữ vệ sinh.</li></ul><p>Mật độ nuôi trong chuồng khoảng 4-5 con/m².</p>"
          },
          {
            "id": "duck-c1l3",
            "title": "Kỹ thuật úm vịt con",
            "content": "<h3>Giai đoạn quyết định (1-4 tuần tuổi):</h3><p>Giai đoạn úm quyết định tỷ lệ sống và sự đồng đều của cả đàn. Vịt con rất nhạy cảm với nhiệt độ thấp.</p><h3>Các bước thực hiện:</h3><ol><li><strong>Chuẩn bị quây úm:</strong> Dùng cót ép hoặc lưới để quây một khu vực trong chuồng. Rải chất độn chuồng (trấu) dày 5-7cm.</li><li><strong>Sưởi ấm:</strong> Dùng bóng đèn hồng ngoại hoặc đèn sợi đốt để sưởi. Tuần đầu tiên, nhiệt độ trong quây úm phải đạt 32-34°C, sau đó giảm dần 2-3°C mỗi tuần.</li><li><strong>Nước uống:</strong> Ngay khi bắt vịt về, phải cho uống nước sạch có pha vitamin, điện giải để chống stress.</li><li><strong>Thức ăn:</strong> Sau khi cho uống nước 2-3 giờ mới bắt đầu cho ăn. Dùng cám chuyên dụng cho vịt con, rải trên khay hoặc mẹt cho vịt dễ ăn.</li></ol>"
          }
        ]
      },
      {
        "title": "Chương 2: Dinh dưỡng",
        "lessons": [
          {
            "id": "duck-c2l1",
            "title": "Nhu cầu dinh dưỡng của vịt",
            "content": "<h3>Nhu cầu Protein:</h3><p>Vịt là loài thủy cầm, có tốc độ sinh trưởng nhanh nên nhu cầu về đạm cao hơn gà.</p><ul><li><strong>Giai đoạn 1-3 tuần tuổi:</strong> 20-22% protein.</li><li><strong>Giai đoạn 4-8 tuần tuổi:</strong> 16-18% protein.</li><li><strong>Vịt đẻ:</strong> 17-19% protein, đặc biệt cần hàm lượng Canxi cao (3.5-4%).</li></ul><h3>Nguồn thức ăn:</h3><p>Ngoài thức ăn công nghiệp, có thể bổ sung các loại thức ăn tự nhiên như ốc, cá nhỏ, giun đất và các loại rau xanh (bèo tấm, rau muống) để tăng cường dinh dưỡng và giảm chi phí.</p>"
          },
          {
            "id": "duck-c2l2",
            "title": "Các loại thức ăn cho vịt",
            "content": "<h3>Thức ăn công nghiệp:</h3><p>Là lựa chọn tiện lợi và đảm bảo cân đối dinh dưỡng. Có các loại cám viên chuyên dụng cho từng giai đoạn: úm, vịt thịt, vịt đẻ.</p><h3>Thức ăn tự phối trộn:</h3><p>Có thể tận dụng các nguyên liệu địa phương. Một công thức tham khảo: 40% cám gạo, 30% ngô, 20% khô dầu đậu tương, 10% bột cá. Cần bổ sung thêm premix khoáng-vitamin để đảm bảo đủ vi chất.</p>"
          },
          {
            "id": "duck-c2l3",
            "title": "Kỹ thuật cho ăn và quản lý",
            "content": "<h3>Nguyên tắc:</h3><p>Luôn cung cấp đủ nước sạch trước khi cho ăn. Vịt cần rất nhiều nước để ăn và tiêu hóa. Máng ăn, máng uống phải được vệ sinh hàng ngày.</p><h3>Cho ăn:</h3><p>Chia làm nhiều bữa trong ngày (3-4 bữa) để vịt ăn được nhiều hơn và tránh lãng phí. Đặt máng ăn ở nơi khô ráo trong chuồng, không đặt ngoài sân chơi hoặc gần ao để tránh thức ăn bị ẩm mốc.</p>"
          }
        ]
      },
      {
        "title": "Chương 3: Quản lý sức khỏe",
        "lessons": [
          {
            "id": "duck-c3l1",
            "title": "Vệ sinh và sát trùng chuồng trại",
            "content": "<h3>Vệ sinh hàng ngày:</h3><p>Thu dọn phân, thay chất độn chuồng ở những chỗ bị ướt. Cọ rửa máng ăn, máng uống. Thay nước ao/bể bơi nếu bị bẩn.</p><h3>Sát trùng định kỳ:</h3><p>Phun thuốc sát trùng toàn bộ khu vực chuồng trại, sân chơi định kỳ 1-2 lần/tuần để tiêu diệt mầm bệnh. Rắc vôi bột ở lối đi và xung quanh chuồng.</p><h3>Xử lý cuối vụ:</h3><p>Thực hiện nguyên tắc 'cùng vào - cùng ra'. Sau khi xuất bán, cần tổng vệ sinh, sát trùng và để trống chuồng ít nhất 2 tuần.</p>"
          },
          {
            "id": "duck-c3l2",
            "title": "Lịch vaccine cho vịt",
            "content": "<h3>Vaccine là bắt buộc:</h3><p>Tiêm phòng đầy đủ là biện pháp hiệu quả nhất để bảo vệ đàn vịt khỏi các bệnh truyền nhiễm nguy hiểm.</p><h3>Lịch trình tham khảo:</h3><ul><li><strong>1 ngày tuổi:</strong> Vaccine Viêm gan siêu vi trùng type 1.</li><li><strong>7-10 ngày tuổi:</strong> Vaccine Dịch tả vịt lần 1.</li><li><strong>14-18 ngày tuổi:</strong> Vaccine Cúm gia cầm (H5N1) lần 1.</li><li><strong>21-28 ngày tuổi:</strong> Vaccine Tụ huyết trùng và Dịch tả vịt lần 2.</li><li><strong>45 ngày tuổi:</strong> Vaccine Cúm gia cầm lần 2.</li></ul>"
          },
          {
            "id": "duck-c3l3",
            "title": "Phòng chống bệnh cúm gia cầm H5N1",
            "content": "<h3>Mức độ nguy hiểm:</h3><p>Vịt có thể mang virus cúm gia cầm mà không có biểu hiện triệu chứng rõ ràng, trở thành nguồn lây bệnh nguy hiểm cho các loại gia cầm khác và cả con người.</p><h3>An toàn sinh học là ưu tiên số 1:</h3><ul><li><strong>Nuôi cách ly:</strong> Không nuôi chung vịt với các loại gia cầm khác (gà, ngan...).</li><li><strong>Kiểm soát người ra vào:</strong> Hạn chế người lạ vào khu vực chăn nuôi. Phải có hố sát trùng ở cổng.</li><li><strong>Vệ sinh, sát trùng:</strong> Thực hiện nghiêm ngặt.</li><li><strong>Tiêm phòng đầy đủ:</strong> Tiêm vaccine cúm gia cầm là biện pháp bắt buộc.</li><li><strong>Giám sát:</strong> Thường xuyên theo dõi sức khỏe đàn vịt. Khi có dấu hiệu bất thường hoặc chết hàng loạt, phải báo ngay cho cơ quan thú y.</li></ul>"
          }
        ]
      },
      {
        "title": "Chương 4: Chăn nuôi vịt đẻ",
        "lessons": [
          {
            "id": "duck-c4l1",
            "title": "Chăm sóc vịt giai đoạn hậu bị",
            "content": "<h3>Giai đoạn hậu bị (từ 9 đến 20-22 tuần tuổi):</h3><p>Đây là giai đoạn nuôi vịt từ lúc hết giai đoạn sinh trưởng đến khi bắt đầu đẻ. Mục tiêu là phát triển một khung xương tốt và đạt trọng lượng tiêu chuẩn, không quá mập hoặc quá ốm.</p><h3>Chế độ ăn:</h3><p>Giai đoạn này cần kiểm soát lượng thức ăn để vịt không bị quá béo, sẽ ảnh hưởng đến khả năng đẻ trứng sau này. Cho ăn thức ăn có hàm lượng protein và năng lượng vừa phải (khoảng 15-16% đạm).</p>"
          },
          {
            "id": "duck-c4l2",
            "title": "Dinh dưỡng cho vịt đẻ",
            "content": "<h3>Nhu cầu dinh dưỡng đặc biệt:</h3><p>Khi vịt bắt đầu đẻ, nhu cầu dinh dưỡng, đặc biệt là Canxi và Protein, tăng vọt để tạo vỏ trứng và lòng đỏ.</p><ul><li><strong>Protein:</strong> Cần thức ăn có hàm lượng đạm 17-19%.</li><li><strong>Canxi:</strong> Cần hàm lượng Canxi trong thức ăn rất cao, khoảng 3.5-4%. Phải bổ sung thêm các nguồn canxi như bột vỏ sò, đá vôi.</li></ul><h3>Ổ đẻ:</h3><p>Cần chuẩn bị các ổ đẻ sạch sẽ, khô ráo, lót rơm mềm và đặt ở nơi yên tĩnh, ít ánh sáng để vịt vào đẻ.</p>"
          },
          {
            "id": "duck-c4l3",
            "title": "Thu hoạch và bảo quản trứng",
            "content": "<h3>Thu hoạch:</h3><p>Vịt thường đẻ trứng vào ban đêm và sáng sớm. Cần thu hoạch trứng 2-3 lần vào buổi sáng để tránh trứng bị dơ, dập vỡ.</p><h3>Xử lý và bảo quản:</h3><ul><li>Loại bỏ những quả trứng dập, vỡ, vỏ mỏng, dị dạng.</li><li>Nếu trứng bị bẩn, chỉ nên dùng khăn khô hoặc giấy nhám để lau sạch, hạn chế rửa bằng nước vì sẽ làm mất lớp màng bảo vệ tự nhiên của vỏ trứng.</li><li>Xếp trứng vào khay chuyên dụng, đầu to hướng lên trên.</li><li>Bảo quản ở nơi khô ráo, thoáng mát. Nếu có điều kiện, bảo quản ở nhiệt độ 10-15°C sẽ giữ trứng tươi được lâu hơn.</li></ul>"
          }
        ]
      }
    ]
  },
  "goat-farming-v1": {
    "title": "Kỹ thuật chăn nuôi Dê",
    "meta": {
      "expert": "Chuyên gia Trần Văn Nam",
      "field": "Chăn nuôi",
      "duration": "8 giờ"
    },
    "image": "https://images.unsplash.com/photo-1524024922129-528577023b37?q=80&w=2073&auto=format&fit=crop",
    "imageAlt": "Một con dê đang ăn cỏ",
    "sapo": "Khóa học toàn diện về chăn nuôi dê, từ chọn giống, làm chuồng trại, trồng cỏ, đến phòng bệnh và kỹ thuật sinh sản.",
    "quizUrl": null,
    "chapters": [
      {
        "title": "Chương 1: Giống và Chuồng trại",
        "lessons": [
          {
            "id": "goat-c1l1",
            "title": "Các giống dê phổ biến",
            "content": "<h3>Lựa chọn giống phù hợp:</h3><p>Việc chọn đúng giống quyết định hướng đi và hiệu quả kinh tế của trang trại.</p><ul><li><strong>Dê Bách Thảo:</strong> Giống dê kiêm dụng của Việt Nam, vừa cho thịt vừa cho sữa. Dê có màu lông đen, tai to cụp, thích nghi rất tốt với điều kiện khí hậu nước ta, dễ nuôi, mắn đẻ.</li><li><strong>Dê Boer:</strong> Giống dê chuyên thịt hàng đầu thế giới, có nguồn gốc từ Nam Phi. Dê có thân hình vạm vỡ, đầu và cổ màu nâu đỏ, thân màu trắng. Tốc độ lớn nhanh, tỷ lệ thịt cao. Thường được dùng làm đực giống để lai cải tạo đàn dê địa phương.</li><li><strong>Dê Saanen:</strong> Giống dê chuyên sữa của Thụy Sĩ, có màu lông trắng, sản lượng sữa rất cao. Yêu cầu điều kiện chăm sóc và dinh dưỡng cao.</li></ul><h3>Tiêu chí chọn con giống:</h3><p>Chọn những con có ngoại hình cân đối, nhanh nhẹn, lông mượt, mắt sáng. Dê cái có bầu vú phát triển đều, cân đối. Dê đực có hai dịch hoàn to, đều nhau.</p>"
          },
          {
            "id": "goat-c1l2",
            "title": "Thiết kế chuồng trại trên sàn",
            "content": "<h3>Tại sao phải làm chuồng sàn?</h3><p>Dê là loài không ưa ẩm ướt. Làm chuồng sàn giúp dê luôn khô ráo, sạch sẽ, giảm thiểu các bệnh về móng chân và các bệnh do ký sinh trùng. Phân và nước tiểu sẽ lọt xuống dưới, dễ dàng thu dọn.</p><h3>Yêu cầu thiết kế:</h3><ul><li><strong>Vật liệu:</strong> Khung chuồng có thể làm bằng gỗ, tre hoặc sắt. Sàn chuồng dùng các thanh gỗ hoặc tre có mặt phẳng, bào nhẵn, đặt cách nhau 1-1.5cm.</li><li><strong>Độ cao sàn:</strong> Sàn chuồng phải cao hơn mặt đất ít nhất 0.8 - 1.2m.</li><li><strong>Diện tích:</strong> Đảm bảo diện tích tối thiểu 1.5 - 2.0 m²/dê cái sinh sản và 0.7 - 1.0 m²/dê con.</li><li><strong>Máng ăn, máng uống:</strong> Treo ở phía ngoài vách chuồng để tránh dê làm bẩn thức ăn, nước uống. Chiều cao máng phải ngang tầm vai của dê.</li></ul>"
          },
          {
            "id": "goat-c1l3",
            "title": "Trồng và chế biến thức ăn thô xanh",
            "content": "<h3>Chủ động nguồn thức ăn:</h3><p>Thức ăn xanh chiếm 60-70% khẩu phần của dê. Chủ động trồng cỏ giúp đảm bảo nguồn cung ổn định và chất lượng.</p><h3>Các loại cỏ và cây lá giàu dinh dưỡng:</h3><ul><li><strong>Cỏ Voi, Cỏ Ghine:</strong> Các giống cỏ cho năng suất rất cao.</li><li><strong>Cây họ đậu:</strong> Keo dậu, so đũa, chè đại... là nguồn cung cấp protein rất tốt.</li><li><strong>Lá cây:</strong> Dê rất thích ăn các loại lá cây như lá mít, lá chuối, lá sắn (phải phơi héo để giảm độc tố).</li></ul><h3>Chế biến và dự trữ:</h3><p>Vào mùa mưa, khi thức ăn dồi dào, có thể dự trữ cho mùa khô bằng cách:</p><ul><li><strong>Phơi khô:</strong> Cỏ, lá cây được phơi khô để làm thức ăn dự trữ.</li><li><strong>Ủ chua (Silage):</strong> Băm nhỏ cỏ, thân cây ngô, trộn với một ít rỉ mật đường và muối, sau đó nén chặt trong túi hoặc hố ủ để lên men. Thức ăn ủ chua rất thơm và giàu dinh dưỡng.</li></ul>"
          }
        ]
      },
      {
        "title": "Chương 2: Dinh dưỡng và Chăm sóc",
        "lessons": [
          {
            "id": "goat-c2l1",
            "title": "Nhu cầu dinh dưỡng của dê",
            "content": "<h3>Khẩu phần cân đối:</h3><p>Một khẩu phần ăn cho dê cần cân đối giữa thức ăn thô xanh, thức ăn tinh và khoáng.</p><ul><li><strong>Thức ăn thô xanh:</strong> Cung cấp chất xơ, vitamin. Cho ăn tự do hoặc theo định lượng khoảng 10-15% trọng lượng cơ thể.</li><li><strong>Thức ăn tinh:</strong> Cung cấp năng lượng và protein, bao gồm các loại ngũ cốc (ngô, cám), khô dầu. Lượng thức ăn tinh tùy thuộc vào giai đoạn (mang thai, nuôi con).</li><li><strong>Khoáng chất:</strong> Rất quan trọng. Dê cần được cung cấp đá liếm chuyên dụng hoặc bổ sung khoáng và muối ăn vào khẩu phần. Thiếu khoáng sẽ làm dê chậm lớn, sinh sản kém.</li></ul>"
          },
          {
            "id": "goat-c2l2",
            "title": "Phối trộn thức ăn tinh",
            "content": "<h3>Tận dụng nguyên liệu địa phương:</h3><p>Có thể tự phối trộn thức ăn tinh để giảm chi phí. Công thức tham khảo cho 10kg thức ăn:</p><ul><li>Bột ngô: 5 kg</li><li>Cám gạo: 3 kg</li><li>Khô dầu đậu tương: 1.5 kg</li><li>Bột xương: 0.3 kg</li><li>Muối ăn: 0.1 kg</li><li>Premix khoáng: 0.1 kg</li></ul><p>Lượng cho ăn khoảng 0.3 - 0.5 kg/con/ngày đối với dê cái mang thai hoặc đang nuôi con.</p>"
          },
          {
            "id": "goat-c2l3",
            "title": "Chăm sóc dê con và dê cái sinh sản",
            "content": "<h3>Chăm sóc dê con:</h3><ul><li><strong>Sữa đầu:</strong> Phải cho dê con bú sữa đầu của mẹ trong vòng vài giờ đầu sau sinh. Sữa đầu cung cấp kháng thể giúp dê con chống lại bệnh tật.</li><li><strong>Cắt rốn:</strong> Dùng kéo sạch cắt rốn và sát trùng bằng cồn iod.</li><li><strong>Giữ ấm:</strong> Chuồng cho dê con phải kín gió và đủ ấm.</li></ul><h3>Chăm sóc dê mẹ:</h3><p>Sau khi đẻ, dê mẹ cần được chăm sóc đặc biệt. Cung cấp nước uống sạch (có thể pha thêm chút muối, đường). Bổ sung thức ăn tinh và các loại lá cây bổ dưỡng để dê mẹ nhanh hồi phục và có nhiều sữa cho con.</p>"
          }
        ]
      },
      {
        "title": "Chương 3: Sức khỏe và Sinh sản",
        "lessons": [
          {
            "id": "goat-c3l1",
            "title": "Các bệnh thường gặp ở dê",
            "content": "<h3>Các bệnh chính và cách phòng:</h3><ul><li><strong>Bệnh Tụ huyết trùng:</strong> Bệnh truyền nhiễm cấp tính, thường xảy ra khi thời tiết thay đổi. Cần tiêm vaccine phòng bệnh định kỳ.</li><li><strong>Bệnh Đậu dê:</strong> Bệnh do virus gây ra các nốt mụn trên da, miệng. Tiêm vaccine là biện pháp phòng bệnh hiệu quả.</li><li><strong>Bệnh viêm phổi:</strong> Thường do chuồng trại ẩm thấp, lạnh và kém vệ sinh.</li><li><strong>Bệnh tiêu chảy (đặc biệt ở dê con):</strong> Do thức ăn bẩn hoặc nhiễm khuẩn E.coli, Coccidia (cầu trùng). Cần giữ vệ sinh thức ăn, nước uống và chuồng trại.</li></ul>"
          },
          {
            "id": "goat-c3l2",
            "title": "Tẩy giun sán và phòng bệnh",
            "content": "<h3>Tẩy giun sán:</h3><p>Dê rất dễ bị nhiễm các loại giun sán đường ruột, gan. Cần xây dựng một lịch tẩy giun sán định kỳ cho toàn đàn (3-4 tháng/lần) bằng các loại thuốc thú y chuyên dụng.</p><h3>Phòng bệnh ngoài da:</h3><p>Thường xuyên kiểm tra để phát hiện ghẻ, ve. Giữ chuồng trại sạch sẽ, khô ráo. Có thể dùng các loại thuốc tiêm hoặc thuốc bôi để điều trị ghẻ.</p>"
          },
          {
            "id": "goat-c3l3",
            "title": "Quản lý sinh sản và phối giống",
            "content": "<h3>Phát hiện động dục:</h3><p>Dê cái động dục có các biểu hiện: kêu la, ăn uống kém, phá chuồng, âm hộ sưng đỏ, chảy dịch và ve vẩy đuôi liên tục. Chu kỳ động dục của dê khoảng 18-21 ngày, thời gian động dục kéo dài 2-3 ngày.</p><h3>Thời điểm phối giống:</h3><p>Thời điểm phối giống tốt nhất là vào ngày thứ hai của chu kỳ động dục. Dê mang thai khoảng 5 tháng (145-155 ngày).</p><p>Cần có sổ sách theo dõi ngày phối giống, ngày dự kiến đẻ cho từng con để có kế hoạch chăm sóc phù hợp.</p>"
          }
        ]
      },
      {
        "title": "Chương 4: Khai thác sản phẩm",
        "lessons": [
          {
            "id": "goat-c4l1",
            "title": "Nuôi dê lấy thịt",
            "content": "<h3>Thời điểm xuất bán:</h3><p>Dê thịt thường được xuất bán khi đạt trọng lượng khoảng 30-40 kg (khoảng 7-9 tháng tuổi). Giai đoạn này dê có tỷ lệ thịt cao và chất lượng thịt ngon.</p><h3>Vỗ béo:</h3><p>Trước khi xuất bán 1-2 tháng, có thể áp dụng chế độ vỗ béo bằng cách tăng cường thức ăn tinh trong khẩu phần và hạn chế vận động để dê tích lũy mỡ, giúp thịt mềm và béo hơn.</p>"
          },
          {
            "id": "goat-c4l2",
            "title": "Nuôi dê lấy sữa",
            "content": "<h3>Kỹ thuật vắt sữa:</h3><p>Chỉ vắt sữa từ các giống dê chuyên sữa như Saanen. Cần đảm bảo vệ sinh tuyệt đối trong quá trình vắt sữa:</p><ul><li>Vệ sinh sạch sẽ bầu vú, tay người vắt và dụng cụ đựng sữa.</li><li>Vắt bỏ vài tia sữa đầu tiên.</li><li>Sau khi vắt xong, dùng khăn ấm lau lại bầu vú.</li></ul><p>Sữa dê sau khi vắt cần được lọc và làm lạnh ngay để bảo quản.</p>"
          },
          {
            "id": "goat-c4l3",
            "title": "Xử lý phân dê làm phân bón",
            "content": "<h3>Phân dê - 'Vàng đen' cho cây trồng:</h3><p>Phân dê ở dạng viên, khô, ít mùi và rất giàu dinh dưỡng. Đây là một trong những loại phân hữu cơ tốt nhất cho cây trồng, đặc biệt là hoa hồng, cây cảnh và rau màu.</p><h3>Cách xử lý:</h3><p>Phân dê thu gom được nên được ủ với chế phẩm sinh học (như Trichoderma) hoặc ủ cùng với rơm rạ, lá cây để tạo thành phân compost hoai mục. Không nên bón phân tươi trực tiếp cho cây vì có thể gây nóng và sót rễ.</p>"
          }
        ]
      }
    ]
  },
  "finance-course-v1": {
    "title": "Quản lý tài chính cho nông hộ",
    "meta": {
      "expert": "Chuyên gia tài chính Đào Thu Trang",
      "field": "Kinh tế nông nghiệp",
      "duration": "6 giờ"
    },
    "image": "https://images.unsplash.com/photo-1554224155-1696413565d3?q=80&w=2070&auto=format&fit=crop",
    "imageAlt": "Một người đang tính toán với máy tính và sổ sách",
    "sapo": "Học cách quản lý dòng tiền, ghi chép sổ sách, tính toán chi phí - lợi nhuận, và tiếp cận các nguồn vốn vay ưu đãi cho nông nghiệp.",
    "quizUrl": null,
    "chapters": [
      {
        "title": "Chương 1: Nguyên tắc cơ bản",
        "lessons": [
          {
            "id": "finance-c1l1",
            "title": "Tại sao cần quản lý tài chính?",
            "content": "<h3>Từ làm nông đến kinh doanh nông nghiệp:</h3><p>Nhiều bà con nông dân thường chỉ tính toán đơn giản 'thu được bao nhiêu, trừ đi những gì đã bỏ ra'. Tuy nhiên, để làm giàu từ nông nghiệp, chúng ta cần xem trang trại của mình như một doanh nghiệp. Quản lý tài chính giúp trả lời các câu hỏi cốt lõi:</p><ul><li><strong>Lãi/Lỗ thực sự là bao nhiêu?</strong> Giúp biết được hoạt động sản xuất có hiệu quả hay không.</li><li><strong>Tiền đang đi đâu?</strong> Nhận diện được những khoản chi phí nào đang quá cao, khoản nào có thể cắt giảm.</li><li><strong>Có nên đầu tư không?</strong> Cung cấp cơ sở để quyết định có nên mua thêm máy móc, mở rộng trang trại hay không.</li><li><strong>Làm sao để vay vốn?</strong> Một hệ thống sổ sách rõ ràng là bằng chứng thuyết phục nhất đối với các ngân hàng và tổ chức tín dụng.</li></ul><p>Quản lý tài chính không phức tạp, nó chỉ đơn giản là thói quen ghi chép và kiểm soát 'túi tiền' của gia đình và trang trại một cách có hệ thống.</p>"
          },
          {
            "id": "finance-c1l2",
            "title": "Phân biệt chi phí và đầu tư",
            "content": "<h3>Hiểu đúng để quyết định đúng:</h3><p>Nhầm lẫn giữa chi phí và đầu tư có thể dẫn đến các quyết định sai lầm. </p><ul><li><strong>Chi phí (Expense):</strong> Là những khoản tiền bạn bỏ ra để duy trì hoạt động sản xuất trong một chu kỳ ngắn, ví dụ: tiền mua phân bón, thuốc trừ sâu, tiền công lao động thời vụ. Chi phí sẽ 'mất đi' sau mỗi vụ mùa.</li><li><strong>Đầu tư (Investment):</strong> Là những khoản tiền bạn bỏ ra để mua sắm các tài sản có giá trị sử dụng lâu dài, giúp tăng năng suất hoặc giảm chi phí trong tương lai. Ví dụ: tiền mua máy cày, tiền lắp đặt hệ thống tưới tự động, tiền xây dựng nhà kính.</li></ul><h3>Tại sao cần phân biệt?</h3><p>Việc phân biệt rõ ràng giúp bạn tính toán chính xác lợi nhuận. Chi phí được trừ trực tiếp vào doanh thu của vụ đó. Trong khi đó, giá trị của khoản đầu tư sẽ được tính khấu hao dần qua nhiều năm, chứ không tính hết vào một vụ.</p>"
          },
          {
            "id": "finance-c1l3",
            "title": "Các công cụ ghi chép đơn giản",
            "content": "<h3>Bắt đầu từ những gì đơn giản nhất:</h3><p>Bạn không cần phải là một kế toán chuyên nghiệp. Hãy bắt đầu bằng những công cụ quen thuộc:</p><ul><li><strong>Sổ tay ghi chép:</strong> Một cuốn sổ tay chia làm hai cột THU và CHI là đủ để bắt đầu. Hãy tập thói quen ghi lại TẤT CẢ các khoản thu chi hàng ngày, dù là nhỏ nhất.</li><li><strong>Bảng tính Excel hoặc Google Sheets:</strong> Nếu bạn quen dùng máy tính hoặc điện thoại thông minh, các công cụ này rất mạnh mẽ. Bạn có thể tạo các bảng tính để tự động cộng trừ, phân loại chi phí và vẽ biểu đồ.</li><li><strong>Ứng dụng quản lý tài chính:</strong> Có nhiều ứng dụng miễn phí trên điện thoại giúp bạn ghi chép thu chi một cách trực quan và tiện lợi.</li></ul><p>Điều quan trọng nhất không phải là công cụ, mà là sự <strong>kỷ luật</strong> và <strong>nhất quán</strong> trong việc ghi chép hàng ngày.</p>"
          }
        ]
      },
      {
        "title": "Chương 2: Lập kế hoạch và Dự toán",
        "lessons": [
          {
            "id": "finance-c2l1",
            "title": "Lập kế hoạch sản xuất kinh doanh",
            "content": "<h3>Đừng đi mà không có bản đồ:</h3><p>Kế hoạch sản xuất kinh doanh chính là tấm bản đồ cho vụ mùa của bạn. Một kế hoạch cơ bản cần trả lời:</p><ul><li><strong>Trồng cây gì, nuôi con gì?</strong> Dựa trên điều kiện đất đai, kinh nghiệm và nhu cầu thị trường.</li><li><strong>Sản lượng dự kiến là bao nhiêu?</strong></li><li><strong>Giá bán dự kiến là bao nhiêu?</strong> (Tham khảo giá các năm trước).</li><li><strong>Doanh thu dự kiến = Sản lượng x Giá bán.</strong></li><li><strong>Các hoạt động chính cần làm là gì?</strong> (Làm đất, bón phân, tưới nước, phòng bệnh, thu hoạch...).</li></ul>"
          },
          {
            "id": "finance-c2l2",
            "title": "Dự toán chi phí cho một vụ mùa",
            "content": "<h3>Liệt kê tất cả các chi phí có thể phát sinh:</h3><p>Đây là bước quan trọng nhất trong việc lập kế hoạch. Hãy chia chi phí thành các nhóm:</p><ul><li><strong>Chi phí vật tư:</strong> Giống, phân bón, thuốc BVTV, vôi, rơm rạ...</li><li><strong>Chi phí nhân công:</strong> Tiền thuê người làm đất, gieo trồng, chăm sóc, thu hoạch... (Nếu gia đình tự làm, cũng nên tạm tính công của mình để biết hiệu quả thực sự).</li><li><strong>Chi phí thuê mướn:</strong> Tiền thuê đất (nếu có), thuê máy móc (máy cày, máy gặt...).</li><li><strong>Chi phí khác:</strong> Tiền điện, nước, chi phí vận chuyển, bao bì...</li></ul><p><strong>Tổng chi phí dự toán = Chi phí vật tư + Chi phí nhân công + Chi phí thuê mướn + Chi phí khác.</strong></p>"
          },
          {
            "id": "finance-c2l3",
            "title": "Phân tích điểm hòa vốn",
            "content": "<h3>Điểm hòa vốn là gì?</h3><p>Là mức sản lượng hoặc doanh thu mà tại đó, tổng doanh thu vừa đủ để bù đắp tổng chi phí (lợi nhuận bằng 0). Bất kỳ sản phẩm nào bán được sau điểm hòa vốn đều là lợi nhuận ròng.</p><h3>Cách tính đơn giản:</h3><p><strong>Sản lượng hòa vốn = Tổng chi phí / Đơn giá bán dự kiến.</strong></p><p><u>Ví dụ:</u> Tổng chi phí dự toán cho 1 ha lúa là 20 triệu đồng. Giá lúa dự kiến là 5,000 đồng/kg. Vậy sản lượng hòa vốn = 20,000,000 / 5,000 = 4,000 kg (tức 4 tấn). Điều này có nghĩa là bạn phải thu hoạch được ít nhất 4 tấn lúa thì mới không bị lỗ.</p><p>Biết được điểm hòa vốn giúp bạn đặt ra mục tiêu năng suất rõ ràng và có chiến lược sản xuất phù hợp.</p>"
          }
        ]
      },
      {
        "title": "Chương 3: Quản lý dòng tiền",
        "lessons": [
          {
            "id": "finance-c3l1",
            "title": "Theo dõi thu chi hàng ngày",
            "content": "<h3>Dòng tiền là 'mạch máu':</h3><p>Dòng tiền là sự lưu chuyển của tiền vào và ra khỏi 'túi' của bạn. Một trang trại có thể có lãi trên giấy tờ nhưng vẫn phá sản nếu không quản lý tốt dòng tiền (ví dụ: đến lúc cần tiền mua phân bón thì không có sẵn tiền mặt).</p><h3>Cách theo dõi:</h3><p>Lập một cuốn sổ hoặc bảng tính đơn giản, ghi lại tất cả các giao dịch phát sinh:</p><ul><li><strong>Cột 'Ngày':</strong> Ghi ngày tháng diễn ra giao dịch.</li><li><strong>Cột 'Nội dung':</strong> Mô tả giao dịch (ví dụ: 'Bán 100kg xoài', 'Mua 2 bao phân NPK').</li><li><strong>Cột 'Thu vào':</strong> Ghi số tiền nhận được.</li><li><strong>Cột 'Chi ra':</strong> Ghi số tiền đã chi.</li><li><strong>Cột 'Tồn cuối ngày':</strong> Số tiền còn lại.</li></ul><p>Việc này giúp bạn luôn biết mình có bao nhiêu tiền và có đủ tiền cho các hoạt động sắp tới hay không.</p>"
          },
          {
            "id": "finance-c3l2",
            "title": "Tối ưu hóa chi phí sản xuất",
            "content": "<h3>Giảm chi phí không có nghĩa là cắt bỏ:</h3><p>Tối ưu hóa là sử dụng chi phí một cách thông minh để đạt hiệu quả cao nhất. Dựa vào sổ sách ghi chép, bạn có thể xem xét:</p><ul><li><strong>Chi phí nào cao nhất?</strong> Thường là thức ăn chăn nuôi hoặc phân bón. Có thể tìm nhà cung cấp khác có giá tốt hơn không? Có thể tự phối trộn thức ăn, tự ủ phân hữu cơ để giảm chi phí không?</li><li><strong>Sử dụng vật tư hiệu quả:</strong> Bón phân theo kết quả phân tích đất, sử dụng thuốc BVTV theo nguyên tắc 4 đúng để tránh lãng phí.</li><li><strong>Tận dụng phụ phẩm:</strong> Dùng rơm rạ, thân cây ngô để ủ phân hoặc làm thức ăn cho gia súc.</li></ul>"
          },
          {
            "id": "finance-c3l3",
            "title": "Lập quỹ dự phòng rủi ro",
            "content": "<h3>'Trời không chiều lòng người':</h3><p>Nông nghiệp luôn tiềm ẩn nhiều rủi ro: thiên tai, dịch bệnh, giá cả thị trường biến động... Một khoản tiền dự phòng sẽ là 'phao cứu sinh' giúp bạn vượt qua những giai đoạn khó khăn.</p><h3>Cách lập quỹ:</h3><p>Sau mỗi vụ mùa có lãi, hãy cam kết trích ra một tỷ lệ nhất định (ví dụ: 10-15% lợi nhuận) để đưa vào quỹ dự phòng. Khoản tiền này nên được giữ riêng, không dùng cho các mục đích chi tiêu thông thường. Khi quỹ đã đủ lớn (ví dụ: đủ để trang trải chi phí cho một vụ mùa), bạn sẽ có một tấm đệm an toàn vững chắc.</p>"
          }
        ]
      },
      {
        "title": "Chương 4: Tiếp cận nguồn vốn",
        "lessons": [
          {
            "id": "finance-c4l1",
            "title": "Các nguồn vốn vay ưu đãi",
            "content": "<h3>Các kênh vay vốn chính thống:</h3><p>Khi cần vốn để mở rộng sản xuất, đầu tư, hãy tìm đến các nguồn vốn chính thống với lãi suất hợp lý, tránh xa 'tín dụng đen'.</p><ul><li><strong>Ngân hàng Nông nghiệp và Phát triển Nông thôn (Agribank):</strong> Là ngân hàng chủ lực, có nhiều chính sách và gói vay ưu đãi dành riêng cho nông nghiệp, nông dân.</li><li><strong>Ngân hàng Chính sách xã hội:</strong> Cung cấp các khoản vay cho hộ nghèo, hộ cận nghèo và các đối tượng chính sách khác để phát triển sản xuất.</li><li><strong>Quỹ Hỗ trợ Nông dân:</strong> Được thành lập bởi Hội Nông dân, cung cấp các khoản vay với lãi suất thấp để hỗ trợ các mô hình sản xuất hiệu quả.</li></ul>"
          },
          {
            "id": "finance-c4l2",
            "title": "Xây dựng phương án vay vốn",
            "content": "<h3>Làm sao để ngân hàng tin tưởng bạn?</h3><p>Ngân hàng sẽ chỉ cho vay khi họ thấy được kế hoạch của bạn rõ ràng và có khả năng trả nợ. Một phương án vay vốn (hay kế hoạch sản xuất kinh doanh) thuyết phục cần có:</p><ul><li><strong>Mục đích vay vốn:</strong> Vay để làm gì? (Mua giống, mua máy móc, xây chuồng trại...).</li><li><strong>Số tiền cần vay:</strong> Cần vay bao nhiêu?</li><li><strong>Kế hoạch sản xuất:</strong> Trình bày dự toán chi phí, doanh thu, lợi nhuận dự kiến (như đã học ở Chương 2).</li><li><strong>Khả năng trả nợ:</strong> Dựa trên lợi nhuận dự kiến, bạn sẽ trả nợ gốc và lãi như thế nào?</li><li><strong>Tài sản đảm bảo (nếu có):</strong> Sổ đỏ, giấy tờ có giá trị...</li></ul><p>Tất cả các con số này đều phải được lấy từ sổ sách ghi chép tài chính của bạn. Đây là lý do tại sao việc ghi chép lại quan trọng đến vậy.</p>"
          },
          {
            "id": "finance-c4l3",
            "title": "Quản lý và trả nợ hiệu quả",
            "content": "<h3>Vay vốn là đòn bẩy, không phải gánh nặng:</h3><p>Sử dụng vốn vay một cách khôn ngoan sẽ giúp bạn phát triển nhanh hơn.</p><ul><li><strong>Sử dụng vốn đúng mục đích:</strong> Tuyệt đối không dùng tiền vay sản xuất vào các mục đích chi tiêu cá nhân khác.</li><li><strong>Theo dõi tiến độ:</strong> Luôn bám sát kế hoạch sản xuất đã đề ra. Nếu có rủi ro, cần có phương án xử lý ngay.</li><li><strong>Lập kế hoạch trả nợ:</strong> Dựa trên dòng tiền thu về, lên kế hoạch trích tiền để trả nợ đúng hạn, tránh bị phạt lãi suất quá hạn.</li><li><strong>Giao tiếp với ngân hàng:</strong> Nếu gặp khó khăn do thiên tai, dịch bệnh, hãy chủ động làm việc với ngân hàng để tìm giải pháp cơ cấu lại khoản nợ (gia hạn nợ, giảm lãi suất...), không nên im lặng và trốn tránh.</li></ul>"
          }
        ]
      }
    ]
  },
  "orange-course-v1": {
    "title": "Canh tác Cam sành theo tiêu chuẩn VietGAP",
    "meta": {
      "expert": "KS. Bùi Thế Trung",
      "field": "Cây ăn quả",
      "duration": "8 giờ"
    },
    "image": "https://images.unsplash.com/photo-1611080279831-9a72315a6b09?q=80&w=1974&auto=format&fit=crop",
    "imageAlt": "Những quả cam sành mọng nước trên cây",
    "sapo": "Quy trình toàn diện về trồng, chăm sóc, và phòng trừ sâu bệnh cho cây cam sành, giúp nâng cao năng suất, chất lượng và giá trị thương phẩm.",
    "quizUrl": null,
    "chapters": [
      {
        "title": "Chương 1: Chuẩn bị vườn trồng",
        "lessons": [
          {
            "id": "orange-c1l1",
            "title": "Chọn đất và chuẩn bị liếp trồng",
            "content": "<h3>Yêu cầu về đất đai:</h3><p>Cam sành phát triển tốt trên đất thịt pha cát, giàu mùn, tơi xốp và đặc biệt là phải thoát nước tốt. Độ pH lý tưởng của đất là từ 5.5 đến 6.5. Vùng đất trồng cần chủ động được nguồn nước tưới và không bị ngập úng kéo dài.</p><h3>Thiết kế vườn và liếp:</h3><ul><li><strong>Lên liếp (Mô):</strong> Đối với các vùng đất trũng như ở Đồng bằng sông Cửu Long, việc lên liếp là bắt buộc. Liếp trồng nên rộng từ 7-8m, cao 0.6-1.0m so với mặt nước trong mương. Mương nước phải rộng ít nhất 1.5-2m để đảm bảo thoát nước tốt trong mùa mưa.</li><li><strong>Mật độ trồng:</strong> Khoảng cách trồng phù hợp cho cam sành là 4m x 5m hoặc 5m x 5m, tương đương mật độ 400-500 cây/ha. Trồng mật độ hợp lý giúp vườn thông thoáng, giảm sâu bệnh và dễ dàng chăm sóc.</li></ul>"
          },
          {
            "id": "orange-c1l2",
            "title": "Lựa chọn giống cam sạch bệnh",
            "content": "<h3>Tầm quan trọng của cây giống:</h3><p>Bệnh vàng lá Greening là mối đe dọa lớn nhất đối với cây có múi. Do đó, việc chọn nguồn giống sạch bệnh là yếu tố sống còn.</p><h3>Tiêu chuẩn chọn giống:</h3><ul><li><strong>Nguồn gốc:</strong> Phải mua cây giống từ các cơ sở, viện nghiên cứu uy tín, có chứng nhận sạch bệnh.</li><li><strong>Gốc ghép:</strong> Cây giống phải là cây ghép. Gốc ghép thường dùng là cam mật, chanh hoặc bưởi bung để có bộ rễ khỏe, thích nghi tốt và kháng bệnh thối rễ.</li><li><strong>Tiêu chuẩn cây giống:</strong> Cây phải khỏe mạnh, lá xanh tốt, không có biểu hiện vàng lá, xoăn lá. Chiều cao cây từ 60cm trở lên, mắt ghép đã liền sẹo tốt và mọc thành chồi khỏe mạnh.</li></ul>"
          },
          {
            "id": "orange-c1l3",
            "title": "Kỹ thuật trồng và chăm sóc cây con",
            "content": "<h3>Thời vụ trồng:</h3><p>Nên trồng vào đầu mùa mưa (tháng 5-7) để cây con nhanh chóng ổn định và phát triển, tiết kiệm được công tưới.</p><h3>Kỹ thuật trồng:</h3><ol><li>Đào hố trồng kích thước 60x60x60 cm.</li><li>Bón lót cho mỗi hố: 15-20kg phân chuồng hoai mục + 0.5kg vôi + 1kg phân lân. Trộn đều với đất và lấp hố trước khi trồng 1 tháng.</li><li>Khi trồng, xé bỏ túi bầu, đặt cây vào giữa hố sao cho mặt bầu cao hơn mặt đất xung quanh. Lấp đất, nén nhẹ và tưới đẫm nước.</li><li>Cắm cọc để cố định cây, tránh gió làm lung lay gốc. Tủ gốc bằng rơm rạ để giữ ẩm và giữ mát cho đất.</li></ol>"
          }
        ]
      },
      {
        "title": "Chương 2: Chăm sóc cây trưởng thành",
        "lessons": [
          {
            "id": "orange-c2l1",
            "title": "Tưới nước và quản lý độ ẩm",
            "content": "<h3>Nhu cầu nước:</h3><p>Cam sành cần nhiều nước, đặc biệt là trong giai đoạn ra hoa, đậu quả và quả đang lớn nhanh. Thiếu nước sẽ làm rụng hoa, quả non và làm giảm kích thước, chất lượng quả. Tuy nhiên, cây cũng không chịu được ngập úng, cần đảm bảo thoát nước tốt vào mùa mưa.</p><h3>Phương pháp tưới:</h3><p>Nên áp dụng hệ thống tưới tiết kiệm như tưới phun mưa tại gốc hoặc tưới nhỏ giọt để cung cấp đủ nước và tránh lãng phí.</p>"
          },
          {
            "id": "orange-c2l2",
            "title": "Bón phân và tỉa cành tạo tán",
            "content": "<h3>Bón phân:</h3><p>Cần bón phân cân đối theo từng giai đoạn:</p><ul><li><strong>Sau thu hoạch:</strong> Bón nhiều phân hữu cơ và NPK có hàm lượng đạm cao để cây phục hồi và ra cơi đọt mới.</li><li><strong>Trước ra hoa:</strong> Tăng cường Lân và Kali để kích thích phân hóa mầm hoa.</li><li><strong>Nuôi quả:</strong> Cần nhiều Kali để quả to, ngọt và có màu sắc đẹp. Bổ sung Canxi và Bo để chống nứt quả.</li></ul><h3>Tỉa cành, tạo tán:</h3><p>Sau mỗi vụ thu hoạch, cần tỉa bỏ các cành già, cành sâu bệnh, cành mọc yếu, cành vượt để tạo sự thông thoáng cho cây, giúp cây tập trung dinh dưỡng nuôi cành mới khỏe mạnh và giảm áp lực sâu bệnh.</p>"
          },
          {
            "id": "orange-c2l3",
            "title": "Xử lý ra hoa và tăng đậu quả",
            "content": "<h3>Xử lý ra hoa:</h3><p>Để cây ra hoa tập trung, sau khi cây ra 1-2 cơi đọt mới và lá đã già, có thể áp dụng biện pháp 'xiết nước' (ngưng tưới) trong 2-4 tuần. Khi thấy lá hơi héo, tưới đẫm trở lại, kết hợp phun các sản phẩm tạo mầm hoa (NPK hàm lượng Lân cao), cây sẽ ra hoa đồng loạt.</p><h3>Tăng đậu quả:</h3><p>Trong giai đoạn hoa nở, phun bổ sung các vi lượng như Bo, Kẽm để tăng sức sống hạt phấn. Có thể thụ phấn bổ sung bằng tay hoặc nuôi ong trong vườn. Khi quả đã đậu, tiến hành tỉa bỏ những quả méo mó, sâu bệnh, chỉ giữ lại những quả đẹp trên chùm.</p>"
          }
        ]
      },
      {
        "title": "Chương 3: Phòng trừ sâu bệnh hại",
        "lessons": [
          {
            "id": "orange-c3l1",
            "title": "Bệnh vàng lá greening và cách phòng trị",
            "content": "<h3>Tác hại:</h3><p>Đây là bệnh nguy hiểm nhất, không có thuốc chữa, do vi khuẩn gây ra và lây lan qua rầy chổng cánh. Cây bị bệnh sẽ vàng lá, gân xanh, quả nhỏ, méo mó và rụng sớm.</p><h3>Biện pháp phòng trừ tổng hợp:</h3><ol><li><strong>Sử dụng giống sạch bệnh:</strong> Đây là biện pháp quan trọng hàng đầu.</li><li><strong>Quản lý rầy chổng cánh:</strong> Phun thuốc trừ rầy định kỳ, đặc biệt là khi cây ra đọt non.</li><li><strong>Vệ sinh vườn:</strong> Thường xuyên dọn dẹp cỏ dại, cắt bỏ các cành bị bệnh.</li><li><strong>Kiểm tra và tiêu hủy:</strong> Thường xuyên kiểm tra vườn. Nếu phát hiện cây có triệu chứng bệnh, cần nhổ bỏ và tiêu hủy ngay để tránh lây lan.</li></ol>"
          },
          {
            "id": "orange-c3l2",
            "title": "Phòng trừ sâu vẽ bùa, nhện đỏ",
            "content": "<h3>Sâu vẽ bùa:</h3><p>Sâu non đục vào lá non, tạo ra các đường ngoằn ngoèo. Lá bị hại sẽ cong queo, biến dạng, làm giảm khả năng quang hợp và là cửa ngõ cho bệnh loét xâm nhập. Phòng trừ bằng cách phun thuốc khi cây vừa nhú đọt non.</p><h3>Nhện đỏ:</h3><p>Chích hút nhựa trên lá và vỏ quả, làm lá bị vàng và vỏ quả có các đốm li ti, sần sùi (gọi là da lu, da cám), làm mất giá trị thương phẩm. Phun các loại thuốc đặc trị nhện khi mật độ cao, đặc biệt là trong mùa khô.</p>"
          },
          {
            "id": "orange-c3l3",
            "title": "Các bệnh loét, ghẻ và thối quả",
            "content": "<h3>Bệnh loét (do vi khuẩn):</h3><p>Gây ra các vết thương hở trên lá, cành và quả. Vết bệnh có màu vàng nâu, sần sùi. Bệnh lây lan mạnh qua mưa và gió. Phòng trừ bằng các loại thuốc gốc đồng.</p><h3>Bệnh ghẻ (do nấm):</h3><p>Tạo ra các nốt sần sùi màu xám trên vỏ quả và lá, làm quả xấu xí. Phòng trừ tương tự như bệnh loét.</p><h3>Bệnh thối quả (do nấm):</h3><p>Thường xảy ra vào mùa mưa, gây thối quả hàng loạt. Cần tỉa cành thông thoáng, thoát nước tốt và phun thuốc phòng ngừa khi thời tiết ẩm ướt kéo dài.</p>"
          }
        ]
      },
      {
        "title": "Chương 4: Thu hoạch và Bảo quản",
        "lessons": [
          {
            "id": "orange-c4l1",
            "title": "Xác định độ chín và kỹ thuật thu hái",
            "content": "<h3>Dấu hiệu thu hoạch:</h3><p>Thu hoạch khi quả đạt kích thước tối đa, vỏ quả chuyển từ màu xanh đậm sang xanh sáng hoặc hơi ngả vàng, da căng và bóng. Thường là khoảng 8-9 tháng sau khi đậu quả.</p><h3>Kỹ thuật hái:</h3><p>Nên thu hoạch vào ngày nắng ráo. Dùng kéo sắc cắt sát cuống quả, thao tác nhẹ nhàng, tránh làm trầy xước vỏ. Không nên thu hái khi quả còn ướt sương hoặc sau cơn mưa vì dễ bị thối hỏng.</p>"
          },
          {
            "id": "orange-c4l2",
            "title": "Phân loại và sơ chế quả",
            "content": "<h3>Phân loại:</h3><p>Sau khi thu hoạch, cần phân loại quả theo kích thước, trọng lượng và chất lượng. Loại bỏ những quả bị sâu bệnh, dị dạng, trầy xước.</p><h3>Sơ chế:</h3><p>Dùng khăn mềm, ẩm để lau sạch bụi bẩn trên vỏ quả. Không nên rửa quả trực tiếp trong nước vì nước có thể đọng lại ở cuống và gây thối. Để quả ở nơi khô ráo, thoáng mát.</p>"
          },
          {
            "id": "orange-c4l3",
            "title": "Bảo quản quả tươi lâu",
            "content": "<h3>Bảo quản ở nhiệt độ thường:</h3><p>Cam sành có thể được bảo quản ở nơi thoáng mát trong khoảng 1-2 tuần.</p><h3>Bảo quản lạnh:</h3><p>Để kéo dài thời gian bảo quản nhằm vận chuyển đi xa, cần đưa cam vào kho lạnh. Nhiệt độ bảo quản lý tưởng là khoảng 8-10°C, độ ẩm 85-90%. Trong điều kiện này, cam có thể giữ được độ tươi trong khoảng 4-6 tuần.</p>"
          }
        ]
      }
    ]
  }
}
